{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Microsoft Authenticator 4+",
  "subtitle": "Protects your online identity",
  "seller": "Microsoft Corporation",
  "stars": "4.8",
  "rating": "432.8K Ratings",
  "price": "Free",
  "appDescription": "Use Microsoft Authenticator for easy, secure sign-ins for all your online accounts using multi-factor authentication, passwordless, or password autofill. You also have additional account management options for your Microsoft personal, work or school accounts. Getting started with multi-factor authentication Multi factor authentication (MFA)provides a second layer of security. When enabled, during login after entering your password, you’ll be asked for an additional way to prove it’s really you. Either approve the notification sent to the Microsoft Authenticator, or enter the one-time password (OTP) generated by the app. The OTP codes have a 30 second timer counting down. This timer is so you never have to use the same time-based one-time password (TOTP) twice and you don’t have to remember the number. The OTP doesn’t require you to be connected to a network, and it won’t drain your battery. You can add multiple accounts to your app, including non-Microsoft accounts like Facebook, Amazon, Dropbox, Google, LinkedIn, GitHub, and more. Getting started with passwordless Use your phone, not your password, to log into your Microsoft account. Just enter your username, then approve the notification sent to your phone. Your fingerprint, face ID, or PIN will provide a second layer of security in this two-step verification process. After you’ve signed in with two factor authentication (2FA), you’ll have access to all your Microsoft products and services, such as Outlook, OneDrive, Office, and more. Getting started with autofill Microsoft Authenticator app can also autofill passwords for you. Sign-in on the Passwords tab inside the Authenticator app with your personal Microsoft account to start syncing passwords, including the passwords saved in Microsoft Edge. Make Microsoft Authenticator the default autofill provider and start autofilling passwords on apps and sites you visit on your mobile. Your passwords are protected with multi-factor authentication in the app. You will need to prove yourself with your fingerprint, face ID, or PIN to access and autofill passwords on your mobile. You can also import passwords from Google Chrome and other password managers. Microsoft personal, work or school accounts Sometimes your work or school might ask you to install the Microsoft Authenticator when accessing certain organization resources. You will need to register your device to your organization through the app and add your work or school account. Microsoft Authenticator supports cert-based authentication by issuing a certificate on your device. This will let your organization know that the sign-in request is coming from a trusted device and help you seamlessly and securely access additional Microsoft apps and services without needing to log into each. more",
  "reviews": [
    {
      "user": "yframed",
      "date": "12/08/2020",
      "title": "Best authentication app I’ve used by far",
      "review": "This authentication app provides multitudes of features that allow users to authenticate in many different ways and allows for more than just two steps in verifying your identity—providing for an even more secure experience, if that’s what you’re looking for. I previously used Google Authenticator for most of my accounts and ended up losing a couple accounts over that. This app pulled the rug from under Google’s alternative and forced them to update their app after two years to make it actually usable for their consumers. Even after the updates, this app reigns supreme with the great abundance of security features it provides to users. Although the smoothness in transitions and smooth feel of the app overall be better, the UI is modern and I applaud Microsoft for that. I’d also like to applaud them for pushing the application heavily on their website. Even more people deserve to know about it and I believe it should be also pushed in advertisements. All in all, this is as close to perfection any authentication app has ever gotten and by far. more"
    },
    {
      "user": "ryanack24",
      "date": "12/22/2021",
      "title": "Love the App! But could use some improvements",
      "review": "Overall, I love the app. It does its job and I can't argue with its functionality. However, I give it a four star because I do have a few concerns and complaints I'd like to see implemented. Its the simple aesthetics of the design of the authenticator. I would love to see folder/group settings implemented where you can group codes together under a drop down menu, instead of just having a whole spew of a list of random codes you have to scroll through. Something similar to the functionality of 2FAS Auth. Another thing I'd love to see would be Icons used instead of a boring, plain grey, busthead (maybe use the MS MFA logo?) When a logo isn't supported. Which I would like to also see more support on is icon support from various different services. I find only few companies like FB, Gitbub, and a few others are on the app. Again, I think my biggest complaint is to make it look more sexy of a design and UX. It's kind of boring at the moment. But overall, great app! more"
    },
    {
      "user": "Pop culture nerd",
      "date": "02/01/2024",
      "title": "Useless",
      "review": "Until the most recent iOS update I was able to log into my Microsoft Outlook work email account without any issues. Now, every time I attempt to login it pulls up the authentication app I receive an error stating my sign in was successful but does not meet the criteria to access this resource. I do not know what this means but the issue is I can no access my work email. I’m hoping this a software update bug that will be resolved soon. You cannot access this right now Your sign-in was successful but does not meet the criteria to access this resource. For example, you might be signing in from a browser, app, or location that is restricted by your admin. I recently found out from a colleague that my company’s IT people purposely restricted our access to check email outside of work for security reasons. It isn’t a software bug but was done by design. Prior to this change the app seemed to function normally. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch"
  ],
  "size": "220.8 MB",
  "category": "Productivity",
  "ageRating": "4+",
  "languages": "English, Arabic, Basque, Bulgarian, Catalan, Croatian, Czech, Danish, Dutch, Estonian, Finnish, French, Galician, German, Greek, Hebrew, Hindi, Hungarian, Indonesian, Italian, Japanese, Kazakh, Korean, Latvian, Lithuanian, Malay, Norwegian Bokmål, Polish, Portuguese, Romanian, Russian, Serbian, Simplified Chinese, Slovak, Slovenian, Spanish, Swedish, Thai, Traditional Chinese, Turkish, Ukrainian, Vietnamese"
}