{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "MyBSWHealth 12+",
  "subtitle": "",
  "seller": "Baylor Scott and White Holdings",
  "stars": "4.8",
  "rating": "168.1K Ratings",
  "price": "Free",
  "appDescription": "Baylor Scott & White’s MyBSWHealth app gives you the ability to manage all of your healthcare needs in one place. Within the app, you can: • Find doctors and locations in your network and schedule appointments with ease • Securely communicate with your care team • View lab results and past visit summaries • Review and pay bills • Complete a telehealth visit and get a diagnosis and prescription on your smart phone without leaving home • View deductible, out of pocket max, and claims information if you are a member of the Scott and White Health Plan • Transfer or refill prescriptions at BSW pharmacies • Upload health and fitness data, including data from the “Apple Health app”, when enrolled in self-tracking programs • Manage your family’s healthcare needs from a single place The MyBSWHealth app is just one way that Baylor Scott & White is making healthcare the way it should be. more",
  "reviews": [
    {
      "user": "Melreid1971",
      "date": "03/31/2018",
      "title": "Little information\n\n    Developer Response",
      "review": "As another patient said before this USED to be a great app. My husband and mother could go on and look at labs, visit notes, etc. it’s ridiculous. I have been diagnosed in October of 2017 with a new illness. I’m seeing multiple providers for this issue. I required about 10-12 vials of blood to be drawn. I have a port because my veins are useless. So 2 of my other specialists sent lab requests over to Texas Oncology because they drew from my port. These were extremely important tests. It’s been over a month and not only have the labs not posted but there was no mention of my low iron that I have treatments for. In addition my physician got a little agitated saying that having all those tests run there was not going to work. He said he doesn’t read those labs and since it’s under his name he could be liable. Well, ok they are the ones who suggested this because it’s nearly impossible to draw from my veins. So I’m kinda stuck. I’ve sent messages thru this ridiculous “portal” which was the one thing baylor had going for it and now it’s useless too. Lastly I have a patient portal thru Texas Oncology and it’s no better. I don’t know what happened but it’s a real shame and disappointment because you can never get info by calling dr or nurse. Standard is “ let me pull that up and I’ll call you back or I’ll send results to your email. You are forgotten before the phone hangs up! more We would like to learn more about this experience and put you in touch with a representative in our patient relations department to assist. If you’re interested in speaking to a representative, please provide us with more information via https://bit.ly/ContactUsBSWH. Thank you. more"
    },
    {
      "user": "Star Polisher",
      "date": "12/05/2023",
      "title": "Park Lane Endocrinology —Dr. Emilia Popa & Thao Nguyen, PA\n\n    Developer Response",
      "review": "WOW! How blessed am I having such an amazing, experienced medical team guiding my diabetes care plan for years. I am always greeted warmly from reception, to checking in with the nurse. It is often that I get to speak to both doctors, if only in passing, not just the one I have an appointment with. I have been coming here for two decades. Here I’ve been guided in best practices for managing my type 2 diabetes—from nutrition to a progression of medication that helped me manage my diabetes and maintain blood sugar control. As new medicines have become available on the market, these informed doctors converse with me about them and possible logical next steps, such as the Ozempic semiglutide I began in June of 2022, and I’m now taking with great results. I’ve seen success personally in maintaining my overall health and well being after having diabetes for 27 years. Thank you Baylor for finding such exceptional doctors to be part of your system and making the conditions right for retaining them on your team. Kind regards, Dr. Lynda Carter more Thanks for sharing so much love, Dr. Lynda Carter! We're so happy to hear how pleased you are with the care you received at Baylor Scott & White Park Lane Endocrinology. more"
    },
    {
      "user": "Robnation101",
      "date": "01/25/2024",
      "title": "App Needs Some Improvements\n\n    Developer Response",
      "review": "I access this app to view documents, appointments, test results and communicate with drs offices for my 77yo father. I’m able to navigate things myself but it’s not very user friendly for older patients. This should be streamlined in a way that makes it much easier for older patients to navigate and access their information. For example accessing test results takes extra clicks to links within messages to access when they could be simplified by clicking on “test results” and viewing a list of results by date with a comprehensive naming for the result so that I know what type of test it was before opening them. Instead I have to click “test results” and then click a link in a message to view them not knowing what results I’m viewing until they open. Also, I would suggest adding a feature for archiving messages in bulk or at least having an option to slide left or right to mark messages as “read”. There are multiple other improvements like these that could improve the user experience for this app and more importantly make this easier to navigate for elder patients. Overall I’m able to get the information I need for my dad and give it 4 stars. However, I doubt that the elder community currently utilizes this much due to the difficulty they likely have with navigation and overall user experience. more Hi Robnation101, user experience is very important to us, and we appreciate you taking the time to share your feedback. We have shared your review with our development team for further review. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch",
    "Apple Vision"
  ],
  "size": "142.8 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information\n                Infrequent/Mild Alcohol, Tobacco, or Drug Use or References",
  "languages": "English, Spanish"
}