{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "MoleScope™ 12+",
  "subtitle": "Track and monitor your moles",
  "seller": "MetaOptima Technology Inc.",
  "stars": "3.9",
  "rating": "18 Ratings",
  "price": "Free",
  "appDescription": "MoleScope™ - Skin Screening in the Palm of Your Hand MoleScope by MetaOptima is designed to bring you peace of mind by helping you track and monitor your moles and spots over time, MoleScope allows you to manage your skin check and connect with a specialist* from the comfort of your own home. Features: ● 3D Body Map ● Full-body Imaging (Total Body Photography) ● Mole (Spot) Tracking ● Image Archiving ● Educational Image Analysis (ABCD of Melanoma) ● Calendar Reminders ● Compatible with the MoleScope Dermoscopy Device ● Secure Cloud Storage ● Tele-consult with Expert Physicians** Regular skin screening is essential in the early detection and prevention of skin cancer. MoleScope is designed to make skin screening simple by helping you monitor your moles and track changes over time. 70% of skin cancers are first spotted by patients, not doctors. With MoleScope, you and your doctor can spot suspicious moles sooner and ensure your moles are receiving the medical attention they need. Common concerns include: Moles, changing spots, melanomas, BCCs, SCCs, ... Acne Age spots Vascular lesions Eczema Send your spot images to a skin cancer specialist and get peace of mind. The MoleScope app is designed for use with the MoleScope mobile dermoscopy device, available for order at https://molescope.com. The MoleScope device provides high-quality imaging of your spots using magnification and specialized lighting. Download MoleScope and start scanning your spots today.*** *All of specialists are board-certified. **check if this feature is available in your region ***Full features unlocked with MoleScope device https://molescope.com more",
  "reviews": [
    {
      "user": "BetzuRo",
      "date": "12/20/2017",
      "title": "Easy to use and pretty thorough\n\n    Developer Response",
      "review": "The app is easy to use and has all the features you really need. One version was buggy and would just not start up properly, but they fixed it. It would be nice to display the date the picture was taken when comparing pictures side by side. Sometimes it is hard to tell which one is the latest. more Thanks for taking the time to write a constructive review. We're happy to let you know that the latest version (2.19.1) includes the dates when comparing dermoscopic images. Please provide us any other feedback at support@metaoptima.com. -The MetaOptima Team more"
    },
    {
      "user": "Nikkismiles66",
      "date": "07/24/2024",
      "title": "Peace of mind",
      "review": "Great app!! Only suggestion would be to add the option to “star” or “favorite” a mole. When you have a lot of them it’s difficult to remember which ones you want to bring to your dermatologists attention. So just the option to mark a spot that maybe adds it to a separate folder so it’s easier to find so you can show your doctor instead of looking through them all. Otherwise a super useful and well thought out app. more"
    },
    {
      "user": "sierra245",
      "date": "07/28/2018",
      "title": "Very useful app with the MoleScope device\n\n    Developer Response",
      "review": "I love this app and using it with the MoleScope device is easy. Just open the app, add a mole by placing its location on the body template, take an overview photo of the mole, add the MoleScope attachment to your phone and then take the microscopic photo. The photos are all kept with the mole you placed and you can add more photos and notes. It keeps everything very organized and easy to check on mole changes. Very easy and useful!! more Thank you for such a thoughtful review! We're happy to hear that you're making full use of the MoleScope line. -The MetaOptima Team more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch",
    "Apple Vision"
  ],
  "size": "147.6 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English, French, German, Italian, Portuguese, Spanish"
}