{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Heart Analyzer: Pulse Tracker 4+",
  "subtitle": "Watch Health & Fitness Metrics",
  "seller": "Helix Apps LTD",
  "stars": "4.7",
  "rating": "18.8K Ratings",
  "price": "Free",
  "appDescription": "Heart Analyzer offers users the ultimate insight into their Health data. Utilising the rich data recorded by Apple Watch, Heart Analyzer gives you a powerful understanding of your heart vitals. ------------------------------------------------ ■ Simple PRIVACY ------------------------------------------------ ◎ No third party analytics ◎ No data ever leaves your device ◎ No modifications to your health data ------------------------------------------------ ■ FEATURES ------------------------------------------------ ◎ The Dashboard - Where you can swipe between days, scroll through summaries and tap into the details ◎ Charts - Heart Rate and other Health data visualized through metrics and trends of any given day ◎ Insights - Effortlessly assess your Health Vital trends ◎ Analytics Plus - Gain a unique understanding of important metrics such as Cardio Recovery, Heart Rate Zones and plenty more ◎ Heart Reports - Generate and export tailored PDFs including a large selection of metrics with custom timescales and password protection support ◎ Widgets - Interact with your Home Screen and track your Heart Rate, Resting Heart Rate trends and more at a glance ◎ ECGs - Compare and analyze data recorded by Apple Watch ◎ Advanced features - Including HRV rMSSD, Heart Rate Calibration, Custom Heart Rate Zones, Smart Heart Rate Recovery and more ------------------------------------------------ ■ APPLE WATCH ------------------------------------------------ ◎ A re-designed app showing your Heart Rate over the day ◎ Charts with you on the go for Move, Exercise, Cardio Points, HRV, Blood Oxygen Saturation and Resting Heart Rate ◎ Workouts right on your wrist, tap into the detail as soon as you finish your exercise ◎ Customizable complications to keep you up to date with your Heart Rate and also support for Blood Oxygen Saturation, Heart Rate Variability and Resting Heart Rate trends HEALTH SUPPORT INCLUDES: • Heart Rate • Resting Heart Rate • Blood Pressure (Systolic & Diastolic) • Electrocardiogram (ECG/EKG) • Blood Oxygen Saturation (SPO2) • Cardio Fitness (VO2Max) • Heart Rate Variability (SDNN & rMSSD) • Respiratory Rate • Breathing Disturbances • Workouts • Sleep Times • Heart Rate Recovery • Apple Fitness & Activity • Heart Alert Notifications Heart Analyzer has three Premium purchases or combine them all with the Complete Premium purchase. Heart Analyzer does not contain any subscriptions! Please Note: • Heart Analyzer integrates with the Apple Health App to read your Heart Rate and other Health data • Heart Analyzer is available on iPad with iCloud sync for Apple Health data enabled. However, you still need an iPhone with a paired Apple Watch to generate Health data to display in Heart Analyzer • To get the most out of Heart Analyzer, and iPhone with a paired Apple Watch is required more",
  "reviews": [
    {
      "user": "tsjlh369",
      "date": "04/20/2023",
      "title": "Took me by Surprise",
      "review": "I don’t normally write reviews but this app really took me by surprise and I think it could provide so many more people with great insight! This app provides so much information, it truly goes above and beyond! First of all, it gives you a good portion of the information for free and they don’t push the premium subscription either which is nice!!! While the premium version is nice the free version is very insightful and would work well for anyone who wants to know more about what there apple watch is tracking and how that data looks for your health. One of the best parts about this app is that if you do want to upgrade to the premium subscription you can choose which parts you want and only buy those, choose one of the package plans or buy the complete version which is a ONE TIME FEE!!! No monthly subscription!! Not to mention very budget and broke college student friendly as far as price :) It’s also surprisingly motivating when you really look at the details because it tracks your movement and then it tells you how many times you’ve worked out each month. It makes me want to bring that number up so my reports look better. more"
    },
    {
      "user": "jaywog",
      "date": "06/11/2024",
      "title": "*update not good sign) Great free app with one time upgrade",
      "review": "I am so sick and tired of apps with never ending subscriptions, I have no problem paying for an quality app to own it. This apps free version is great already not completely stunted or loaded with ads it just works. And the paid upgrades are available separately or as a bundle more developers need to start doing this again. The upgrades ad more detail and longer records and more. I am buying the bundle to support this developer for doing this the not greedy way of subscriptions. ****update**** A whole 3 minutes later trying to support the developer I went to look at their other apps and the only other app, yeah it requires a subscription almost everything locked behind subscription. That’s their right but I have seen many times a paid app gets abandoned for a new subscription version. This leaves the paid version without updates or worse dead and the subscription app seems very similar to this one. Would love a response on what the plan is for this app before I buy. more"
    },
    {
      "user": "Appledid",
      "date": "03/09/2024",
      "title": "Much, much better than expected",
      "review": "I just needed an app that would show me my heart rate over the course of a day. This app does that and much more. For example, it averages daily heart rate over the course of a year. I got lazy over the enforced COVID stay at home period and quit exercising. A few months ago, I resumed exercising. The retrospective annual graph shows an increased heart rate during the period I slacked off and fortunately, a corresponding decline beginning when I resumed exercising. The feedback has motivated me to keep exercising. That alone is worth the purchase. The developer has an excellent User Interface sense. Want better detail on a part of a graph? Just pinch and zoom and you have it. You might think “Pfff! Pinch and zoom is not new!” You would be right but their are too many apps that don’t implement it when they should. This one does. The care that it took to implement that small detail permeates the app. Lots more but i hate writing on my phone. Just buy it. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Apple Watch"
  ],
  "size": "34 MB",
  "category": "Health & Fitness",
  "ageRating": "4+",
  "languages": "English, German, Simplified Chinese"
}