{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Sideline Guidelines 17+",
  "subtitle": "",
  "seller": "The Cleveland Clinic Foundation",
  "stars": "5.0",
  "rating": "4 Ratings",
  "price": "Free",
  "appDescription": "The Sideline Guidelines App is an educational tool intended for medical providers on the sidelines treating athletic injuries for high school, college, and professional athletes. A national faculty has compiled a summary of expert knowledge to help diagnose athletic injuries (history, physical examination, and imaging), determine the ability of athletes to play their sport, recommend treatment in the training room and beyond, and estimate return to play time. This information is presented in a highly structured and searchable format that allows quick access to key points to consider when making an informed medical decision. The knowledge in this App is meant to serve as a guideline, especially since this field is still largely an \"ART\": it is more expert opinion than high-level evidence-based studies. As an \"ART\" there are few absolutes, particularly regarding return to play, so one must weigh the risk-benefit for the athlete at a given level of competition with medical providers. This App is meant to serve as a helpful guide and reference to aid the medical provider into an individualized discussion of the risks and benefits of treatment and returning to the field in game time and in the training room. The information in this educational App is provided for general medical education purposes only and is not meant to substitute for the independent medical judgment of a physician relative to the diagnostic and treatment options of a specific patient's medical condition. In no event will The Cleveland Clinic Foundation be liable for any decision made or action taken in reliance upon the information provided in this App. Compatible with iPhone and iPad. more",
  "reviews": [
    {
      "user": "BgDaddy98",
      "date": "07/12/2016",
      "title": "Great upgrades!",
      "review": "Many new upgrades. Images and photos now available. Reference lists with current evidence based literature. The first version was great. The new version knocks it out the park! Great, comprehensive resource for anyone caring for athletes. more"
    },
    {
      "user": "JR74",
      "date": "03/06/2016",
      "title": "Excellent",
      "review": "Easy access and answers to all sideline questions for any provider who takes care of athletes. Well done!"
    },
    {
      "user": "KLSMD1",
      "date": "03/06/2016",
      "title": "Awesome App!",
      "review": "Great resource for anyone that covers a sporting event. Easy to navigate and all encompassing. Thanks again to the CCF for creating it!"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "82.5 MB",
  "category": "Health & Fitness",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English"
}