{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Melanoma Test - risk calculator of skin cancer 12+",
  "subtitle": "",
  "seller": "Pears Health Cyber",
  "stars": "",
  "price": "Free",
  "appDescription": "The Melanoma Test is a complex and precise risk calculator for developing skin cancer. Using a combination of multiple test algorithms, we developed the test, which consider a wide range of factors and is able to recognize smaller nuances than any other risk calculator. After completing a brief questionnaire with pictures, you would learn whether you have any suspicious pigment mark on your skin or whether there is a potential risk of melanoma. This user-friendly application excels in its simplicity of use and is a great aid in preventing this disease. About 30-50 % of melanomas develop from a pigment mark. Melanoma is a malignant tumour of melanocytes which mostly develops on the skin. It is one of the less frequent types of skin cancer, but causes the highest number of deaths from these tumour diseases. In most cases, the health symptoms are initial transformation of a static pigment mark, the early removal of which often prevents development of a malignant tumour. Get a test of your risk of developing melanoma thanks to this mobile application, since prevention is one of the most effective weapons against this disease. There is nothing simpler than to get examined by a dermatologist in case of any suspicion, rule out the risk of cancer, and be sure you are healthy. Take advantage of modern trends in medicine and test yourself. The Melanoma Test application offers the following: ● Melanoma development risk test ● Disease information ● Option to send test results via e-mail ● Next test date reminder ● Tips and tricks to reduce the risk of the disease ● Sharing option more",
  "reviews": [],
  "compatibility": [
    "iPhone",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "30.6 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English, Czech, French, German, Portuguese, Spanish"
}