{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Dexcom Clarity 4+",
  "subtitle": "",
  "seller": "Dexcom",
  "stars": "4.6",
  "rating": "9.9K Ratings",
  "price": "Free",
  "appDescription": "Dexcom Clarity is a diabetes management application for CGM users. It provides relevant insights into users’ retrospective glucose values, patterns, and trends over time. Dexcom Clarity is an important part of your Dexcom CGM system. It can help you identify glucose patterns and, with your healthcare professional, determine the potential causes of those patterns. Dexcom Clarity users experience up to 15% increased time in range (70-180mg/dL) as compared to non-users.* Log in with your Dexcom account to: • Keep tabs on your time in range, patterns and other key metrics. • Allow clinics to access to your data and reports to make appointments more efficient. • Set Time in Range goals. • Turn on daily or weekly notifications and emails. • View, save, print, and email all reports. • Connect to partner apps for more features and benefits. This app store should not be used as your first point of contact to resolve technical or customer services issues. In order to protect your privacy and personal information, and promptly resolve any technical or customer services issues you are having with any Dexcom product, please contact 1-888-738-3646. Dexcom is required to follow up with customers regarding product-related complaints. If Dexcom determines that your comment/complaint requires follow up, a technical support representative will attempt to contact you to gather more information regarding your comment/complaint. *Parker AS, Welsh J, Jimenez A, Walker T. Insights from big data (2): Benefits of self-guided retrospective review of continuous glucose monitoring reports. Diabetes Technol Ther. 2018;20(S1):A-27. more",
  "reviews": [
    {
      "user": "Piece of piss",
      "date": "09/14/2022",
      "title": "Connection with Dexcom & other essential apps\n\n    Developer Response",
      "review": "For people monitoring blood sugar levels wearing the Dexcom CGM system, Clarity is a companion verification of where you are each day with your overall BG's. One fantastic use I have found is that by looking at the reading around dinnertime (6:00pm) allows me to make adjustments of carbs to eat the rest of the day to make sure I am at or over the 70% goal. Depending on what the prior carbs, correct amount of insulin, exercise, etc., I can meet that goal most if the time- no cookies tonight and mostly veggies and small portion of meat! It doesn't always work, , but I'm in competition with myself for better results. I've got a line of 4 diabetes apps on my I-phone: left to right: Figwee (food and amount) carb monitor, One Touch (description of food and amount tracker), then Dexcom and Clarity. I live using all of them all day, every day. My A1c is 6.6. Thanks. more Thank you! We appreciate your review. To learn more and browse our FAQ’s, please visit our help center at: https://www.dexcom.com/faqs. more"
    },
    {
      "user": "And Entry",
      "date": "04/19/2023",
      "title": "Less data available in recent update\n\n    Developer Response",
      "review": "I used to really love to review the AGP report from the Clarity app because it had detailed information regarding time in each blood glucose range. A recent update simplified the time in range information to be basically the same information on the summary. I used to see the actual percentage of time in each blood glucose range to the tenth decimal. Each .1 of a percent is 1.5 minutes! Now the AGP report removes the less than one decimal information. For example the old report would say 0.2% below 55 mg/dl now it would just show <1 for the same data. Why can’t I have more detailed information on the AGP report anymore? I love the app but liked it better when it had more of my data available to me. Hopefully this can be brought back. I already completed a support ticket right when the update came out thinking maybe the data just got moved. I learned then that the data I was looking for was removed not just moved. The change was a choice made by the developer. Per the suggestion below I put in another service request. I also removed a star because I doubt doing the same thing I did before will change anything. more Thank you. We appreciate your review. We will pass your feedback along to our Product team for consideration in future updates. If you would like a member of our team to reach out, please submit a request through our Self-Service Patient Support Portal located at https://www.dexcom.com/priority-support more"
    },
    {
      "user": "eric.grinnell",
      "date": "08/26/2023",
      "title": "A very useful tool\n\n    Developer Response",
      "review": "If you are diabetic, you need a continuous blood glucose monitoring system. I’d have a continuous blood glucose monitoring system, it should be a Dexcom g7, as it is the best on the market. If you use the Dexcom continuous blood glucose monitoring system, you must use the clarity app to collect meaningful trend data about your sugar history. It can change you life. T has changed mine. I wish I’d started using it four or five years sooner, as doing so would have prevented a heart attack — and maybe I’d still have ten toes. My a1c has gone from 13 to 6.2. I give all the credit to proper use for g ozempic, Dexcom, and the clarity app. Take care of yourself. Stay healthy. Don’t die. Someone in this world loves and needs you, I promise. more Thank you! We appreciate your review. To learn more and browse our FAQ’s, please visit our help center at: https://www.dexcom.com/faqs. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch"
  ],
  "size": "19.6 MB",
  "category": "Medical",
  "ageRating": "4+",
  "languages": "English, Arabic, Bulgarian, Croatian, Czech, Danish, Dutch, Estonian, Finnish, French, German, Greek, Hebrew, Hungarian, Italian, Japanese, Korean, Latvian, Lithuanian, Norwegian Bokmål, Polish, Portuguese, Romanian, Slovak, Slovenian, Spanish, Swedish, Turkish"
}