{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Flo Period & Pregnancy Tracker 12+",
  "subtitle": "Cycle and Ovulation Calendar",
  "seller": "FLO HEALTH UK LIMITED",
  "stars": "4.8",
  "rating": "1.4M Ratings",
  "price": "Free",
  "appDescription": "Flo is the #1 female health app co-created with over 100 leading health and medical experts. Whether you want to understand your cycles better, are trying for a baby, or are already pregnant, join over 380 million people worldwide using Flo as their ovulation and period tracker, cycle diary, and pregnancy assistant. FLO FOR PARTNERS Finding the words (or the time) to explain what you're going through can be challenging. We launched Flo for Partners to educate your partner about what's happening with your body. When they accept your invitation to join using your unique code, they'll be able to do things like: - Understand your cycle better. - See pregnancy updates if you're expecting. - Get the support you want right when you need it. Facts about Flo: - Flo is the first-ever period and ovulation tracker to achieve ISO 27001 (the internationally recognized standard for information security). - 100+ doctors and health experts review all our content. - We're a Partner of the United Nations Population Fund in reproductive health. CYCLE & PERIOD TRACKER During each cycle phase, Flo gives you personalized insights into changes in your mood and energy levels. Choose from and log over 70 symptoms and activities to receive the most accurate predictions and tips. OVULATION TRACKER & PREGNANCY CALENDAR Learn about your best days to get pregnant and receive tailored insights to help you on your journey to pregnancy. If you're pregnant, our app allows you to track your baby's growth, calculate your due date, set a countdown, and even learn the essentials of newborn care. HEALTH REPORT & ASSISTANT Our virtual Health Assistant provides digestible information based on your logged symptoms. We also produce a monthly health report with personalized cycle graphs and patterns. ANONYMOUS MODE Enjoy personalized insights and accurate predictions with the option of even more privacy. In this mode, Flo only handles health data — like cycles and symptoms — to an account that contains no information that can identify you such as your email or name. Subscription Information - Flo offers a subscription plan that provides a more personalized experience and unlimited access to the entire health and well-being multimedia content library. - We will charge your Apple ID at confirmation of purchase. - Your subscription will automatically renew unless you turn auto-renew off at least 24 hours before the end of the current period. - We will charge your account for renewal within 24 hours before the end of the current period. - The user may manage subscriptions, and auto-renewal may be turned off by going to the user's Account Settings after purchase. - If a free trial period is in place, any unused portion will be forfeited when the user purchases a subscription to that publication, where applicable. For more information, please visit https://support.apple.com/en-us/HT202039. Privacy Policy: https://flo.health/privacy-policy Terms of Use: https://flo.health/terms-of-use Accessibility Statement: https://flo.health/accessibility-statement-ios Flo uses HealthKit to export your Flo activities to the Health app and to read menstrual cycle data. Flo is not a diagnostic tool, and Flo's predictions should not be used as contraception or to facilitate conception. The Flo App is not a substitute for professional medical advice, diagnosis, or treatment. more",
  "reviews": [
    {
      "user": "mallalalalalalalalala",
      "date": "07/23/2021",
      "title": "Not a fan of new format\n\n    Developer Response",
      "review": "I used to love flo. I’ve been using the app since my junior year of high school (I’m now a senior in college). I appreciate how I’ve been able to track my period through the years, as it’s been enormously helpful to my overall health, well-being, and awareness of my body. That being said, I have really struggled with the new updates that flo has undergone. Not only has the app become significantly less user-friendly, but the constant push to “go premium” has really negatively impacted my experience. I understand why they have a premium option, and I respect that it is there, but what I don’t respect is how I’m constantly being mislead in order to be trapped into signing up for a premium subscription. I find it really irresponsible that women who don’t want to pay for this app, will be given insights about their menstrual health, only to find out that they can’t have access to the information behave they don’t have an account! I used the chat feature a few times before, and it’ll leave me responding to chats for about 5 minutes, and right before they give me an answer about my health, they say I need to subscribe! It’s honestly cruel that an app meant to help women feel more secure about their health, is constantly misleading them like this, or trying to buy their desire for basic health info! Most of which can be googled, btw. I’ve really loved using flo, but am honestly considering shifting gears if things don’t change soon. more Hi mallalalalalalalalala, Thank you for sharing this. We’re sorry to hear you’re disappointed that we moved some features out of the free plan. Premium subscriptions fund the ongoing development of the app, while keeping the basics free for everyone. We welcome your feedback. Please email us at support@flo.health. Kind Regards, Flo Support Team more"
    },
    {
      "user": "genuine_feedback!",
      "date": "09/15/2024",
      "title": "Deleting the App\n\n    Developer Response",
      "review": "Gave a 5 star so this will be seen. I have been using this app for well over 5 years, it used to be so great and user friendly. And I really appreciated being able to track my cycle and have insight as to what I was going through, all the way up to when I got pregnant early last year with my daughter. & then the app didn’t really have much to offer compared to other apps as far as tracking my pregnancy. I redownloaded the app once I started having periods again postpartum and every so many minutes within using the app, it prompts me to purchase the full subscription to be able to use even basic features that used to be available to everyone without purchase. In addition, when it prompts you to make a purchase, it literally forces you to agree and continue into the purchase by not allowing an exit button or anything to back out of the ad until you’re having to deny the purchase when it tries to ask for a payment method. It’s ridiculous that they are so money hungry that they now feel the need to try to force you into a purchase. It will also offer insight on your cycle but then pop up with an ad that you need to make a purchase to even see the insight. Other than being able to enter when you have your period and look back on the calendar, it is now a pointless app, I can literally use the calendar on my phone to do the same thing. more Hi there! We’re sorry if you found our promotion of Flo Premium a bit pushy! We’ve been working hard to develop our product so that it’s helpful on your journey to becoming healthier every day. While we would be pleased to have you try Flo Premium, we value all of our users, whether they subscribe or decide to use the free version. We’re very sorry for your experience. Could you please contact us at support@flo.health and let us know what you would like to change? Our team will be happy to assist you! Kind Regards, Flo Team more"
    },
    {
      "user": "Jess brownie",
      "date": "06/02/2023",
      "title": "Good, but bugs\n\n    Developer Response",
      "review": "I really like this app! It helped me track my cycles and ovulation when I was trying to get pregnant, and then was super easy to swap over when I was finally pregnant! And the pregnancy side of things have been so good!!! I love opening it every day to find my new tips and advice for the day. It also helps me track my water, which I love. But, the new updates it has gone through have been sort of weird. It always prompts me to input my weight to track it, but that feature is gone! There is nowhere for me to input my weight anymore. Also, the chat feature is gone! I liked the “chat” at the beginning of every week even though you can only respond with pre written responses, it was very informative and useful. One week of pregnancy was incorrect (said I was week 8 even though I moved on to week 9) and it didn’t work because it knew something was wrong, and now I haven’t seen it since. Lastly, I loved all the of “stories” that it gave me during first trimester. A week to talk about exercise, a week for nutrition, a week for working while pregnant, etc. but as soon as second trimester hit, there’s nothing! I really looked forward to reading it everyday, but now there’s just a lack of information. I begin to wonder what I’m getting by paying “premium” because it sort of stopped all of the major things it was helping me with. But I loved it, so I’m mostly writing this review to let the creators know what they need to fix and bring back!! more Hi Jess brownie! We’re very sorry to hear that! We really want to help you, but we need to know your identifier in the app to find the reason for the issue and provide a solution. Please contact us from the app (Menu - Help - Contact us), and we’ll get back to you with more details on your request. Kind regards, Flo Team more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch",
    "Apple Watch",
    "Apple Vision"
  ],
  "size": "265.4 MB",
  "category": "Health & Fitness",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English, Danish, Finnish, French, German, Indonesian, Italian, Japanese, Korean, Norwegian Bokmål, Polish, Portuguese, Russian, Simplified Chinese, Spanish, Swedish, Thai, Traditional Chinese, Turkish, Ukrainian, Vietnamese"
}