{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "MDacne - Custom Acne Treatment 12+",
  "subtitle": "Acne Treatment Crafted For You",
  "seller": "MDalgorithms Inc.",
  "stars": "4.6",
  "rating": "18.3K Ratings",
  "price": "Free",
  "appDescription": "Ready for clear skin? MDacne is the future of acne treatment. In less than 5 minutes you'll get a complete acne treatment kit personalized based on your unique skin! Let’s face it, unique people need unique products. Get all the products you need to clear your skin. Why is MDacne better: • Customized to Your Skin - MDacne is the world's first customized acne treatment kit. In order to get rid of acne, you need treatment that is personalized to your unique skin condition. • Ingredients That Really Work - Dermatologist formulated MDacne products use high potency medical grade ingredients + natural ingredients tailored to fit your skin’s needs. • Everything You Need in One Box - You'll receive a generous supply of your customized cleanser, customized anti-acne treatment cream, and acne-prone skin hydrating moisturizer. • Unlimited Formulation Fine Tuning - We'll fine-tune your formulation throughout your treatment to make sure it fits your skin perfectly. • Technology That Gets Your Skin - Use the MDacne app’s advanced tech to monitor your skin’s improvement 24/7! Set treatment reminders, chat with a Dermatologist and get recommendations that actually work. How does it all work? 1. Take a selfie 2. The app will assess your skin immediately 3. Acne treatment crafted just for you is sent to your doorstep Get your first customized acne treatment kit for free! New customers receive a 1-month supply of all 3 customized treatment products for free, just pay for shipping and handling. Once the trial completes, the account will automatically transition to a monthly or quarterly subscription plan unless canceled during the trial. Cancel your membership anytime. Got questions? We are always at your service contact us at feedback@MDacne.com Terms of Service: https://www.MDacne.com/terms Privacy Policy: https://www.MDacne.com/privacy more",
  "reviews": [
    {
      "user": "Morgiana_00",
      "date": "05/23/2024",
      "title": "Great cooling sensation",
      "review": "When I first tried this product I thought that the cooling moisturizer was a good topper for skincare. Although my acne did reduce, I think I’d prefer products I can use on the daily, your $9 trial is a really good way for people to test your products and see if they’d want to continue using it on the long-term. Needless to say, the acne treatment cream is great and is good for me to use. Sometimes the products are a little tingly though which is fine, however I am on a time cramp in the morning and I like using daily products for sensitive skin, I have products that are not done yet so I will have to use those before trying more MDacne products. You are a great brand with good researchers. It is a little pricy for me to pay the $24 a month thing, but if you’re an adult working and have acne products I think it’s safe to try MDacne continuously and reduce products from different brands as to lower your sensitivity, they say continuity is key and that’s true for skincare, since this brand focuses on acne I hope more people become more confident with your products(acne can make people lose esteem but it’s okay, acne is natural and there’s always a remedy, don’t feel like hope is lost I just know that if your face isn’t super sensitive to customized skincare than that means you can overcome acne within a month to one year) more"
    },
    {
      "user": "tanyshaaax",
      "date": "05/20/2019",
      "title": "Awesome product.\n\n    Developer Response",
      "review": "I’ve been using McAcne for 10 months now. Though at one point my skin started drying up real bad as we were bout to hit winter season. I messaged Dr. Harth about my concerns in hopes he could help me with it. He responded quickly and gave me some advice and a night cream to use every other night aside from my daily routine. If I’m being honest, I stopped using my day cream. I use my day/night wash and my night cream (before bed). I wake up, wash my face with cool water and use a moisturizer by neutrogena (clear face SPF30) break-out free liquid lotion sunscreen through out the day. Also great before foundation (if ever you decide to wear makeup). I’m not saying to stop using your day cream. Everyone’s skin is not the same, just like their skin care products. Whatever works for you, great! Don’t hesitate to message the Doctors if you can’t seem to find the right routine for you! Thank you McAcne! I’ve never felt so confident about my facial skin since middle school! I appreciate all the help I’ve received and I’m definitely gonna continue using your products! THANK YOU! 😁✊🏼 more This is music to our ears! Great suggestion to other folks to use the dermatologist chat support during treatment! This enables us to tweak your routine or products as needed to ensure you get the best results. So excited for you and your renewed confidence! more"
    },
    {
      "user": "crecky15",
      "date": "01/27/2023",
      "title": "MDacne is a great product!",
      "review": "Though I’ve been using this skin care treatment since the start of summer I’ve learned it takes time. Right in the beginning of using their products my skin started to get dry and worse but as time went on there has been a lot of improvement. Throughout 7 months I’ve been using it I’ve had times when my skin was at its best but then right after I thought everything was getting better. I got more and more breakouts. I’ve seen a big improvement in my skin from when I first started. Everyone’s skin is different but the process takes time and it’s definitely worth it. I still do have acne now and acne scars but it’s way better than before. The staff are great and help me with all my questions I have about my skin or about other products on the app. Although I’m still unhappy with how my face looks I still gotta wait until it gets better. The products really do help and work but IT TAKES TIME. So don’t be all mad when your skin doesn’t clear up in the first month because it’s not how it’s works. This product has helped me a lot and can’t wait until my skin is all cleared!! more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "407.2 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English"
}