{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "TeachMe Anatomy: 3D Human Body 12+",
  "subtitle": "Immersive 3D Anatomy Learning",
  "seller": "TeachMeSeries Limited",
  "stars": "4.8",
  "rating": "2.2K Ratings",
  "price": "Free",
  "appDescription": "Make learning anatomy more efficient and enjoyable with the best-selling 3D anatomy platform and question bank. Download for FREE today. Teach Me Anatomy provides students, doctors, and health professionals with the world’s most comprehensive anatomy learning platform. Includes integrated textbook, 3D anatomy models and a bank of over 1700 quiz questions – download to get started today! ABOUT TEACH ME ANATOMY: Teach Me Anatomy is a comprehensive, easy to read anatomy reference. Each topic combines anatomical knowledge with high-yield medical and clinical insights, seamlessly bridging the gap between scholarly learning and improved patient care. Based on the award-winning website, Teach Me Anatomy is a great teaching and learning tool for students, educators, healthcare professionals and patients – or simply those with an interest in the human body! FEATURES: + CONCISE AND EASY-TO-READ ANATOMY ENCYCLOPAEDIA: Contains over 400 comprehensive articles covering every aspect of anatomy. + 3D ANATOMY MODELS: Bring the human body to life with immersive 3D models to accompany each article. + HD ILLUSTRATIONS: More than 1200 full colour, high definition anatomy illustrations and clinical images. + INTEGRATED CLINICAL KNOWLEDGE: Clinical relevance textboxes link the fundamentals of anatomy to medical practice. + QUESTION BANK: Over 1700 multiple choice questions with explanations to consolidate your anatomy knowledge. + OFFLINE STORE: Learn anytime, anywhere - all articles, illustrations and quiz questions are stored offline for instant access. + REGIONAL ANATOMY: Includes Head & Neck, Neuroanatomy, Upper Limb, Back, Lower Limb, Abdomen, and Pelvis. + SYSTEMIC ANATOMY: Includes the skeletal system, muscular system, nervous system, circulatory system, lymphatic system, digestive system, respiratory system, urinary system and reproductive system. PREMIUM MEMBERSHIP: Teach Me Anatomy offers premium membership via an in-app subscription. Premium membership grants cross-platform, advert-free access to bespoke 3D anatomy models and anatomy question bank. You can subscribe monthly, quarterly, or annually and pay through your iTunes account. Payment will be charged to your iTunes Account at confirmation of purchase. Your Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period. Your account will be charged for renewal within 24-hours prior to the end of the current period. You can manage your subscriptions and turn off auto-renewal by going to your iTunes Account Settings any time after purchase. Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable. The subscription will renew at the same cost. See our terms of service here: https://teachmeanatomy.info/terms-and-conditions/ more",
  "reviews": [
    {
      "user": "DJ.slamilac",
      "date": "06/19/2024",
      "title": "One to a Five\n\n    Developer Response",
      "review": "Downloaded this app because I’m starting up on A&P pursuing Radiography. Purchased the Bi Annual Subscription with the intent to use it as a study guide on the go. Went to explore the 3D models immediately after purchasing my subscription annnnnnnnd “Upgrade to Premium”… interesting…I was certainly charged the 50 some odd dollars to have access…. Just for me not to still not have access? Really was not anticipating requesting a refund 5 minutes after initial download. 0/5: Could’ve been something great. Edit: App Support reach back to the very next day and resolved my issue. The app is phenomenal and will be a staple to my study routine. The 3D model and breakdown is unmatched. more Dear DJ, Thank you for reaching out, and I'm sorry to hear that you're experiencing difficulties with viewing 3D models on our platform. To better assist you, could you kindly provide us with some additional information: Are there any specific models that this issue occurs with? Does this problem occur on the website, the app, or both? Is the issue consistent across all the models, or is it isolated to certain topics? Are you encountering any error messages, or do you see a blank screen when attempting to view the models? In the meantime, we recommend clearing your cookies and attempting to access the models again, as this may resolve the issue. If you have other feedback or suggestions, please write to us at oliver@teachmeseries.com. We would love to hear from you! more"
    },
    {
      "user": "Yonnie.Z",
      "date": "01/02/2024",
      "title": "Quiz Questions\n\n    Developer Response",
      "review": "Great app, provides easy to understand definitions with some visual pictures to better understand the terms. I am hesitant to purchase the full version because I do not know if one would get more than 3 questions per article? more Hi Yonnie, thank you for leaving a review and thank you for your feedback. We'd love to improve your experience, please reach out to us at support@teachmeseries.com to share your feedback and questions. more"
    },
    {
      "user": "meanest nerve",
      "date": "08/22/2018",
      "title": "You should get this app to study anatomy",
      "review": "The rating is 4.5. I am using this app to help me study for medical school. I love this app because it helps me learn in the way I learn best. The articles are detailed with clinical relevance sections. The app has many visual pictures that you can look at. At the end there is a quiz were you can test your knowledge. The cons is that there a few spelling errors but it does not interfere with comprehension. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "156 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": ""
}