{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Nimble Rx 12+",
  "subtitle": "The New Pharmacy Experience",
  "seller": "NimbleRx",
  "stars": "4.9",
  "rating": "32.2K Ratings",
  "price": "Free",
  "appDescription": "Stay organized and in control of your prescriptions with NimbleRx, the ultimate pharmacy companion. Whether you're looking for better prices on medications or you need a convenient way to manage your medications, arrange for prescription delivery, or schedule pickups, NimbleRx is the all-in-one solution for your prescription management needs. Key Features: 1. Prescription Management Made Easy: Say goodbye to the hassle of keeping track of multiple prescriptions and their refill dates. NimbleRx provides a user-friendly interface that allows you to effortlessly manage your medications all in one place. Never miss a dose again! 2. Prescription Delivery and Pickup: No more waiting in long pharmacy lines or worrying about running out of medications. NimbleRx offers a convenient prescription delivery service, ensuring that your medications are delivered right to your doorstep. Alternatively, you can schedule pickups at your preferred pharmacy for added flexibility. 3. Reminders and Alerts: Stay on top of your medication schedule with customizable reminders and alerts. NimbleRx will notify you when it's time to take your medications or when refills are due, making it easy to maintain your health and adhere to your prescribed treatment plan. 4. Secure and Confidential: Your privacy is our top priority. NimbleRx employs advanced security measures to protect your personal information and medication history. Rest assured that your data is encrypted and stored securely. 5. User-Friendly Interface: NimbleRx's intuitive design ensures a seamless user experience. Navigate through your prescriptions, track refills, and set up delivery or pickup options effortlessly. The app is designed to be accessible and easy to use for ages 12+. 6. The Best Prices: Search for the best prices for new or existing medications. Download NimbleRx today and experience the future of prescription management. Simplify your life and take control of your health with the power of technology. Say goodbye to medication mishaps and hello to peace of mind! Visit nimblerx.com to learn more. more",
  "reviews": [
    {
      "user": "mnmikaela",
      "date": "07/27/2024",
      "title": "Delivery address fields are bugged\n\n    Developer Response",
      "review": "I wanted to get my medication delivered and I live in an apartment complex; both the apartment/suite field and the \"additional delivery instructions\" field will not let my keyboard pop up. it doesn't work for me on both the checkout and the \"personal details\" section in the app; it also doesnt work in the checkout page on mobile safari or mobile google chrome. On the browsers, i also tried rotating my phone to landscape and the keyboard still doesn't appear. im on iOS 17.5.1. seems like a good app otherwise, i appreciate that i dont have to make an account with a password to use it more Hello, thank you for flagging this issue. We apologize for the inconvenience this has caused. Our team is currently investigating and working to resolve the issue as soon as possible. In the meantime, if you need further assistance, please reach out to support@nimblerx.com. more"
    },
    {
      "user": "Chan0100",
      "date": "10/02/2024",
      "title": "Really poor service and support\n\n    Developer Response",
      "review": "I used to get awesome service through Nimble but I’m having so many issues with them recently that I’m beginning to wonder if the company is winding down/going out of business entirely. The most recent issue I had with them was that my medication was sent via USPS despite having gone through the checkout process for a courier delivery, as I had with all of my previous orders. My medication needs to remain temperature controlled and wasn’t at all — it was delivered on a hot summer day several days later than the scheduled courier delivery date 😅. I’ve been trying to get in touch with them via email for a couple of days now to find out whether they stopped offering the temperature controlled courier service but seem to be entirely unable to reach them. When emailing the support address, I got an automated email that my question would be responded to within 48 hours. Then today I got an email reply that their inbox is “not monitored.” This seemed odd, especially because the app still appears to be collecting payment and scheduling deliveries (presumably through the mail now?). I’ve tried to reach them them through a few different email adddesses since there’s no phone number anywhere online or in the app. Not sure what’s going on with this app but it’s a shame because it was a great service! more Hello, we apologize for the inconvenience that you've experienced and we appreciate your feedback. We do recommend patients contact their pharmacy regarding courier related concerns as the pharmacy manages the prescription! We apologize for any issues with regards to contacting support. If you have additional concerns or feedback, you are welcome to contact us at feedback@nimblerx.com! Thank you kindly for your patience. more"
    },
    {
      "user": "Bblynn34",
      "date": "07/12/2024",
      "title": "Notifications are confusing or non existent\n\n    Developer Response",
      "review": "I’ve had three prescriptions sent to this pharmacy service. The only one that went through correctly or on time was the first one. I just got off a 30 minute chat with the web support team because my app shows “refill on schedule” for a medication that, according to the chat team, was never being processed by the pharmacy. I never received a notification or call that my medication wasn’t being processed and therefore wasn’t being “refilled on schedule.” Even now I cannot find anything on the website or the app showing that my medication actually isn’t being processed despite being available for refill now. I’m glad I realized it wasn’t being filled before I was completely out of my medication, too bad I only have one day left to find someone else to fill it. I will call my pharmacy tomorrow and get this sorted out, but it’s ridiculous and unsafe that I had to do this much digging to find that my medication wasn’t being filled. What if I was an elderly patient waiting on a more serious medication? They wouldn’t be able to navigate this confusing system to even realize they weren’t getting their medication before it was too late. more Hello, we apologize for the inconvenience that you are experiencing with your prescription order. We understand that this is a very frustrating experience. If you are still unable to resolve it with your pharmacy, please reach out to support@nimblerx.com again and we will help resolve your issue! more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Apple Vision"
  ],
  "size": "112.8 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English"
}