{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Geeky Medics - OSCE revision 12+",
  "subtitle": "Clinical skills on the move",
  "seller": "Geeky Medics LTD",
  "stars": "4.5",
  "rating": "61 Ratings",
  "price": "Free",
  "appDescription": "The Geeky Medics app is packed with features, including: - OSCE Guides (200+) to prepare for the UKMLA CPSA - OSCE Checklists (150+) to practice with others - OSCE Stations (1000+), including AI-powered virtual patients - Flashcards (2500+) and review cards you've created - Questions (5000+) including UKMLA AKT and PSA question banks Learn on the go with our comprehensive collection of high-quality OSCE guides that take you step-by-step through key clinical skills, including: - Clinical examination - Procedures - Communication skills (e.g. history taking) - Data interpretation (e.g. ECG, ABC, CXR, AXR, CTG) - Emergency scenarios (A-E approach) - Prescribing & documentation - Surgical skills (e.g. suturing) Put your skills to the test using our collection of OSCE station scenarios that make it easy to practice with others and run a mock OSCE. Practise your communication skills with our AI-powered virtual patients. Access over 5000 FREE MCQs and 2500 FREE flashcards covering clinical medicine, anatomy and basic sciences. Revise for the UKMLA AKT or the Prescribing Safety Assessment (PSA) exam using our dedicated question banks. Our OSCE guides cover everything you need for the UKMLA CPSA: • Cardiovascular • Respiratory • Gastrointestinal • Neurology • Musculoskeletal • Endocrine • Obstetrics & Gynaecology • Ear, Nose & Throat • Breast examination • Clinical procedures • History taking • Information giving • Advanced communication • Data interpretation • Emergency management (ABCDE approach) • Written skills • Surgery Unlocking all categories is an auto-renewable subscription. You will be charged on a yearly basis. SUBSCRIPTION DETAILS Payment will be charged to your iTunes Account at confirmation of purchase. Subscription automatically renews unless auto-renew is turned off at least 24 hours before the end of the current period. Your Account will be charged for renewal within 24 hours prior to the end of the current period and will identify the cost of the renewal. Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase. No cancellation of the current subscription is allowed during the active subscription period. Privacy Policy and Terms and Conditions: https://geekymedics.com/disclaimer/ more",
  "reviews": [
    {
      "user": "GJ. Alice L.",
      "date": "01/23/2019",
      "title": "Auscultation",
      "review": "Great app! Thanks for making the guides, I was wondering whether it will be possible for you to make a collection of normal and abnormal heart sounds, lung sounds, and bowel sounds heard at different places on the body (for example, how would systolic stenosis sound differently if heard at aortic, pulmonic, tricuspid, and mitral points) using diaphragm and bell of stethoscope? Thx! more"
    },
    {
      "user": "Doktor V",
      "date": "05/25/2019",
      "title": "It’s now better than ever!",
      "review": "The updated app is now sleek and very good looking. However, there is a problem with videos. They should stay on top while scrolling down the text content. It will be better watching the videos in the same time while reading the text. more"
    },
    {
      "user": "Ed7812738388t",
      "date": "02/16/2024",
      "title": "UK English",
      "review": "Imagine the marketablity of this, if it was in American English and terminology. Still very much a useful resource."
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "823.9 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English"
}