{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "OrthoFlow 12+",
  "subtitle": "",
  "seller": "MediFlow Ltd.",
  "stars": "4.9",
  "rating": "60 Ratings",
  "price": "$4.99",
  "appDescription": "Welcome to OrthoFlow...the orthopaedic specialist in your pocket! This new way of learning is designed to help you diagnose and manage orthopaedic trauma with simple, easy to understand decision ‘Flows’ that quickly guide you to the correct diagnosis and management plan. With hundreds of unique diagrams and illustrations accompanying evidence based, clinically relevant information, OrthoFlow provides the knowledge you need for trauma and orthopaedics. Sorted! But what happens if someone asks you questions about the injury?? Don’t worry, we’ve got that covered too... In the ‘Bare Bones’ section, common and relevant conditions and principles such as Compartment Syndrome, Open Fractures, Peripheral Nerves and Fixation Principles are covered so that you can hit the ground running. In the ‘Trauma Meeting’ section, we break down each injury into the relevant Anatomy, Investigations, Classification systems, Management options, Eponymous syndromes and much more... Developed by Orthopaedic Surgeons and Emergency Physicians for all healthcare professionals who work with trauma & orthopaedic patients, this app allows you to access the decision making process of an orthopaedic specialist simply by turning on your phone. If you work with orthopaedic trauma patients in primary care, the Emergency Department, on an orthopaedic ward or in a fracture clinic, this app will provide you with quick, practical, easy to access knowledge to help you diagnose, formulate a management plan and understand the basic science of the injury you are treating. Starting with the OrthoFlow skeleton, simply select the anatomical area of interest and follow the Flow… In a few clicks you’ll have your diagnosis and an easy to understand management plan. If you are a medical student, intern, foundation doctor, surgical trainee, resident, registrar, emergency physician, nurse, physician’s assistant, nurse practitioner and you work with orthopaedic trauma… use OrthoFlow, the orthopaedic specialist in your pocket! We actively take on board all suggestions for content and improvement and look forward to receiving your feedback - please email us support@orthoflow.org more",
  "reviews": [
    {
      "user": "Bdoman",
      "date": "03/15/2018",
      "title": "Useful app",
      "review": "Great information. Love the set up. Simple to use. Would be 5 stars but some of dispositions are cut off. Only half of the words are shown so unable to read it fully. Please update and will make it 5 stars. more"
    },
    {
      "user": "Matthew Oliphant",
      "date": "07/24/2023",
      "title": "An amazing app",
      "review": "It is a useful tool to help me dive into fracture care!"
    },
    {
      "user": "Even Money",
      "date": "07/16/2018",
      "title": "UC Doctor",
      "review": "Use it almost every shift. Excellent and useful app"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "56.2 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English"
}