{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Klara – Patient communication 12+",
  "subtitle": "Easy messaging & telemedicine",
  "seller": "Klara Technologies Inc.",
  "stars": "4.7",
  "rating": "12.2K Ratings",
  "price": "Free",
  "appDescription": "Thousands of healthcare teams across more than 40 specialties connect with and care for their patients using Klara’s secure messaging and telemedicine solution because it’s convenient and accessible to patients with no login, password, or download required—ever. With Klara, practices grow by providing patients with the convenient experience they demand while making their operations more efficient. Customer support is available in-app or by email at support@klara.com. FOR PROVIDERS (Patients, see below) With Klara, you can: 1. Provide your patients with excellent care no matter where they are through secure messaging and video visits 2. Communicate directly with patients, team members, and external providers 3. Whatever you’re sending — messages, documents, photos, or eForms — it’s all secure and HIPAA-compliant 4. Respond to texts, voicemails, website messages in one central place 5. Assign messages to your colleagues for quick responses 6. Send eForms for patients to fill out digitally 7. Automate routine patient outreach to patients before and after their appointments, including reminders, pre-visit instructions, post-visit follow-up, etc. 8. And more! You need a Klara account to use this app. Sign up for a free demo on our website. FOR PATIENTS Download the Klara app to connect with your doctor and other healthcare providers over secure messaging and video visits. You can also access Klara by going to patient.klara.com and entering your mobile phone number. Your healthcare provider must use Klara for you to use this app. If they’re not already using Klara, ask them to sign up today! more",
  "reviews": [
    {
      "user": "EABHMG",
      "date": "08/02/2020",
      "title": "Superb Patient Communication Software",
      "review": "The three C’s related to superb patient care include caring professionals, compassion and communication. Klara expedites the communication process in an extremely efficient manner that my patients really appreciate. We are able to communicate with our patients in an efficient user friendly manner that reduces or eliminates phone call waiting time and expedites the process for everyone involved. Our staff send patients their referral information via Klara, communicate about missed appointments through Klara, and send patients treatment plans, lab work data and other test results via Klara to name just a few of the benefits. Voice phone call messages are transcribed into Klara text messages which our staff can more efficiently respond to. We found that our electronic health record patient portal system was too cumbersome to use. Less than 10% of our patients got enrolled and utilized the system. When we switched to Klara, we achieved greater than an 80% utilization rate by our patients. Regardless of the patient’s computer skills and educational background, we were able to enroll them in less than 30 seconds compared to over five minutes with the patient portal. In summary, Klara has been a great asset to our medical practice and has become our go to #1 patient communication/engagement software tool. If you’re looking for a more efficient tool to communicate with your patients, I would highly recommend looking at Klara. more"
    },
    {
      "user": "whisperan",
      "date": "02/25/2020",
      "title": "Better response times!",
      "review": "I made a comment that I couldn’t get a call back when I left a message calling with a question or just trying to get some clarification. Usually I never got a call back! At least with Klara, I have gotten a response to my questions within a day. **The response time has changed this week. I am back to being frustrated with NO answers again! I called Friday with a problem about my pain medicines that needed a refill for the next month. For some unknown reason, my refills had been sent to a new and unknown pharmacy, even though my medical file listed my pharmacy as Walgreens in Collinsville. The new pharmacy was a small one, and didn’t have one of my medicines. They knew they could order the medicine, but there was a minimum order to deal with. Pharmacies must dispose of expired medicines, and loose money if this happens often. The owner of the pharmacy requested that I get my prescriptions at my regular pharmacy. Fine by me, since they were also more expensive. This problem happened again this month! I have been trying to get them to move my scripts using Klara, but I have been ignored since Friday. Hey! These are medicines I need to control my pain! This is not making me very happy! more"
    },
    {
      "user": "Mary C. Fitz",
      "date": "06/06/2022",
      "title": "Outstanding Care",
      "review": "I cannot share enough praise for the care and attention and compassion I received from Nurse Karen and the Staff at Dr. Sanders office ! Starting with my first phone call to his office in 2019, Suzy answered all my questions and concerns with great detail and enthusiasm. Danielle also took great care in scheduling me and accommodating my questions and explaining the planning of procedures. To my most recent experience, post surgery with Nurse Karen, answering all my questions with such detail and love - early morning, late night and weekends calls and texts. You are always in touch with someone who can help you, if needed. And Dr. Sanders… I felt totally comfortable with his kind approach and his vision for me as well as hearing what I wanted. I was 100% confident in his care. I am still healing, however, I saw the results immediately and each day going forward, I see the results and they are fabulous. I did not want to look 25… rather, to look refreshed and natural. Also, I highly recommend you go to Norma’s Cottage for aftercare … they are angels. I am more than happy to give Dr. Sanders and his entire Team the highest of recommendations! And I am happy to talk to anyone about my procedures and my experience. Ask Suzy for my number. Good luck, do it, you’ll feel so much more confident and happy. Best always, Mary FitzGerald more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "38.6 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English"
}