{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "HealthJoy 17+",
  "subtitle": "",
  "seller": "HealthJoy, LLC",
  "stars": "4.9",
  "rating": "3.4K Ratings",
  "price": "Free",
  "appDescription": "HealthJoy is a first-of-its-kind employee benefits experience platform. We make understanding and using your company’s health benefits simple, quick and easy. With your membership, you’ll get unlimited access to: • Healthcare concierges that make appointments, answer questions and more • Online medical consultations with prescription writing - 24/7 • A personalized benefits wallet will your company’s benefit cards • Get recommendations for an in-network local doctor or facility • We can explain and advocate on your behalf for medical bills • Discover savings for your prescriptions NOTE: You must have a company-sponsored membership to use HealthJoy. more",
  "reviews": [
    {
      "user": "MWC427",
      "date": "07/09/2020",
      "title": "Efficient and Recommended",
      "review": "My mother told me about this app for our health insurance plan and I had never used it until recently. I had noticed I was being overcharged for copays at my local doctors office and was on hold for half an hour before remembering I had this app! I submitted some pictures of my bills and within a few days they had accessed my claims, gotten in touch with the office billing department for me, and have notified me of the errors made. They got me a refund for everything I was overcharged for and it took me no longer than 5 minutes to provide the info they needed without making any calls in the process. They have been efficient in helping me find providers in my network and answering any and all questions I’ve had. I really recommend this app and I believe it will save lots of people time and unnecessary frustration/confusion!! more"
    },
    {
      "user": "Elphaba2852",
      "date": "02/06/2020",
      "title": "So Frustrating!",
      "review": "Honestly do not waste your time here. It would take less time to go see your regular doctor. I am not normally one to review since I’m pretty patient and understand things happen but wow this has been an awful experience! There’s been so much run around. There’s no quick explanation I can give, so here’s the full story: When they first called, I couldn’t hear anything on the other line. No big deal, I get that glitches happen. But when I got a call saying they’d tried calling back and I wasn’t answering when the doctor called, I started to get a little irritated. I wasn’t getting any calls. They called later to give me the same speech. I was like please just connect me since obviously they’re not getting through. When I was connected I could barely hear the doctor, so I wasn’t even sure who I was talking to. He seemed to get irritated with me, and then just prescribed me something, I’m not sure what, and hung up. Mind you, I’m at work while this is all going down. I have to keep getting up from my desk on a very busy day to take care of this. Then, my phone starts absolutely blowing up. Call after call. I reject them because I’m very busy and tired of the back and forth, but they keep calling. After about 8 rejected calls I answer. And of course, there’s nobody on the line. Never never using this app again. Horrible experience. more"
    },
    {
      "user": "Blaiggerty",
      "date": "03/05/2021",
      "title": "So Simple and User Friendly",
      "review": "First time using this app and I spoke with a concierge regarding some specific medical need our whole family needs right now and worked with Andrea who was so very courteous! I also used their bot, Joy, to find some other specialists my daughters need for their unique medical needs. Before, when finding a specialist, I researched each one by one myself before making appointments to see their reviews and whatever else info I could find to help me feel I found the appropriate provider. Now, HealthJoy does this all for me by not only looking at providers’ reviews but their proximity to where I live, hospital affiliation, and checking to see if they are in-network as well and even offers to make appointments for me! This makes it so nice for a busy full-time working and full-time homemaker mama! I definitely recommend this app! more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "159.7 MB",
  "category": "Health & Fitness",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English, Spanish"
}