{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "BMJ Best Practice 17+",
  "subtitle": "",
  "seller": "BMJ Group",
  "stars": "4.7",
  "rating": "191 Ratings",
  "price": "Free",
  "appDescription": "Instant access to the latest evidence-based guidance for healthcare professionals. Updated daily, BMJ Best Practice provides healthcare professionals with the latest evidence-based clinical decision support information. It's available offline, which means clinical decision support can be accessed anytime, anywhere. This app can be downloaded by those who have access to the BMJ Best Practice website, and have already set-up a username and password. Don’t have a subscription? Download the app and access a free 7 day trial. The app provides: - Fast access to the latest guidance on diagnosis, prognosis, treatment and prevention - 500+ patient leaflets - 250+ medical calculators - Guidance videos on common clinical procedures - Automatic CME/CPD activity tracking Your feedback helps to inform future developments. At BMJ, we have a user-centered product development process, which means that we enhance the product based on what our customers, and our users tell us they need and want. As a result, we have introduced features such as ‘night mode’ and patient leaflets to the app. If you have a question or want to provide feedback, please contact us at support@bmj.com. Thank you! more",
  "reviews": [
    {
      "user": "hoswari",
      "date": "05/19/2020",
      "title": "Easy to use and helpful\n\n    Developer Response",
      "review": "This apps is easy to use and the contents are easy to follow. It helps to manage my patients. Thank you. more Thank you so much! Elin"
    },
    {
      "user": "asCaio",
      "date": "09/16/2017",
      "title": "Good for fast consultation\n\n    Developer Response",
      "review": "However, I got some problems: 1. The topics separated by tabs is great for fast consultation however when we need to do a whole-text read it gets quite annoying. It would be good to have a buttom to display all tabs in a single page so we can scroll the text instead of simply swipe. 2. The load could be faster. 3. There is no search for the calculators. Also, a \"favorite\" buttom would be nice to have so we can access our most-used calculators faster. Besides that, the app is quite functional! more Thank you so much for your great and helpful feedback! I have added your suggestions to our enhancement list and hopefully we'll be able to provide you with solutions very soon. - Elin more"
    },
    {
      "user": "CraftsmanX",
      "date": "10/11/2021",
      "title": "Wonderful content\n\n    Developer Response",
      "review": "The content in BMJ Best Practice is one of the best in terms of scope, detail, and organization. The App may be further optimized although I do understand that the iPhone screen is not enough real estate. more Thank you so much for the great feedback! Please do contact us on support@bmj.com if you have any specific ideas on how we could improve the app further. Many thanks again, Elin more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac"
  ],
  "size": "97.2 MB",
  "category": "Medical",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English"
}