{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "myAir™ by ResMed 12+",
  "subtitle": "Start and succeed with PAP",
  "seller": "ResMed",
  "stars": "4.7",
  "rating": "69.2K Ratings",
  "price": "Free",
  "appDescription": "Take charge of your sleep therapy success with myAir™, an exclusive app available to ResMed AirSense™ and AirCurve™ users. GUIDED SETUP Whether you set up your equipment at home or in person, myAir helps you get started with confidence and ease. The Personal Therapy Assistant* feature provides interactive voice-guided instructions to help you set up your equipment and fit your mask. myAir's Test Drive* feature helps you get comfortable with therapy using your machine at different levels of air pressure. The app also offers a Library of helpful videos and guides that show you how to set up your specific AirSense or AirCurve machine and ResMed mask, as well as how to get comfortable on therapy. PERSONALIZED SUPPORT Getting used to therapy can take a little time, but with the right support you can enjoy a great night's sleep. myAir acts like your personal sleep coach. It guides you through therapy and connects you to the support you need, when you need it. myAir offers tailored coaching, tips and videos to increase your comfort and success. For example, if you have problems with your mask seal, myAir will provide tips about how to fix it. The app also offers a full Library of helpful videos and guides to answer common questions. Along the way, you'll get email and push notifications that encourage and support you. With regular check-ins*, myAir proactively prompts you to see how your therapy is going and provides coaching if you have problems. With your prior consent, myAir also shares your therapy insights with your healthcare team* so they can be more connected to your care. SLEEP THERAPY TRACKING With myAir, you can easily access your daily sleep therapy data to monitor your therapy progress. Simply log in to see your nightly myAir score, which shows how well you slept on therapy at a glance. Detailed metrics help you track your therapy progress over time. You can also download a therapy summary report to keep for your records or share with your healthcare provider. INTEGRATED WITH HEALTH APPLICATIONS myAir integrates with Apple Health and Health Connect to display the health data you track alongside your ResMed therapy data. Learn more at ResMed.com/myAir. *Feature available only with an AirSense 11 machine. Not available with AirSense 10 or AirCurve 10. Note: myAir is available only for ResMed AirSense and AirCurve machines with built-in wireless connectivity. For the AirMini™ machine, please download the AirMini by ResMed app. more",
  "reviews": [
    {
      "user": "Booyah474",
      "date": "07/11/2021",
      "title": "App does what it is meant to do",
      "review": "I’m only here because I had to do an app update, which does not occur too often so I was looking to see what was updated, and noticed all of the negative reviews. I have been using my ResMed CPAP for over 3 years now and I do not understand all of the negative reviews for this app. I read several and have been sitting here shaking my head. People complaining about how their machine operates and whatnot. I have several bones to pick with my machine, which maybe 2 or 3 days a week decides it wants to perform like a jet engine on take off. But this review is for the app, which does exactly what it is meant to do - syncs with your ResMed and shows you the sleep data, which takes some time to sync from the previous sleep cycle (about 10 minutes? I’m not sure since I don’t sync it immediately after waking up). I use the app while on WiFi, with a VPN, and have no issues connecting to my machine. I’ve used the app while on crappy hotel WiFi as well with no problems. This app shows the bare basics so if you want a more accurate account of how you are sleeping, take the memory card to your doctor and they can look at the data more thoroughly. Or buy a Fitbit, even the basic ones will show you your sleep cycle with REM data. This app gives you a very basic account of how you slept the previous night so it performs as advertised. more"
    },
    {
      "user": "Seminolesfan76",
      "date": "11/14/2023",
      "title": "Minor issues\n\n    Developer Response",
      "review": "I only have two minor issues with this app. Apparently when I get up in the morning the app is reporting it as the previous day. Because of my job I don’t get to bed until after midnight. So as an example: I go to bed after 3 am Friday and wake up generally around 10:30 or 11:00 am on Friday. Yet my data when it finally comes through shows up as Thursday? I kept track of the time on CPAP therapy whenever I wake up. And that’s the time it shows up as the previous day’s data. Why? Also, is there any way to get much more in-depth information like what the Doctor would see from machine data? I think that would be awesome to see that. Note: Just received a response yesterday after I wrote the above review. It was a really good explanation about the time running noon to noon of the following day. Now I understand. Looking at the app information further, it does seem to give you the information in regards to Compliance Issues that are required for say DOT in the case of Commercial Truck Drivers. Again you’ll still need a detailed report from your Doctor for the required physical. I changed my rating to 5 instead of the original 4 stars. more The device records data from a period of 12 PM (noon) to 12 PM (noon) of the following day, in order to consecutively capture the most common sleeping patterns within one “night” of therapy use. If you tend to consistently sleep with the same time period each day, there should be no compliance issues when it provides data reports but if you do still have concerns, you can speak with your doctor or DME provider and they can provide further information on this and help determine whether more detailed reports that break the data out by session might provide better guidance. They can also provide you with a printout of your full report by request, for clinical or compliance purposes as needed. more"
    },
    {
      "user": "Jerbo Scudero",
      "date": "01/31/2023",
      "title": "First 3 weeks",
      "review": "I received my machine and I was reluctant to even have to use one. Prior to using a machine I was having neuropathy on both feet. That kept me up most of the night. I went through the walk through of the machine with the Resmed representative and started using it that same evening. I needed to get 4 hrs a night and I had to work at it. The comfort of the mask is paramount to having a successful experience with the machine. I was able get my 4 hrs but I really had to work at it. I did notice almost immediately my neuropathy went away and that was a blessing in itself. But I wasn’t sleeping with the mask on, I was just making sure I got my 4 hrs. Sometimes I would wear it for an hour and off for two and then on for an hour, sleep for 2 and then back on for an hour or as long as I could handle it. I finally remembered that I was sent a different mask and Of course my wife knew exactly where it was. The mask was a little different and it only had one headband and it was a nose mask. It was so much lighter, the first night I used it I slept 9 hours. I’ve since been getting my 7 hrs of sleep almost every night. Don’t settle for being uncomfortable with your mask, find the right one for you. It’s the difference of making it work for you or not. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "Apple Watch"
  ],
  "size": "162.2 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English, Portuguese, Spanish"
}