{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Hear My Baby Heart beat App 4+",
  "subtitle": "Share your baby beat sounds",
  "seller": "Fat Cigar Productions Ltd",
  "stars": "3.9",
  "rating": "7.1K Ratings",
  "price": "$5.99",
  "appDescription": "The best-in-class prenatal listener app. Category No.1 in 102 countries with great ratings, reviews and long-term customers. No in-app purchases or subscription! Pregnant? This is for YOU! Hear My Baby is the leading app since 2018, allows you to use just your iPhone microphone to record and share your baby’s beat sounds. It is the best-in-class, has over 5000 5* ratings, is super simple and safe to use. Supports Apple Airpods and Bluetooth Headphones. \"It took some time and patience... thank you for creating this cheap, awesome technology to use at home.\" - Niki Category #1 in the USA and 102 other countries. Here's why... Developed by parents like you (with expertise in sound engineering and apps) who wanted a trustworthy way to record our baby's fetal sounds (kicks, heart beat etc.) - and keep a record of a quality that we hadn't been able to find before in other apps. Extensively tested on expectant mothers with over 450,000 downloads since launch! \"I was skeptical at first. Great app! Worth it.\" - Legretta **** But honestly, does it actually work?? **** Yes. We've sound-engineered ways to attempt to isolate the baby's heart beat, sounds (kicks, heartbeat and more) and using an advanced algorithm, amplify them making them easier to detect and hear. NOTE: It takes time, technique and patience and depends on the position and number of weeks of your baby so you'll need to stick with it. When you do, our results are excellent. Results are best between 27-40 weeks as your baby is bigger and stronger. We constantly improve our extensive tutorial and techniques to handhold you through - we even have a support group on Facebook to help. We want you to be happy with Hear My Baby heartbeat and to monitor results can sometimes be difficult. If you are struggling (can't find your own heartbeat etc.) DO contact us via support. We want to help you! GIFT THIS APP: Click the “Buy App” arrow on the iTunes® App Store FAQs **** No Accessories Required **** We use the internal microphone from your phone to attempt to listen and record your fetal sound. We recommend Bluetooth Headphones for best results. **** How It Works **** 1. Hear My Baby, has been precisely engineered to listen to abdominal sounds, then record and amplify them. Listen to your own heartbeat first to confirm the app is set up correctly. 2. It works best when baby is head down and their back is facing forwards. 3. Remove the case, be in a very quiet room and focus on your lower abdomen. Listen then Tap record. 4. Our simple recording management helps you to keep a record of your special moment 5. Take a selfie if you wish and share 6. We'll walk you through exactly how to get the best baby heartbeat results. **** Easy Share Feature **** Sharing is awesome you can opt to share via Facebook, WhatsApp, Instagram or email. **** We Care About Your Privacy **** We take your privacy and special moment seriously. You decide who sees or hears it and can delete it at any time. **** Before you start... **** You DO need to carefully follow the instructions for Hear My Baby to work. A quiet room is critical for results as the mic is super sensitive. HMB doesn't fake the baby heartbeat or other fetal sounds :) Please Note: results are normally superb, however the recording may not work if your placenta is at the front of the tummy or the baby is in the wrong position. **** Supported Phones **** 15, 14, 13,12, X, Xs, 11, 11 Pro, 8, 7, 7+, SE, 6. We don't support iPad. **** Worried about safety? We are too! *** HMB is safe but to be extra sure DO switch your iPhone to airplane mode. This is a precaution and automatically stops all cellular transmissions. **** Is it a substitute for medical devices/support? **** No - under no circumstances is HMB a substitute for medical support - if you don't get a result it doesn't mean anything is wrong :) Consult your doctor for any advice. We are NOT approved by the FDA. This is not a medical device and is not a medical baby heartbeat monitor. It is for FUN. Please do check our T&Cs before downloading. For results examples: www.facebook.com/hearmybaby www.instagram.com/hearmybabyapp more",
  "reviews": [
    {
      "user": "MommaMermaid312",
      "date": "09/11/2018",
      "title": "Satisfied Overall",
      "review": "So when I first downloaded the app I was super skeptical because I had downloaded a few other similar apps that didn’t work at all and paying 5 dollars seemed like it wouldn’t be worth it. Despite my reservations I downloaded it anyway and was disappointed I couldn’t find her to save my life. I was about 22 weeks at the time so I figured I’d surely be able to find her heartbeat being halfway through my pregnancy. I almost undownloaded the app and asked for a refund but something told me to just wait and I’m glad I did. I’m 25 weeks now & was able to find her heartbeat almost immediately after hitting the listen button. I maybe could’ve found her earlier but I waited a little longer just to make sure her heartbeat was strong enough to really be picked up by the app versus at the drs office. I’m glad I kept the app and would highly recommend it to future moms. I’d just tell them to give yourself some time if you don’t hear the baby at first and not to get discouraged. more"
    },
    {
      "user": "SOFCC",
      "date": "01/19/2019",
      "title": "BEWARE!!! THIS APP IS MANIPULATING A BABY’S HEARTBEAT\n\n    Developer Response",
      "review": "We were so excited to be pregnant but i couldn't be seen my my Dr till after the holidays so I bought this app for “REASSURANCE”! I found what I thought was a babys heartbeat and was happy and posted it! Hell even the BPM was at 156 ( typical baby heart rate) When i finally went into the Dr she discovered i did have a gestational sac but a baby never formed so I never had a forming baby! This app manipulates a babys heartbeat! I actually posted a recording of what ive been hearing for weeks on the facebook group, check it out!!! Sounds just like a babys heartbeat except there’s absolutely no baby, another mom used it when she wasn't even pregnant and she found a babys heartbeat another mom as taken tests, all are negative results but she also has found a babys heartbeat, its sad how we moms are getting false a manipulating sounds !!!Please MOMS do not use this app for peace of mind or for reassurance! If you are having an issue don’t hesitate for one second to see your provider or the nearest ER! DO NOT TRUST THIS APP OR ANY APP when it comes to your pregnancy or your health! Trust medical testing, see your provider! Be excited for your pregnancy and excited about your visits to see your baby on ultrasound and a medical doppler! Best of luck to all you mommys and your sweet babies!!! more Hello SOFCC, thank you for your comment, and in the strongest possible terms we do not recommend downloading HMB for reassurance, and we make that clear in all our information, it is NOT a medical device. We also recommend trying the app only after 16 weeks and not before and best results around 27-30 weeks. To address the issue you raise - the recording you posted, which we've listened to, sounds like it is caused by the volume being too high and is a sound feedback loop (often appearing to have a high BPM - but we don't include a feature to measure this within the app). We recommend that the volume is placed at 20-30%. This is a common issue and may have been the cause of the other case you mention. We do provide advice on this in the instructions and in the FAQ (there is a section on 'MY SOFA HAS A HEARTBEAT!') which discusses this. To be clear, we do not manipulate anything within the app, if we did everyone would give us a 5* rating and perfect results, and that isn't the case and is why our rating is only 4/5. We do offer support to all our customers through the GET SUPPORT button and we're always happy to help and discuss any issues and help where we can. We're very sorry you've had a bad experience with the app, with best wishes, The HMB Team. more"
    },
    {
      "user": "LNFran",
      "date": "08/12/2020",
      "title": "It works! No seriously",
      "review": "I’m 12 wks pregnant, & I was skeptical when I downloaded this app because I had been unsuccessful with finding my baby’s heartbeat using other free apps. I tried for about an hour at first, but couldn’t find baby at all. I didn’t get discouraged bc I knew baby was doing fine. I decided to take a break & try once more before bed. I found the heartbeat within 10 minutes on the second try! I can’t explain it, but I knew what it was instantly after hearing. I will say that one sign of successfully locating the heartbeat was seeing the steady rhythm being shown on the screen. If you don’t know what to listen for, look for that first and the sound will match! I also had a full bladder when I checked the second time so I think that helped. Don’t trust the free apps because I kept my phone on baby’s location and could not hear anything through them. This is the first time I’ve listened to a Facebook ad and paid for an app... ever lol. Also my first app review so it’s definitely worth it! more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch",
    "Apple Vision"
  ],
  "size": "39.3 MB",
  "category": "Medical",
  "ageRating": "4+",
  "languages": "English, Italian, Portuguese, Spanish"
}