{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Glucose Blood Sugar Tracker 4+",
  "subtitle": "Diabetes Log",
  "seller": "App Sub 1 LLC",
  "stars": "4.7",
  "rating": "22K Ratings",
  "price": "Free",
  "appDescription": "Glucose Blood Sugar Tracker is the #1 diabetes app built for tracking blood sugar, weight, blood pressure, A1C, medications, carbs and more. With over 500K+ users, Glucose Blood Sugar Tracker is the top rated diabetes app in the AppStore. FEATURES YOU'LL LOVE • Log your data and identify trends in one easy to use place • Create straightforward entries and tag them for time of day, before/after meals, etc. • Schedule reminders to check your blood sugar levels • Filters that help you see trends and graphs of your logs • Email reports directly to your physician with every detail you want to share • A1C estimation calculator • Also track insulin, medication, A1C, blood pressure, carbohydrates, weight and ketones Over 10K+ users use Glucose Blood Sugar Tracker to manage their diabetes. ---------------------------------------------------------------------------------------------------- \"Beautifully designed without all the other distractions from other glucose apps\" - M.C. \"Thank you for creating this glucose tracker. It is extremely user friendly (I became very frustrated with many others), and it will track all that I need in one location - I was really concerned that no one had what I needed, but YOU DID IT!\" - C.P. ---------------------------------------------------------------------------------------------------- Glucose Blood Sugar Tracker makes it easy to identify trends and log your data in one easy to use place. View a graph of your data and even send a report to a loved one or a healthcare professional. You can also schedule reminders to ensure that you are diligent about checking your blood sugar. Whether you have diabetes or prediabetes, this app makes it easy to track your blood glucose levels. Glucose Blood Sugar Tracker also offers an estimated A1C calculator to help keep you on track in between lab measurements. Glucose Blood Sugar Tracker also tracks what time of day you are checking your blood sugar, such as first thing in the morning, before a meal, or before bed. You can also add a note to each record. In addition, Glucose Blood Sugar Tracker allows you to track insulin, medication, A1C, blood pressure, carbohydrates, weight and ketones. It is a comprehensive app for both diabetics and prediabetics. You can also sync data seamlessly between devices, track medications, and see detailed averages. The app also has configurable reminders to check your blood glucose levels. This helps you make sure to check these levels to stay in control of your diabetes. Tracking has never been easier. Glucose Blood Sugar Tracker integrates with HealthKit by writing all inputted entries to the Health app. Be in charge of your diabetes! Blood sugar tracking has never been this easy! This diabetes tracker an estimated A1C calculator. Please note that this is just an estimate and should never be used for diagnostic purposes. We can't wait for you to join the family :) Install Glucose Blood Sugar Tracker today, for free! Terms of Service: https://www.glucoseforiphone.com/terms-of-service more",
  "reviews": [
    {
      "user": "MetroPhoto",
      "date": "12/02/2017",
      "title": "Great Application\n\n    Developer Response",
      "review": "it’s easy to use. Right to the point and uncomplicated. I have been looking for an app like this that’s quick and easy for my busy life style . Had a Doctor appointment and was able to show him my progress. I love it . The Only change I would suggest is the graphing of the data should be displayed horizontally not gust vertically because it compresses the data to much over time and hard to read. I check my A1c 4 Times a day; X 30 days =120 data points. Vertical room on my screen is about 2.5 inches , horizontally it’s about 8.5 inches . Thanks ! Richard more Hi there, Thank you for taking the time to write your detailed review. We're glad you found the reports useful for your doctor–it's a feature that many users find useful. We're working on some updates soon that should make the graph easier to read with more data. - Glucose Support more"
    },
    {
      "user": "rjp2015",
      "date": "04/01/2018",
      "title": "Needs a little work\n\n    Developer Response",
      "review": "Coming from Android’s BG Monitor, I was looking for something equivalent in simplicity but still had the features I was used to and this was the closest I could find. For the most part it works fine but a few minor but deal killers for me.. First is the blood sugar is REQUIRED for an entry, sometimes a BG is not necessary if you are bolusing after a check/bolus/correction. I end up using the previous blood sugar and it messes with the averages displayed on the home screen. Second is the graph, when selecting a blood sugar it only displays the number and date, the time is not included which makes it difficult to target the exact time frame of a high/low trend. Third the contact information doesn’t work, it always displays “Cannot connect to server” at the top every time. There is also no feature for diet other than a notes section on each entry. Perhaps once the bug with the contact method is fixed and I can get in touch I will change my review. This app has great potential but for me it’s not quite there yet. more Hi there, Thank you for your feedback and review. We have fixed the bug with the in-app support. Please get in touch with us in the app to address your other concerns! Thanks, Glucose Support more"
    },
    {
      "user": "MamaCourduroy",
      "date": "12/18/2018",
      "title": "So beautifully designed without all the other distractions from other glucose apps",
      "review": "Learning to help navigate a Type 1 diagnosis, and this app is by far the easiest to navigate and see the full picture at a glance. We’ve downloaded and tried several of the top apps to see which is easiest and has all the features we need. Once the developer releases med update (see notes below), we will update to 5 stars. Highly recommend this app for anyone tracking blood glucose, but especially for those newly diagnosed with diabetes. Pros - all features are free and no annoying ads that take up half the screen - easy to make entries and tag them for time of day, before/after meals, etc. - filters make it easy to see trends, and emailed reports have every detail you could want to share with your dr. - estimates A1C at top of the screen (also free feature) - can make suggestions to developer within the app...and we got almost an instant response back! :) - can set reminders throughout the day - graph option gives clear picture of glucose trends Cons - can’t specify type of meds unless make a note on the feature (developer says this is coming soon) - have to click on each entry to see the notes, so no way to see from overview screen which med was taken (hopefully med notes won’t be necessary with update) - Apple Watch app isn’t functioning more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Apple Watch",
    "Apple Vision"
  ],
  "size": "67 MB",
  "category": "Medical",
  "ageRating": "4+",
  "languages": "English, Arabic, French, German, Italian, Japanese, Korean, Polish, Portuguese, Simplified Chinese, Spanish, Traditional Chinese"
}