{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Huckleberry: Baby & Child 4+",
  "subtitle": "Baby Tracker & Sleep Experts",
  "seller": "Huckleberry Labs Inc.",
  "stars": "4.9",
  "rating": "32.9K Ratings",
  "price": "Free",
  "appDescription": "A one-stop baby & parenting app for all things baby and toddler. Need a newborn tracker or need to keep track of your child's activities, sleep & feeding? Our comprehensive solution provides you with a baby tracker, baby sleep guidance, and expert advice to help you navigate parenthood. SEE WHY OVER 3 MILLION PARENTS LOVE THE HUCKLEBERRY: BABY AND CHILD APP FREE CHILD & BABY TRACKER APP -Pumping tracker, with reminders, to track total amount and log output from each side. -Track bottle feeds or breastfeeding time , amounts and the last side you breast fed on. -Add notes to our solids tracker (baby food tracker) of all solids your baby has tried and their reactions to the foods. -Track potty activities (pee, poo, mixed or accidents) with our potty tracker. -Track medication, temperature, and growth. -Other features include: one-hand tracking, summary charts, cross-device syncing for multiple users, multiple child profiles, reminders, dark mode, and data export. HUCKLEBERRY PLUS -Make nap and bedtimes easier with the SweetSpotⓇ feature that predicts your child’s next naptime like magic. No more wake window math. No more overtired babies: just better sleep. - Widgets are now available for tracking sleep, SweetSpot, bottle feedings, nursing, pumpings, diaper changes, and solids for Huckleberry Paid members. -Live Activities are now available to provide real-time updates to your iPhone lock screen. We currently support tracking sleep, nursing, and SweetSpot for Huckleberry Paid members. -Schedule Creator allows you to visualize your day by creating age-appropriate sleep schedules tailored for your child. Share your custom-made sleep schedules with other caregivers. -Enhanced reports for sleep (Wake Windows vs. SweetSpot, Rise and Bedtime) and solids (Allergens and Sensitivities). UNLOCK ALL FEATURES WITH HUCKLEBERRY PREMIUM Huckleberry Premium is like a sleep consultant in your pocket! Get everything in Huckleberry Plus, along with customized sleep plans created for you by one of our sleep consultants. Get personalized help on all sleep challenges, such as newborn day/night confusion, the dreaded four-month sleep regression, nap transitions and night wakings. Huckleberry blends the step-by-step guidance and advice of a traditional sleep consultant with the convenience of an app: no crying it out required. We’ll give you easy-to-follow actionable guidance to get better sleep for the whole family. AWARDS The Huckleberry baby app ranked #1 in the iOS medical category across the globe. Our Huckleberry parenting and baby tracker app has served 2.5MM+ families across 179 countries and maintained a 4.9 star rating with over 40K reviews on the Apple App Store. Up to 93% of families who use Huckleberry baby tracker report improvement to their child's sleep. Finally - sleep guidance from baby sleep experts, expert advice, and an easy baby tracker, all in one app. No matter your sleep situation, Huckleberry can help. Huckleberry Plus: $9.99/mo or $58.99/yr Huckleberry Premium: $14.99/mo or $119.99/yr. Includes one child’s assessment per month. Note: All subscriptions auto-renew & can be canceled anytime with no penalty. Prices are in USD; pricing may vary in other countries, & actual charges may be converted to your local currency depending on the country of residence. Payment will be charged at confirmation of purchase. Subscription automatically renews unless canceled at least 24-hours before the end of the current period. Account will be charged for renewal within 24-hours prior to the end of the current period with the same term (monthly or annual) & same price. Subscriptions may be canceled in the Settings -> Huckleberry Memberships page in the app. Terms of Use: https://www.huckleberrycare.com/terms-of-use Privacy Policy: https://www.huckleberrycare.com/privacy-policy more",
  "reviews": [
    {
      "user": "emmy2002us",
      "date": "09/01/2023",
      "title": "So helpful…even as second time parents",
      "review": "This app has helped my husband and I so much. Our first baby was a dream sleeper from the start. She ate and slept on a very regular schedule and automatically adjusted as she went and around daycare. She definitely ruined us for our second. Our second baby has thrown us for a loop. She didn’t eat regularly and ended up having a milk protein allergy. She can’t have casein or whey. Luckily she doesn’t have a soy allergy and we switched to that. The app helped us track her feedings so we knew how much she was taking in and how frequently and what her stools were like and her symptoms. It also helped us narrow in her sleep issues and figure out when she needed a nap as she didn’t give off all the regular cues and constantly fought sleep. At 4 months we started sleep training and the app has been immensely helpful in getting her on a schedule. There are only two things I wish were improved. I wish the live tracking had bottle feeding and not just nursing as an option. Second, I wish the activity had a custom option so I could add a button for track cranial band time. Our baby has Torticoils and is in PT but also needs a cranial band and we need to track wearing time u til we get up to 23 hours. As my husband and I rotate time while we work from home we need to be able to communicate without actually talking as we sometimes switch during meetings or nap time. more"
    },
    {
      "user": "sunnysteph_o",
      "date": "10/27/2023",
      "title": "Definitely a good app.\n\n    Developer Response",
      "review": "This app was recommended to me as a first time Mom with a cryptic pregnancy since I had no time to prepare for my baby, and it is incredibly useful to feel like I don’t have to remember everything when it comes to when I last changed his diaper or fed him, but I will say the one downside to this app, to no fault of its own, is that as a Mom whole is already struggling to balance so many things at once, I’ve found myself obsessing over when I forget to log something immediately or if the app doesn’t layout schedules properly. For an example, it will tell me in one tab how many feedings there have been for the day. In another where I can view the week schedule, it’ll break down my entries and for some reason it has separated one feeding session into two depending on how long our session was, making me think that from the other tab I have fed him more times that I actually have. It’s a bit confusing and I found myself trying to figure out why it has these weird quirks to the point that I looked down at my baby and took a big breath, realizing that it was really not the priority 😆 Once again, an excellent app when it comes to struggling to keep track of so much, but if you find yourself being prone to over stressing about everything, it would give you some peace of mind to try it but also see how you do without it. I’ve enjoyed more just listening to and learning from my baby and his habits naturally and creating my own habits off of his! more Hi there, Thank you for your positive review! We are so glad you are experiencing the magic of Huckleberry! We'd love to understand how we can improve and earn a better rating! Let us know at support@huckleberry-labs.com. We will look forward to hearing from you! more"
    },
    {
      "user": "AG 17",
      "date": "02/29/2020",
      "title": "My #1 recommendation to new parents. This will give you sleep.",
      "review": "I started using Huckleberry when my son was about 6 weeks old. It’s the best one I found for tracking things like food, diapers, sleep, etc., and I tried basically all of the free apps. But then when he hit 2 months and the app started giving me the suggestions for his wake and sleep windows...good god...our lives did a 180 in the best possible way. I’ve never utilized the premium features, only the free app. Within about two weeks of using it after her hit the age where it would make sleep time predictions (2 months), and sticking to the recommended wake windows, my son was sleeping through the night at about 9 or 10 weeks old, and since then he’s had two nights with one wakeup (he’s now 6.5 months). Was it the app? I think so. It seems to work like magic. I’m part of a mom group, and we all started using it. Every single person has had the same magical results. Give it about a week of logging everything and really stick to the suggestions and you’ll be amazed. Baby doesn’t seem tired but app says it’s nap time? Try taking baby to their sleep space and marvel at how they will fall asleep. It can read your baby’s mind and you won’t even care that it feels a little creepy and on-the-nose because your child will sleep. I love this app so much that I’ve put off writing my review because I wanted to make sure I conveyed how wonderful it is. I hope I have! more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch"
  ],
  "size": "138.4 MB",
  "category": "Medical",
  "ageRating": "4+",
  "languages": "English"
}