{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "myVCA 12+",
  "subtitle": "",
  "seller": "VCA Antech Inc.",
  "stars": "4.9",
  "rating": "19.2K Ratings",
  "price": "Free",
  "appDescription": "myVCA is your tailor-made guide to raising a healthy and happy pet. · 24/7 Live Chat with Licensed Veterinary Professionals · Get health care and medication reminders · Quickly book appointments · Order pet food, treats, and more · Access personalized pet care information Not a VCA client? Find a hospital near you at vcahospitals.com/find-a-hospital. Learn more about CareClub at VCACareClub.com. more",
  "reviews": [
    {
      "user": "Victoria S. Boo~Boo Owner",
      "date": "02/06/2020",
      "title": "Victoria Schaller Owner of LuvUrPet, LLC and pet owner of Boo-Boo Clifford",
      "review": "First, I want to Thank all the staff at VCA for their wonderful and caring professionalism. I have had many times tried to save a dog’s life after finding a dog hit on a Sacramento City Streets, they are very professional and when I had an emergency with my own dog they went beyond the mile to help him with out all the money propaganda or kept me apart of every step of my dogs treatment and show true compassion and empathy for me and my dog. I truly recommend this Vet Clinic to anyone in need of a Vet in Sacramento, California. I truly want to Thank them all for being such a inspiration to my new career in the as a Vet Tech. I know that my pet may not live much longer but to be able to give him all that is possible with out becoming homeless is such a blessing. At least I can prepare for his last few months and days with me and make them the best days of his life for a dog. I would love to dedicate his life to them all! more"
    },
    {
      "user": "Ianb10150",
      "date": "05/25/2022",
      "title": "The VCA Des Moines team is awesome!",
      "review": "I recently needed to board my dog for an overnight for a weekend in July and I was thinking that I would be out of luck. Not only could I board but I know my pup will be in the Suite. The suite is worth the extra little bit if you want to be assured your dog has the absolute best care while you are away. She will even get a tv to watch while I am gone. Seriously, who does that? I am beyond blown away at the level of attention paid and help given to me from my time with VCA Avondale. They even helped me schedule upcoming services needed to board without making me have to schedule a follow up call. I will be recommending this veterinarian service to ANYONE that asks me and I al working to have my moms dog switched over as well! Thanks again! more"
    },
    {
      "user": "broseph11",
      "date": "07/05/2022",
      "title": "This Is How You Make An App",
      "review": "While this isn’t a review of the VCA staff themselves, they also deserve a 5 star review based on the location we’ve been to. This app is amazing. Everything is so clearly organized and easy to access. Its also very convenient being able to select which pets records we want to review. Even the care tips were able to provide relevant information. When we had questions not already answered by the care tips or their records, the chat with a vet feature was a quick way to find an answer. That worked out way better than I anticipated. We are definitely glad we chose VCA based on their service alone, and this app is the icing on the cake. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Apple Vision"
  ],
  "size": "205.7 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English"
}