{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Daylio Journal - Daily Diary 4+",
  "subtitle": "Mood Tracker, Health, Wellness",
  "seller": "Relaxio s.r.o.",
  "stars": "4.8",
  "rating": "49.3K Ratings",
  "price": "Free",
  "appDescription": "Self-Care Bullet Journal with Goals - Mood Diary & Happiness Tracker Daylio enables you to keep a private journal without having to type a single line. Try this beautifully designed & stunningly simple micro-diary app right now for FREE! ** WHAT IS DAYLIO ** Daylio is a very versatile app, and you can turn it in whatever you need to track. Your fitness goal pal. Your mental health coach. Your food log. Your gratitude diary. Mood tracker. Exercise, meditate, eat, and be grateful. Take care of your mental, emotional, and physical health. Good self-care is a key to improved mood and reduced anxiety. This is the time for your wellbeing, self-improvement, and self-care. Use Daylio as your daily bullet journal. We build it on three principles: 1.) Reach happiness and self-improvement by being mindful of your days. 2.) Validate your hunches. How does your new hobby influence your life? 3.) Form a new habit in an obstacle-free environment—no learning curve. Daylio is super simple to use, create your first entry in two steps. For anxiety and stress relief, make sure to include activities that help you to cope with negativity. Everybody can use a mood boost! You can measure their impact on your mood in stats. ** HOW DOES IT WORK ** Pick your mood and add activities you have been doing during the day. You can also add notes and keep an old school diary. Daylio is collecting recorded moods and activities in the statistics and calendar. This format will help you to understand your habits better. Keep track of your activities and create patterns to become more productive! You can review all entries in the statistics on charts or the calendar and share them with your friends. To make it even better, Daylio allows you: - Make reflection a daily habit - Discover what makes you happy - Use a big database of beautiful icons for your personalized activities - Mix and match your own moods using funny emojis - Explore exciting statistics about your life on weekly, monthly or yearly charts - Deep dive into advanced statistics for every mood, activity or group - Customize color themes - Enjoy nights with dark mode - See your whole year in 'Year in Pixels' - Create daily, weekly or monthly goals and motivate yourself - Build habits and collect achievements - Share statistics with your friends - Safely back up and restore your entries via your private Google Drive - Set reminders and never forget to create a memory - Turn on PIN lock and keep your diary safe - Export PDF and CSV documents to share or print your entries ** PRIVACY AND SECURITY ** We are a top private journal since we do not store or collect your data. At Daylio, we believe in transparency and honesty. Your data is stored locally on your phone. You can optionally schedule backups to your private cloud storage or take your backup file with you anywhere. Data are entirely under your control at all times. Data stored in the app's private directories are not accessible by any other apps or processes. Your backups are transferred to the iCloud Drive via the secure (encrypted) channels. Journaling has never been easier! --- Read our full Terms of Use and our Privacy Policy: Terms of Use: http://terms.daylio.net Privacy Policy: http://privacy.daylio.net more",
  "reviews": [
    {
      "user": "dragon_mobius",
      "date": "12/23/2023",
      "title": "This app changed me profoundly",
      "review": "I suffered from depression for many years in my life, in 2018 I discovered this app to help cope with it. Daylio at first was simplistic for me. I would choose a happy face or sad face depending on my mood and leave a short blurb of the day sometimes. It was easy enough for me to do and didn’t require that much effort so building the habit of early journaling was easy. little by little I added activities so I didn’t necessarily even have to type anything but could just choose an activity I did, it helped me begin to be able to track what was making me happy and what was making me sad and spotting the consistency of these activities correlating with my moods. Almost 6 years later, my journal entries have become very detailed. If I’m trying to recall what I did days, weeks, or even months ago, I have the resource to find it. Daylio is become the single most important app on my phone because it’s help me establish a record of my life. The continued updates have made it worth buying the premium version. You don’t require subscription to use it as so many other apps and services nowadays have become obsessed with bleeding consumers dry. I recommend this app to anybody who feels like they’re in a rut, to anyone who needs an eye-opening self reflection tool. Do you want to get a better understanding of your habits and who you are as a person? This app can be your greatest resource to do so. more"
    },
    {
      "user": "CatLover1707",
      "date": "05/04/2022",
      "title": "Wonderful Mood Tracker",
      "review": "I was looking for a mood tracking app where I could have multiple entries throughout the day, not just one at the end. I use this app to help track my anxiety and how I feel leading up to an anxious period as well as other moods. I love that I can go back and add entries even days later if I forgot. I also love that it’s completely customizable and I can have tons of options. I did end up upgrading to premium to unlock unlimited moods and activities because I find it really beneficial and absolutely worth the around $20 a year. I have an activities folder with ranges for my heart rate so so can track that during an anxiety attack, I have one with different physical symptoms like sweaty, dizzy, etc., and even a folder for methods and techniques I’ve already tried to calm down. I hate having to type out every little thing so being able to just go through and simply pick what applies at the moment is great. The small comment section is great as well if I want to add a small note about something that might be important but not frequent enough for its own button. This app is really fantastic for helping track moods and keeping a record of how I am feeling and when in an easy to use format that’s customizable to every person, even down to the color scheme. I started off simply looking for an app where I could have more than one daily entry but this app goes above and beyond. more"
    },
    {
      "user": "Don't Usually Review, but ...",
      "date": "10/05/2018",
      "title": "Great insight into yourself, simple, useful - Love it!",
      "review": "I have always loved to journal and document both important and mundane days in my life. It’s easy to do with this app, even if you only have a few minutes to check in with yourself to see how you are feeling. All you do is click a few buttons to record what you’ve been doing and how you feel, the app records the time stamp and you’re done! Or if you have more time you can add text too - a little or a lot - I’ve written paragraphs at times. As someone diagnosed bipolar over 20 years ago, using this app is a great way to track moods (I too am in to the popular “mindfulness” trend, even before it became popular): it allows me to pause throughout the day, take a few minutes to sit quietly, notice how my body feels, see what kind of feelings my thoughts bring up in me, and then record that snapshot. Then, at any time I can look at the app’s simple reports that show a variety of trends in you activities and mood over a given period of time. I may think, “wow, I’ve been down and frustrated a lot lately” and then look over the report for the month and see that I actually had a lot of really positive times too. It helps me focus on the positive and work on training my brain not to go automatically to the negative. With practice, our brains CAN be rewired that way! I’ve done it successfully with a couple different things I wanted to change. Anyway, try the app. It’s great! more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Apple Vision"
  ],
  "size": "203.5 MB",
  "category": "Lifestyle",
  "ageRating": "4+",
  "languages": "English, Bulgarian, Czech, Danish, Dutch, Finnish, French, German, Greek, Hindi, Hungarian, Indonesian, Italian, Japanese, Korean, Malay, Norwegian Bokmål, Polish, Portuguese, Romanian, Russian, Serbian, Simplified Chinese, Slovak, Slovenian, Spanish, Swedish, Traditional Chinese, Turkish, Ukrainian"
}