{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "NYU Langone Health 12+",
  "subtitle": "MyChart, Find a Doctor & More",
  "seller": "NYU Langone Medical Center",
  "stars": "4.7",
  "rating": "20.2K Ratings",
  "price": "Free",
  "appDescription": "As an NYU Langone Health patient, you can use our app to manage your health information and care on a mobile device. When you log in to the app with your NYU Langone Health MyChart account, you'll have convenient access to features including: • Health summary: See your current health concerns, medications, immunizations, allergies, and more. • Appointments: Find the right doctor for your needs; schedule or cancel upcoming visits; and see information about previous appointments. • Test results: View lab test results and information about what they mean. • Messages: Communicate conveniently with your care team. • Health advisories: Be notified when it’s time for your annual physical, flu shot, and other preventive care needs. • Proxy access: View health information for designated family members, including children. • Remote monitoring: Connect the app with Apple Health to monitor and share key health information with your care team, such as blood glucose, blood pressure, oxygen saturation, steps, temperature, and weight. (Disclaimer: Remote patient monitoring through the NYU Langone Health app requires prior enrollment of the patient by a healthcare provider. The app currently does not support individual usage without clinician consent and support. Patients must always consult with their healthcare provider before making any changes to a care plan.) more",
  "reviews": [
    {
      "user": "ᕊᗝᔕᔕ",
      "date": "09/12/2024",
      "title": "Review",
      "review": "Shoreham Medical is truly exceptional, thanks to the outstanding team of professionals who work there. Every staff member is wonderful, but I’d like to give special recognition to Jenn, who consistently goes above and beyond. She genuinely cares about her patients, and you can feel her dedication in every interaction. Kim is also fantastic and provides top-notch care. However, I do have one concern: the recent installation of a check-in kiosk. This change feels impersonal and detached, taking away a key part of the experience—interacting with the staff members we’ve known and trusted for years. While the staff is no longer allowed to check you in unless there’s an issue with the kiosk, it feels like a step backward in patient care. I wish I could speak to the person who thought this was a good idea. If this trend continues, I worry that soon we’ll be talking to machines instead of the compassionate professionals who make this practice special. Please don’t overlook the incredible team here. They are the heart of Shoreham Medical, and their commitment to their patients is something that technology simply can’t replace. more"
    },
    {
      "user": "Modesta Toribii",
      "date": "02/25/2023",
      "title": "Emergency room",
      "review": "My question is how is it possible that I will take my girl to the emergency room on Wednesday the 15th with a fever of 102 and pain in her body? The girl was diagnosed with a urine infection and influenza, they sent me home with antibiotics, but the The girl continued with a fever between 103 —-105 on Saturday I returned her to the emergency room with a high fever and a swollen side of the face, I explained to the doctor that I felt that something was wrong with the girl's body, especially in her mouth, which looked infected They told me that her mouth looked fine and that the infection with the antibiotic would disappear, in the emergency room the girl had a fever of 103.5 and they still sent me home. On Monday I called the emergency because the girl continued with a fever of 105 even taking two antibiotics and they told me that a nurse would call me back and that never happened. On Tuesday morning I brought her to her pediatrician and she drew blood and did the tests which came out abnormal and at night the girl's tooth fell out and she almost choked on it. On Wednesday I brought Amelia to the dentist and they brought me to the emergency room at Bellevue hospital for surgery and here we have 4 days and we don't know when we're going home. This situation could have been avoided and I hope it doesn't happen to another Child. more"
    },
    {
      "user": "gtgyngr",
      "date": "06/29/2022",
      "title": "Best hospital app that helps me keep my husband alive! Ty 🙏",
      "review": "For the last two years this app has been used continually by me to coordinate my husbands many many doctors appointments and monitor test results. It’s super easy learning to use on-the-fly and even allows you to communicate directly with your doctors!!! It also enables connection to other hospitals running on EPIC, (which clearly allows U/X personalization -meaning other hospitals can design their app differently so when you look for information it won’t be laid out the same) which is great for coordinating care and enabling multiple providers across health systems to share test results, and to read notes from other doctor visits, enabling greater continuity of patient care. Having had my husband in multiple hospitals, over a recent two-year period, can confidently say this is by far the best use of the customization functionality. Well well done and THANK YOU - this app helps me keep my husband alive!! more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "Apple Vision"
  ],
  "size": "131.5 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English, Spanish"
}