{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Full Code Medical Simulation 17+",
  "subtitle": "Doctor, nurse & EMT education",
  "seller": "Full Code Medical Inc.",
  "stars": "4.8",
  "rating": "4.8K Ratings",
  "price": "Free",
  "appDescription": "Want to learn more about medicine? Practice treating virtual patients while earning CME credit with Full Code. Full Code is an intuitive, mobile-first simulation designed by medical experts, with over 200 realistic virtual cases and an engaging, gamelike interface. Choose from hundreds of possible actions in each case as you diagnose and treat acutely sick patients in this open-ended simulation. Whether you need to get through your first year of medical school, prepare for residency, or simply learn something new, Full Code can deliver the practice you need today to become a better medical professional in the future. With our AI-powered tutor, you can learn step-by-step how to diagnose and treat patients. Play a Full Code case to try it out today. Features: • 200+ cases written & peer-reviewed by expert clinician educators • Over 30 diagnostic categories, focused on Emergency Medicine • Generative AI-powered patient conversations and tutor • Guided case walkthroughs • 4 realistic, immersive 3D environments • 23 diverse patient avatars, including pediatric and adult patients • Full score and debrief for each case • Created by doctors, for medical students and professionals PRACTICE MEDICAL SIMULATION ON THE GO Full Code’s on-demand simulation training with realistic virtual patients allows busy learners and medical professionals to practice complex cases and improve their skills whenever they get a break, wherever they happen to be, on the devices they already own. LEVERAGE AI FOR LEARNING Now when you play Full Code, you’re never on your own. Our new AI Tutor can now provide step-by-step guidance and feedback through each case, allowing you to learn as you go. LEARN FROM TOP PHYSICIANS Created by medical educators from some of the top hospitals in the U.S. and peer-reviewed by licensed medical professionals, our simulations are designed in accordance with industry-standard medical best practices, setting the bar high for our learners worldwide. IMPROVE YOUR CONFIDENCE Full Code's infinitely repeatable cases measure skills in both diagnosis and management, allowing students and medical professionals to learn from their mistakes in a risk-free environment, so they can face complex real world cases without fear. EARN CME CREDIT Complete your continuing medical education (CME) requirements with flexible and enjoyable simulation challenges accredited through the ACCME. With our PRO+CME subscription, you can earn up to 100 CME credits. Subscribe to Full Code Pro+CME today to get started. FEATURED APP STORE REVIEWS Fun and Educational “I’m in nursing school and my partner is in medical school. We play for fun and it teaches a lot, certainly makes you think more and how not to order everything under the sun. Highly recommend!” —Kirsten9008 Awesome app! “Pre-med student and ER tech here! Love this app, it helps to understand ed meds, tests, and thought processes. Awesome!” —morontesthater123 Exactly what EM needed “Happened to stumble upon the app when I was looking for virtual EM sim learning. It’s exactly what I was looking for. It’s well developed and thought out with pertinent information. Thank you!” — ariamour Best Game/Educational tool I have ever had “I’m obsessed with learning anything and everything I can about medicine. I would love to work in the medical field, and this is helping to show me how the actual dream job really is, what standards they have, and gives me the biggest dopamine rush when I get at least 80%...I hope using this app could prepare me for some job that feeds my passion.” — Lazy Puggle Worth every penny! “For those looking for a simple but entertaining way to study and prepare for clerkships, think through cases in residency, or even prepare for your oral boards, I think Full Code is the learning tool for you…Thank you, Full Code, for being a long-time study partner! Looking forward to your continued dedication to medical education!” — Hartridge more",
  "reviews": [
    {
      "user": "Lazy Puggle",
      "date": "03/08/2024",
      "title": "Best Game/ Educational tool I have ever had",
      "review": "I’m obsessed with learning anything and everything I can about medicine. I would love to work in the medical field and this is helping to show me how the actual dream job really is, what standards they have, and gives me the biggest dopamine rush when I get at least 80%. I never went to even high school, so it rocks that I’m so great with medicine. I mean, 80 %, I’m 28, kept locked in in school suspension my entire childhood and just sometimes really think it’s awesome I can jump into these things and pick them up so easy. My fiancé had Fourniers Gangrene and when they went to show me how I would be packing her wounds, I blew their socks right off. First try. I hope using this app it could prepare me for some job that feeds my passion. 80% Doesn’t seem much but Considering I’ve never even been past grade 9… gives me hope. more"
    },
    {
      "user": "jack981708",
      "date": "08/09/2023",
      "title": "Good practice for professionals",
      "review": "Have gone through about 12 cases so far. I was expecting all of them to be “worst case scenario” situations but was surprised at how varied the cases are. From a ER nurses point of view it’s a fresh way to flex your knowledge and think beyond your scope. You have to assess the patient, consider appropriate lab work, imaging, and choose the right interventions, and of course reassess. A diagnosis must be made for every patient with a decision to admit to the appropriate floor or discharge with or without outpatient follow-up. Vital signs are real-time, and you have to really think on your feet for the critical scenarios to get the patient stabilized. Every case has a full discussion at the end which details exactly what should have been done. All-in-all I think it is a valuable tool, and rather enjoyable! more"
    },
    {
      "user": "PhillyDubbaU",
      "date": "06/06/2024",
      "title": "Great sim - but here’s a suggestion",
      "review": "This sim is a fantastic tool for current providers, providers in training, and even people interested in medicine. My only suggestion would be adding an ambulance setting for prehospital cases. It would be very beneficial to current EMTs and paramedics - as well as those in class - being able to use it on shift or at home to keep up with their knowledge in a setting familiar to them. This is the first time I’ve ever suggested something on the App Store, so I want to back this up by saying that I know implementing a feature like this can be expensive in time, skill, and money. But I could see a good chance that you will get back whatever you put into it. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "107.1 MB",
  "category": "Medical",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English"
}