{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Miiskin Skin & Dermatology 12+",
  "subtitle": "eVisits | Track Moles & Acne",
  "seller": "Miiskin",
  "stars": "4.4",
  "rating": "1.2K Ratings",
  "price": "Free",
  "appDescription": "CONSULTATIONS WITH ONLINE DERMATOLOGISTS * World’s leading dermatology app for tracking skin changes, moles, skin care and telehealth in dermatology. * Dermatologically Endorsed by the Skin Health Alliance * App Store App of the Day on World Cancer Day * Recommended by doctors to their patients in over 130 clinics/hospitals worldwide * Mentioned by Forbes, USAToday, CNET, Lifehacker, Digital Health News, MobiHealthNews and many more. MIISKIN APP FEATURES Some app features are exclusively part of Miiskin Premium or Premium Light and consultations with dermatologists requires payment. * TELEHEALTH CONSULTATION with a dermatologist. Find a dermatologist licensed in your state and start a consultation. Get a treatment plan and prescription, if appropriate, within two business days. * PHOTOS AND TELEHEALTH with anyone you like. Ask your doctor and healthcare provider about your usage of the app and if they can receive photos for telehealth consultations or triage. Always follow your doctor’s instructions. * CLOSE-UP PHOTOGRAPHY used for tracking changes in single moles and other local areas on the skin. Miiskin has carefully calibrated the camera for the best possible close-up photography. Log the location on a body chart / map. * IN-APP COMPARISON allows you to get a SIDE-BY-SIDE VIEW of your photos so you can more easily compare them for changes over time. * AUTOMATIC SKIN IMAGING using computer vision and augmented reality technology makes the app capable of taking FULL-BODY IMAGES of you. All you need to do is to place the phone upright on a table with the camera facing the room and it does the rest. Currently available for iPhone XR, XS, 11, 11Pro and SE 2020. * MOLE SIZING helps you measure your moles and lesions over time. Simply add a coin into your close-up photos. * FACE TRACKING lets you take selfies from multiple-angles in seconds to track e.g. acne or skincare results * WEB COMPARE allows you to access your Miiskin App photos in the browser on any tablet or computer with a SIDE-BY-SIDE VIEW. Very useful for you to compare your full-body images for any changes on a larger screen. * SECURITY AND PRIVACY is a big priority for us. Miiskin separates your photos from your normal camera roll and encrypts them so no other apps can access them. You can protect them even more with a PIN-code or your Face/Touch ID and BLUR OUT areas of your full-body photos that you wish to stay private even if you share your photos. MIISKIN DOES NOT PROVIDE A DIAGNOSIS The app does not diagnose your moles or evaluate the risk of melanoma, skin cancer or any other conditions. The app assists you with tracking skin and moles over time with a photo diary. We do not think that with today’s technology, and the present quality of smartphone images, that it is possible to provide AI diagnoses of melanoma or skin cancer risk. If you find a mole or mark that looks concerning you should always consult a certified doctor. THE VISION OF MIISKIN Miiskin’s vision is to help you keep track of skin changes and increase access to dermatology care in the most user-friendly way possible. MIISKIN PREMIUM Payment will be charged to iTunes Account at confirmation of purchase. The subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period. Your account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal. Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase. Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable. TERMS OF SERVICE https://miiskin.com/terms MIISKIN SUPPORT If you need any help or assistance with the app or your subscription, do not hesitate to contact Miiskin on support@miiskin.com. more",
  "reviews": [
    {
      "user": "Home Coach",
      "date": "01/11/2023",
      "title": "Upload photo option missing\n\n    Developer Response",
      "review": "Wish we could add photo of medical cards from our photos on our phone. more Hi Thank you for writing in with your review. With a premium subscription it is possible to upload photos from your Photos app on your iPhone. On the in-app camera, simply choose the import icon on the top of the screen instead of taking the photo directly with the app. If you have any questions about this or anything else, please don't hesitate to write to Miiskin Support on support@miiskin.com. Kind regards Daniel T. Miiskin Support more"
    },
    {
      "user": "FrankP1121",
      "date": "08/18/2021",
      "title": "Add a tick check option?",
      "review": "We have a big issue with ticks in the northeast and one problem is that we have to do daily self checks. Your app would be great in full body scan to quickly determine if a new dark spot is a mole or a tick. Can you add that possibly? more"
    },
    {
      "user": "Rvanauke",
      "date": "08/19/2020",
      "title": "Front camera would help\n\n    Developer Response",
      "review": "I like this a lot, but it’s difficult to take photos with just my back camera. I wish it allowed me to use the forward (selfie) camera because my photos would be more consistent. Plus, it would be easier to photograph rather than retaking because the angle is bad or there’s a shadow. more Hi Updating the response to let you know that the app now supports the selfie/front camera. Hope you will find it useful! Kind regards, Daniel T. Miiskin Support more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch"
  ],
  "size": "228.4 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English"
}