{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "VA Video Connect 4+",
  "subtitle": "",
  "seller": "US Department of Veterans Affairs (VA)",
  "stars": "3.1",
  "rating": "887 Ratings",
  "price": "Free",
  "appDescription": "Requires camera – does not support Apple Watch. The VA Video Connect (VVC) application provides video conference services to connect Veteran patients with their VA medical providers in multiple platforms. The VVC iOS version enables Veterans and their VA healthcare provider to participate in a virtual medical appointment using Apple mobile devices (iPhone, iPad).",
  "reviews": [
    {
      "user": "sandimacd",
      "date": "03/23/2021",
      "title": "Needs tutorial",
      "review": "Today was first time using it. My provider kept saying he was putting things in the chat. But there wasn't a chat window. After awhile I noticed a red circle with the number changed from 1 to 2 to 3 and recognized the number changed everytime he told me he was putting something in the chat. So I tapped the number and a skinny side window opened with words all scrunched up making them illegible. Then when the meeting ended, nothing. Just a blank window. No way to get to the information he had typed. It disappeared. The connection was fine, the audio and video worked well. It would be so very helpful if there was a tuturial explaining what the icons mean and how to get the typed chat links and info over to where I can store them outside of the meeting so I can use them. more"
    },
    {
      "user": "Tonia S. Bailey",
      "date": "11/04/2020",
      "title": "Quit whining",
      "review": "I think the VA has done an excellent job with this app. I use it on my iPad with WiFi and have had absolutely no problems at all. I did have an issue where the Doctor could not hear me so she left video on and called on the phone. After my appointment was over I realized that my volume on my iPad was all the way down. That was operator error, not a problem with the app. It is a safe and secure way to have a face to face with any doctor at the va. Is positioning of a camera that serious? I think that with everything that is going on in the world today that it is amazing how we as a “people” have adapted. At least I can see the people I am talking to. There is absolutely nothing wrong with this app. Absolute Kudos to the developers and again, thank you for sour service and or support. more"
    },
    {
      "user": "Corey T Miller",
      "date": "09/23/2022",
      "title": "It’s unreliable",
      "review": "This app and VA video connect process has been nothing but problems. Did all the process the test my connection before the meeting and it worked no problem. Even had a VA employee reach out to me to test a video call with her and had problems connecting but we got there in the end. On the morning of my appointment that I had waited 3 weeks for I attempted to connect to the call via the appointment link they sent to my email. I even tried to connect to the call 15 mins early just to make sure there we no problems. I tried 6 different times to use the link just to be meet by a grey screen. Processed to try and call the VA hospital mental health office to try and resolve the issues and get further instructions were I was greeted by voicemail on three different attempts. I just wanted to get some help but it doesn’t look like that is going to happen. Again thanks for nothing VA. I can only imagine how many other people slip through the cracks as well. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Apple Vision"
  ],
  "size": "90 MB",
  "category": "Medical",
  "ageRating": "4+",
  "languages": "English"
}