{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Buku Medicine 17+",
  "subtitle": "",
  "seller": "Buku Tech Limited",
  "stars": "5.0",
  "rating": "1 Rating",
  "price": "Free",
  "appDescription": "Buku Medicine was created initially as Buku Haematology, written by a haematology registrar and consultant as an easy and quick reference for the initial investigation and management of common haematology problems. 'Buku' is the Chichewa word for book or reference. Chichewa is spoken in Malawi where our pathology project MPathE is running. We made it to answer the commonest questions that haematologists are asked, and through that, improve patient care, educate our users and hopefully remove some of the fear usually associated with haematology. It is for all grades of generalist and specialist doctors, specialist nurses, physician assistants and has links to key references and guidelines. Data collected from users shows that it can prevent a call to haematology completely for 21% of clinical queries, and start further investigations to expedite care for up to 60% more. This reduces the on-call burden on haematologists and improves patient care by improving clinician efficiency. See our website for testimonials of how it has helped users. This model has been really well received and continues to grow (over 22,000 active users, installed on clinician devices in two NHS trusts and ORCHA approved). We have now started to apply this model to other specialties and have added Renal, Endocrinology, Hepatology and Rheumatology content to the App. We will continue to expand this to other specialties over the coming months. The information included is concise to make it easy to use, and further reading should be undertaken to gain a full understanding of the topics covered. Common causes are listed by frequency from general medical literature and our clinical experience. Please consider taking a couple of minutes to give as little as £1 as a thank you for our time contribution (>400 hours) and to keep the app running. Thanks, Alex, Steve and the Buku Medicine Team Disclaimer: This app has been prepared by Buku Medicine Limited to provide guidance and assistance to healthcare practitioners but does not constitute medical advice. Its content is general in nature, may not reflect all recent clinical developments and guidelines and may not apply to the specific facts or circumstances of a particular case and should therefore be used in conjunction with clinical judgement and local medical specialist advice if required. While this app does provide accurate and useful information, Buku Medicine Limited makes no warranty, express or implied, with regard to the accuracy, omissions and usefulness of the information the app contains. Buku Medicine Limited does not accept any responsibility in contract, tort (including negligence), breach of statutory duty or otherwise arising under or connection with this note for (i) use of this app or (ii) any action taken as a result of the information provided in it or (iii) subsequent damages resulting from the use of the information provided. Nothing in this disclaimer notice limits any liability which cannot legally be limited. For those with an interest in haematology follow @teamhaem on twitter for clinical cases and educational resources. Governance - Our content is written by registrars in their respective fields. Per specialty, there are 2-3 registrars to write content, and a consultant to review that content. This is monitored through a database of active modules, with review dates set for each module. Modules are reviewed every 6 months. Content is general information as would be expected knowledge of a registrar in the specialty. No content is taken into the App from patients, and therefore Buku Medicine is not a medical device as per the MHRA definition. Privacy policy available on our Content website- click on this link https://bukuhaem.appyourself.net/website/ and the policy is at the bottom right of the page. Copyright Buku Tech Limited 2021 @bukuhaematology, @bukurenal, @bukuendo info@bukumedicine.co.uk www.bukumedicine.co.uk more",
  "reviews": [],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Apple Vision"
  ],
  "size": "15.5 MB",
  "category": "Medical",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English"
}