{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "BetterMe: Health Coaching 12+",
  "subtitle": "Pilates, Calisthenics, Somatic",
  "seller": "BetterMe Limited",
  "stars": "4.7",
  "rating": "622.4K Ratings",
  "price": "Free",
  "appDescription": "Personalized workout and nutrition plans supported by real human coaches, comprehensive progress tracking, and cognitive therapy practice-based tips. FIVE REASONS TO INSTALL BetterMe: 1. Customized wholesome approach to weight loss and weight gain We adjust to your busy schedule, preferences and lifestyle to achieve fast results without harming your health 2. Workouts for any level Whether you’re a beginner or a pro, we’ve got you covered with a variety of exercise sets for at-home or at-the-gym sessions, with zero equipment or a full gym. Even if you’ve never tried to work out in your life, our simple and clear instructions will help prevent injuries and get you accustomed with a fitness world in record time 3. Varied disciplines from cardio to yoga Everyone can find something they like, whether it’s to get your blood pumping or wind down after a long day. 4. Easy-to-follow meal plans Nutrition plans created by certified experts to boost your progress with options like intermittent fasting, keto, vegan, and many more 5. Support by certified coaches in chat Shoot our coaches a message if you are unsure about what to do, need motivation or just want someone to talk to! We’re online and are happy to help. App provides you with: - Workout Programs: personalized sets of exercises and nutrition to help you get in shape faster - All-new meal plans: dishes picked according to your preferences, and are easy to make thanks to video recipes - Calorie Tracker: know exactly how much you consume a day and monitor your macros all with an intuitive design - New community with daily articles, tips, tricks, and answers to all the FAQs - Personal coach feature so you are always professionally guided and supported through your weight loss journey - Water tracker and step counter to make sure that you're reaching your daily goals - Yoga, running and walking workouts for everyone! BetterMe offers varied workouts, easy-to-follow meal plans, and useful tips for everyone! There is no need to go to the gym; over 800 of our workouts can be done at home - with our vast library of exercises, everyone will find something to float their boat: from prenatal yoga to guided interval running, get ready to meet your new favorite way to get in shape fast! Getting in shape has a lot to do with nutrition, and we've carefully hand-picked hundreds of recipes for every taste, cooking time, and budget. Quickly find your new favorite keto breakfast, vegan snack, low-calorie dinner and much more. Want to eat healthy, but following recipes is not always convenient? Worry not! Use Calorie Tracker to add any food item to your daily diary and track your progress even more accurately! BetterMe app is also integrated with Health Kit, so that you can track your steps inside the actual app as well as log your water and calorie intake. You can see your workout and meal schedule on the main screen and set workout notifications so that we can remind you to work out at a suitable time. We've also added yoga journeys as well as walking and running workouts to make sure that we've covered all your daily activity needs. We offer a wide range of subscription options so that you can choose the right one for you (3 months access renewal, weekly renewal, etc.). For your convenience subscriptions are set to Auto-Renew within the 24-hour period prior to the subscription end date.You can cancel your subscription at any moment in your iTunes account settings, but refunds will not be provided for any unused portion of the terms. Payment will be charged to your iTunes Account at purchase confirmation. Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable. Terms of Use - https://betterme.world/terms Privacy Policy - https://betterme.world/privacy-policy Subscription Terms - https://betterme.world/subscription-terms more",
  "reviews": [
    {
      "user": "The perfect combination",
      "date": "02/13/2021",
      "title": "We Want Change\n\n    Developer Response",
      "review": "I love the app, but it needs a few more features. I would love to have more choices when it comes to the exercises. They have to think about your physical health, age, and weight. Some exercises are just made for people who are fit, young or both. At the beginning the exercises are modified to a beginner, but then they get more challenging. The problem is that after months of exercising when you’re overweight and older, your knees start feeling the pain, so I do recommend they stay on a modified exercise when it comes to putting all the weight on your knees or giving you the option within the app. Also, it’s important to provide two feel good options because it helps you achieve that goal for that day, and also you have an option for those days when your life was crazy busy, active, and full of chaos. Lastly, I have had many problems of it crashing down in the middle of my workout many, many times! This also discourages all the effort we put into a healthier lifestyle. I have even tried it several times, but it constantly crashes down. Also, I can’t even delete and reinstall the app because it might delete all my data. No easy fix for this until now. more Hello! We are always glad to assist our customers and make their experience more pleasant. Please reach us at gethelp@betterme.tips and we will see what we can do for you. Kind regards, Team BetterMe more"
    },
    {
      "user": "Dina444",
      "date": "02/11/2021",
      "title": "Enjoyable, needs a few improvements\n\n    Developer Response",
      "review": "With gyms closed, I decided to look for alternate at home exercises. I am in my late 20s and looking to keep an active and healthy lifestyle. This app has great options. I subscribed and I really enjoy the daily 'do your exercises' that fit directly in what I am looking for. I also like the 'workouts' section if I am looking to work a little more on a specific muscle group. Yet, for me honestly I do feel that the food and dietary section is not useful to me. I am not looking for nutritional advice, im only looking for workout ideas so this to me is not useful. I would advice BetterMe to have a full seperate app just for nutrition and one just for workouts with the possibility of merging data from both apps together if the user wants to. Otherwise, a lot of the data on this is just not useful to some people. I do get the whole concept of being a full plan of food and exercise but thats my experience. Another think I want to point out is the 'do your workouts' section of the Plan page. Some days it recommends walking, other days it recommends a full 25 minute exercise routine -which is exactly what i love about this app and why I subscribed to it. Yet, skme days when i check the 'do your workout' section it says 'today walking' it doesn't make sense. I suggest modifying the Plan page to include under the 'do your workouts' section a 'walking' subsection and an 'exercises' subsection. That way you get to have both new options everyday. more Hello! We appreciate you taking the time to let us know what you’re looking for — most of the improvements we make come from ideas and suggestions like yours. Other customers have also expressed their interest in these features, and we can see why. We're forwarding this information to our development team. Have an awesome day! Kind Regards, Team BetterMe more"
    },
    {
      "user": "Ibara24",
      "date": "06/13/2024",
      "title": "Exploring Still!\n\n    Developer Response",
      "review": "After my first workout, I deleted the app and decided this wasn’t for me. I have EDS Hypermoble type, which to put simply means my joints and connective tissue are not stable. After my first set of exercises, I’d manage to subluxate both my shoulders and my hips, and was bed bound for several hours. There’s a reason I do exercises under supervision, either from my physical therapist, or when I can afford it, a personal trainer who’s fully aware of my condition. However, I brought up trying the app with my physical therapist, and he was very supportive of the idea of trying wall Pilates at home. He had me redownload the app, and after our session went through the individual exercises with me that I’d had trouble with. (side note, BEST PT ever, I am so happy to have found him.) He helped me find ways to modify them so they were safe for me, or on a couple said “that’s not for you, I don’t feel comfortable with you doing that”. Reminded me to always keep in mind slow and controlled, to not try for full extension since that’s when I tend to over-extend. I’ve now done my third workout, and I’m optimistic. While ideally I’d love to lose weight, right now I’m focusing on feeling better, and more in control of my unpredictable body. I’m excited to see that there are so many different types of workouts. My goal for now is 3 times a week. I still have a lot to explore, and see how if effects and hopefully helps me! more Hello! Thanks for sharing your situation openly. We always recommend consulting your physician before starting any new activity or diet. We are glad you adjusted your plan based on your doctor's advice. We believe that you will achieve amazing personal results! Kind Regards, Team BetterMe more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Apple Watch",
    "Apple Vision"
  ],
  "size": "237.7 MB",
  "category": "Health & Fitness",
  "ageRating": "12+\n                Infrequent/Mild Sexual Content and Nudity",
  "languages": "English, Afrikaans, Arabic, Czech, Danish, Dutch, French, German, Hindi, Hungarian, Indonesian, Italian, Japanese, Korean, Polish, Portuguese, Romanian, Russian, Simplified Chinese, Spanish, Swedish, Thai, Traditional Chinese, Turkish, Ukrainian, Vietnamese"
}