{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "WellSky Personal Care 12+",
  "subtitle": "",
  "seller": "ClearCare Online",
  "stars": "4.0",
  "rating": "6.6K Ratings",
  "price": "Free",
  "appDescription": "Minimize the day-to-day burden on caregivers and administrators with the convenient, user-friendly, WellSky Personal Care mobile app (formerly ClearCare Caregiver Go). Users can easily manage schedules, shifts, tasks, and profiles from the convenience of their mobile device. Designed with caregivers and administrators in mind, the WellSky Personal Care app makes delivering quality care — not the paperwork — the priority.",
  "reviews": [
    {
      "user": "deedtrooper",
      "date": "09/24/2024",
      "title": "Great Company App: Needs a few tweaks",
      "review": "Overall, reliable and adaptive tube app system of clocking in and out when working with your own clients. What could be improved is the meter location feature, as a caregiver needs to be “In range” of the client’s home to work providing early. I wish there would be a more accurate meter system that operates as soon as you would log-in without lag. More importantly, this app would be more efficient upon an update feature to detail the client’s care assessment and account page categories for when new caregivers get assigned new clients, there would be a more understood process of how this app operates. Again, this app has greater potential and so far I’m enjoying it. Of course, a greater attention to my two suggestions would definitely benefit the user. more"
    },
    {
      "user": "kk4441111",
      "date": "08/03/2024",
      "title": "Tasks",
      "review": "Can someone please change the way the task list is presented? If I have 23 tasks, they should all be listed and then at the end yes or no. If yes, end of clocking out. If no, then you can comment on whichever tasks you did not do. This thing where I have to click on every task individually EVERY DAY is annoying and time-consuming. Can someone please change this? P.S. most people are saying yes to everything and not even looking at what these tasks say after the first week of doing it. PLEASE CHANGE THIS! Also please make it so I can see the password when putting it in so I don’t have to go back and change the whole thing if one letter or number is wrong. This app is really antiquated and not up to par at all. You should also be able to STAY logged in. If I’m not logging out then I shouldn’t have to keep logging back in daily. The user name and pw should be able to stay there until further notice. Again, another time- consuming unnecessary step that makes everything that much more annoying. Oh and the part where the stupid thing keeps saying you’re “out of range” when your right there in the persons HOUSE! There are so many more things wrong with this app but since I know for a fact that no one reads these then what’s the point of listing them on here? I’m making it my mission to find a way to contact someone who is in charge of this app. Because this thing is probably one of the worst apps I have ever had to deal with. Changes need to be made! more"
    },
    {
      "user": "LittleQueenie81501",
      "date": "09/08/2022",
      "title": "ClearCareGo",
      "review": "For several months I thought this was the best app imaginable. Then reality sunk in, for some reason out of the blue (last few days) if I have the face recognition on for log in, the app won’t log in and keeps throwing me out. The tasks toggles have all but stopped working! You have to almost pound them to get a response or go into each task separately and choose yes or no!! We as caregivers should be able to remove tasks that aren’t used!! Trying to remember each one and or the time to get someone in the office to remove each task is ridiculous, if you know this business you know none of us has that kind of time!! It shouldn’t take 10 minutes to clock out!! That’s time away from clients, personal breaks and driving time!! Personally I stayed booked on the daily so 30 minutes between clients is all I have so you’ve just cut it down to 20 minutes and frankly that’s just plain selfish of you as developers should understand that!! In my opinion you aren’t very respectful of our time!! Try being a caregiver for Alzheimer’s patients just once!! more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Apple Vision"
  ],
  "size": "31.6 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English"
}