{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Providence 12+",
  "subtitle": "With you, wherever you are",
  "seller": "PROVIDENCE HEALTH & SERVICES - WASHINGTON",
  "stars": "4.8",
  "rating": "101.8K Ratings",
  "price": "Free",
  "appDescription": "Want to make it easier to take care of your health? With you, wherever you are. Your one-stop shop for everything Providence—this modern app puts all your Providence services, programs, and resources at your fingertips—24/7, 365 days a year. Whether you need to get care, view your medical records, pay a bill, or learn about new programs & resources relevant to you—the Providence app will ease your way. • Connect with your care team—book an appointment, view instructions, send a message. • Get immediate care—through an ExpressCare virtual visit or one of our local urgent care clinics—even find out wait times and put yourself in the queue before you leave home. • Access your medical record—get lab & test results, read visit notes, share your records. • Find a new provider—whether primary or specialty care. • View and pay bills—or see if you’re eligible for financial assistance. • View important health reminders personalized just for you. • Get individualized recommendations for relevant health programs and resources. • Find relevant, health-related content just for you, created by Providence experts. • Ease your way—find self-serve options or the right Providence resources via our chatbot Grace. If you have a Providence MyChart account, just use your same login and password. If you don’t, it’s easy to create an account right in the app. The Providence app is perfect for everyone looking for health care resources in a Providence or Providence-affiliated healthcare environment. Providence health services are available in Alaska, Washington, Montana, Oregon, California, New Mexico and Texas. more",
  "reviews": [
    {
      "user": "Rick Phelps",
      "date": "11/10/2022",
      "title": "Grateful",
      "review": "I am so grateful for everyone’s help during my surgery’s and care. Words can not explain just how grateful I truly am . The whole surgical team are gifts from the all mighty, this holds true for all the nurses down to the cleaning staff. The care I was given was simply amazing! I came out of surgery with a whole new understanding! I was not a good patient before my accident. The the understanding I received was knowing my responsibility as a patient! Sound strange maybe however it’s my truth and I felt the results. I opened my heart and understanding of what these professionals go through to care for their patients that alone was enough to share what they felt. My message is more for patients please show your respect try and understand just how hard they work to get us better. They are your team and they care show them this and they will take it from there. You will get amazing results. Try and understand when the can’t respond it’s not because they don’t care because they do we are not there only patient. When I opened my heart and understanding I was blessed ten times over. The pain I was having seem to be more manageable. Dr. Su and his staff are gifts from God. Thank you so much Rick Phelps more"
    },
    {
      "user": "DanVallish",
      "date": "09/01/2024",
      "title": "My Experience Following Extensive Back Surgery",
      "review": "I had been experiencing severe and chronic back pain. I am 68 years old and have been told that it comes with age and the moderate arthritis. Working with the medical team from Coastal Health, I received restorative back surgery with hopes of restoring my normal life and activities. After initially meeting with Dr Waller I was scheduled for surgery a short time later. Part of the intake process included agreeing to allow a robotic equipment to be used. It is currently 9 days after my surgery and I’m actually feeling better! A great deal of care was taken to reduce the likelihood of infection. Interestingly enough, the resulting cuts were small and included two small puncture wounds that I assumed was used in conjunction with the robotic, mechanical surgeon. I am up and about with minimal discomfort and I’m using only a small amount of pain relief medication! I plan to continue this journaling as things continue to unfold. more"
    },
    {
      "user": "Reme liosa",
      "date": "10/02/2024",
      "title": "Swedish orthopedic institute patient",
      "review": "Recently visited both the emergency department and orthopedic institute at Swedish Hospital where I stayed for a few days . From the moment I arrived to the emergency department, I was impressed by professional staff being attentive,taking the time to listen to my concerns and provide me timely assistance,their compassion and expertise were evident,making stressful situations making more manageable . After my visit to the emergency department ,I transitioned to the orthopedic institute ,where I received further specialized care .the orthopedic team was outstanding ,demonstrating a deep knowledge of their field while also prioritizing my health. I recommend Swedish Hospital to anyone in need of medical assistance. Thank you to the entire team for your great service. Laura Linares more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch",
    "Apple Vision"
  ],
  "size": "199.8 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English, Arabic, Danish, Dutch, Finnish, French, German, Norwegian Bokmål, Spanish, Swedish"
}