{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Complete Anatomy for iPhone 12+",
  "subtitle": "3D Human Body Atlas & Courses",
  "seller": "3D4Medical from Elsevier",
  "stars": "4.6",
  "rating": "3.6K Ratings",
  "price": "Free",
  "appDescription": "***THE WORLD’S LEADING 3D ANATOMY PLATFORM! TRY IT FOR FREE TODAY*** COMPLETE ANATOMY: A 3D ANATOMY JOURNEY POWERFULLY TAILORED TO YOU A flexible, inclusive and personalized learning platform that uses the visual power of incredibly detailed 3D models to make anatomy easier to understand. FREE DOWNLOAD: Create an account for a FREE 3-day trial of premium features and content. Access Complete Anatomy from ALL your compatible devices with a single annual subscription. Experience the BEST anatomy platform available today: THE MOST DETAILED AND COMPLETE human anatomy models, with thousands of individual interactive structures, including a living, beating, dissectible human heart in full 3D UNIQUE MODEL CUSTOMISATION allowing you to personalise your anatomy model based on your preferences Atlas of over 700 Screens, based on illustrations from Elsevier's foremost anatomy textbooks Complete courses, including Female Anatomy presented by Alice Roberts, Dissection courses, Human Anatomy, Point of Care Ultrasound, Clinical Correlates & many more Dynamic Cross-sections, real-time Muscle Motion, Insertion & Origin mapping, Bone Surface & Landmark mapping, 12 layered systems, Nerve Tracer, Blood Supply Tracer 39 stunning Microscopic anatomy models AR mode including multiuser AR on compatible devices Over 1,500 clinical videos on Cardiology, Orthopedics, Ophthalmology, Dentistry & Fitness English, French, German, Spanish and Chinese language support. TO BE THE BEST, USE THE BEST: Complete Anatomy is recognised as the best by the world's leading colleges & anatomists. “Complete Anatomy has a wider depth and breadth of offerings than other anatomy platforms currently available (e.g. Primal Pictures, Visible Body) as well as more detail in its models. Other anatomy apps do not offer the ability to share content and have fewer tools with which to dissect and label models”. - The Journal of the Medical Library Association “Complete Anatomy is a lifesaver for me. It's helped me pass all my exams, I have it on all my devices and the accuracy is amazing. I love it!” - Amy Morgan, Medical Student, Trinity College Dublin “I would definitely recommend this platform for any institution teaching anatomy” - Jorgen Olsen, Educator, University of Copenhagen “I wouldn't be able to deliver my teaching without Complete Anatomy, especially now that most of the teaching is expected to be online” - Munesh Khamuani, Educator, University of Birmingham STUDENT LICENSE includes: • Access to 3D models across all available platforms • Access to all Courses • Access to over 1,500 videos • Access to the vast library of curated learning material PRO LICENSE: all the benefits of the Student License PLUS: • A license to use in clinical practice for patient education • A license to present/teach in the classroom, lab or lecture theatre Subscriptions are charged annually & automatically renew unless auto-renew is turned off at least 24-hours before end of the current period. Payment will be charged to iTunes Account at confirmation of purchase. Your iTunes Account will be charged the current annual subscription cost each year for renewal within 24-hours prior to end of current period. You can manage your subscriptions and turn off auto-renewal by going to your iTunes Account Settings any time after purchase. Any free trial will be interrupted when a paid subscription is purchased. Terms: https://3d4medical.com/terms Privacy policy: https://3d4medical.com/privacy-policy Please contact Customer Support at info@3D4Medical.com with any account/purchase queries before reviewing, we're happy to help! more",
  "reviews": [
    {
      "user": "musica0202",
      "date": "10/10/2022",
      "title": "Best App to ever exist in the history of ever\n\n    Developer Response",
      "review": "This is an amazing app! I paid $37 for the student version and it is perfect. I am lucky to be in a class where we have cadavers but I can’t always go to open lab. So this very useful for visualizing the ligaments and muscles. I love the search feature and being able to add muscles one at a time to the skeleton. I also like that you can hide certain muscles to see those that are deep. The AR feature is great for sketching and the lectures are helpful as well. If you’re in an online anatomy class especially or without access to cadavers this is your best friend and absolutely worth the price. My only critique is that I would love to be able to save certain skeletons that I build. For example after I add all the muscles that move the pectoral girdle to the skeleton I would love to be able to save it to come back to later. And be able to make “playlists” of all my saved models so that they’re easy to find. It’s possible I just haven’t figured this out yet too, still learning the app a little bit. more Hello, Ahmed Ammar. Thank you for taking the time leaving us with a 5-star review. We will forward your suggestion to our Development for further review. Please contact our Support Team via https://service.elsevier.com/app/contact/ if you need assistance. Thank you. - (MO), 3D4Medical from Elsevier more"
    },
    {
      "user": "DMS Student",
      "date": "08/24/2020",
      "title": "Keeps Crashing\n\n    Developer Response",
      "review": "I’ve never paid for an app before but I’m in school to become a Registered Diagnostic Sonographer and I needed something a bit more in-depth, yet, basically “dummy proof” in explaining blood vessel connections and course. If it can help all of these med students then surely it could help me. I wasn’t expecting this app to do that and so much more. Honestly the best $37 ever spent. I don’t feel like I’m memorizing things either; when I gain an understanding of something then it sticks in my head so much better. With my textbooks and class lectures, I’ve just been flash carding everything in my head because alot of the information feels like disjointed information. With this app I feel like relevances has been introduced for the first time. I gave it three stars for one reason only: it keeps crashing. Again, I’m in school for sonography so being able to locate organs from the transverse view is important. I select the cross-section option in order to see the body habitus transversely and the app closes out completely every time. It worked at first - I only discovered the cross-sectional view this morning but now at 5:30 in the evening it no longer works. An incredible bummer because this app is actually the only reason I now understand what my textbooks have been showing me from that specific view. I honestly don’t need to make full use of all of the apps capabilities; the few things I do use it for are now only 50% operative. Please fix the crashing 🙏🏼 more Hello and thank you for your review as well as your in-depth feedback. This sounds like it could be a corrupted download. Please reinstall the app from the App Store. That should solve your problem. If the issue persists however, please contact our Support team directly. https://3d4medical.com/contact. Thank you. -3D4Medical more"
    },
    {
      "user": "AJlovesjesus",
      "date": "09/10/2021",
      "title": "The Best Anatomy App!\n\n    Developer Response",
      "review": "This really is the most comprehensive Anatomy App today. Not only does it include every structure, but it also shows all the forms of movement for every muscle, insertion and origin points and even full courses from experts. That said, the developers need to improve their female Anatomy represetation. Right now you can only see female torso and pelvis. The entire female structure is different than the male, would be great to incide both. Additionally they need to include different skin color options, because diseases present differently on different skin tones. And it's just more inclusive. Make those changes and it would be perfect. Edit: They responded to my question and will have the full female anatomy represented in Winter 2021! Once again the BEST anatomy app. The remaining change for them to make is to add various skin tones to understand how disease presents differently. I'm sure that'll be a quick & easy addition. Thanks developer team! more Hello, thank you for your feedback. We are very much concerned about the lack of a full female model. That is why we have developed the most accurate, most detailed female pelvis and female thorax on the market. We are striving to generate a true representation of the female anatomy and not merely a feminized version of the male anatomy as is currently most common in the 3D anatomy market. We hope to release a full female model in the Winter of 2021. Thank you. - 3D4Medical. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch"
  ],
  "size": "1.5 GB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English, French, German, Simplified Chinese, Spanish"
}