{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "My Invisalign 12+",
  "subtitle": "Designed to move you forward",
  "seller": "Align Technology, Inc.",
  "stars": "4.8",
  "rating": "58.2K Ratings",
  "price": "Free",
  "appDescription": "Looking to transform your smile with the most advanced clear aligner in the world? Already in treatment and need support? The My Invisalign app is a one-stop-shop that helps deliver healthy, beautiful smiles. Interested in Invisalign® treatment? • See how much your insurance may cover your Invisalign treatment • Learn all about Invisalign clear aligners and what they can do for you. • Simulate your new smile with our SmileView™ simulation tool and share your results with friends and family. • Find a doctor near you and request a consultation. Your personal smile concierge representative will reach out to get your appointment scheduled and be there for you every step of the way. Already an Invisalign patient? • Connect your watch to your phone to access the custom aligner tracker in the My Invisalign watch app. • Refer a friend and get a $100 gift card when your friend signs up for treatment! • View the ClinCheck® treatment plan shared by your doctor. This feature is available by doctor's invitation only. • Stay on track with your new smile by using Invisalign®Virtual Care by sharing photos and receiving feedback from your doctor - available by doctor's invitation only. • Monitor your wear-time progress with weekly, monthly, and yearly views. • Personalize your treatment calendar to keep track of your appointments and other events! • Track your daily and historical aligner-wear time with a custom timer. • Receive reminders and notifications when it’s time to change your aligners. • View and share your progress video and before & after photos with friends and family. • Provide rating and feedback on your experience with the app. For more information on Invisalign clear aligners, visit us at www.Invisalign.com. more",
  "reviews": [
    {
      "user": "es bus dad",
      "date": "10/19/2022",
      "title": "I need another option\n\n    Developer Response",
      "review": "This app is awesome and i use all the time but i need another option. I'm trying to say i need an option that will inform the device that i won’t change my invisalign tray to the next one for a reason. Right now i am having problems with my teeth, so my orthodontist had to adjust one of my invisalign trays and now i can change until a certain date. It would also be helpful if they changed hot the invisalign on and off clock worked. Wouldn’t it be easier if you could just press a button that tells the app your taking it off and when it is more than a certain time off it reminds you to put it back on. Also can it reset, instead of saying you have had if off for 15 total hours since you started just reset and show like a chart of how many hours you have taken it off for each day. Otherwise this app is great, it helps me with everything and i really appreciate the effort pur into this. more We appreciate your feedback and ideas on how the app could be better for you. We're providing your feedback to our developers. more"
    },
    {
      "user": "A1Skyler",
      "date": "08/15/2021",
      "title": "Counter clock\n\n    Developer Response",
      "review": "I wish the counter clock really would work. Just to count the long time in and the few minutes out and track my time. Also I wish it would time the trays inside the bobble wash, I always worry on under doing the time and afraid of over doing it, don’t want to wash them. Also would like to have a way to take a pic of my teeth inside of my mouth. Then I can see the teeth are moving. I would like to have a comparison on the pictures to see how many shades my teeth had turned after brushing my teeth so many times more per day. My other wish add on the app a section Called “ News of my mouth” ( lol) like a diary where I can write all the notable changes I had seen since I started to wear my trays. ( less headaches, losing weight, less night snoring etc). I really think that your app can improve. Also if I could take a profile pic. Can you measure how my jaw it’s moving and I m losing my double chin? Would be nice if I can have that in my app log. And pictures. Last, I would love to have the information send to my dentist, so she can read my progress when she’s eating her lunch or just checking the pictures of my daily teeth report, so she can be on the loop. She would be trill if she can check her patients without me a having to make an appointment with her. Lastly if the app can take a pic of my trays and later on review them and see that They are no damage, that is would be fantastic! Wow the ways you could improve this App. Thank you! more Thanks for sharing with us your wishlist for the app! We're providing your feedback to our developers. more"
    },
    {
      "user": "melbelle007",
      "date": "10/05/2021",
      "title": "Purposefully making “compliant” wear time no less than 22 hours\n\n    Developer Response",
      "review": "My doctor AND Invisalign corporate recommend aligners be worn 20-22 hours per day to be compliant. Yet, your app’s user is only deemed compliant with nothing less than 22 hours of wear. Why have you taken it upon yourselves to disregard two hours of the day the manufacturer and board certified orthodontists direct as compliant? Not only have you sent this message to patients, but you go further to not allow any manual adjustment or override of your incorrect definition of compliant hours. It’s easy on the coding end to let users have a choice of hours per day to set as compliant in consultation with their doctor. Your app is designed to interact with the patient’s doctor’s office. So if you can’t offer the designation of 20 hours, how is this really helpful for an orthodontist or their staff to quickly glance at a patient’s history through this app and all they see is a non-compliant when in fact the patient has worn the aligners for 20 hours or more? Don’t you think they are frustrated and feel it’s not purposeful for them? Do you understand how demotivating it is for the user/patient to see that their non-compliant status every day for weeks/months when they have been within 20 to 22 hours? You are doing this on purpose, why I’m not sure. But you are taking the user’s joy and support by not using the professional guidelines. more Thanks for sharing with us how the app could be better for you. We're providing your feedback to our developers. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch",
    "Mac",
    "Apple Watch",
    "Apple Vision"
  ],
  "size": "296.1 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English, Arabic, Catalan, Czech, Dutch, French, German, Italian, Japanese, Korean, Polish, Portuguese, Simplified Chinese, Spanish, Thai, Traditional Chinese, Turkish, Vietnamese"
}