{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Curable 17+",
  "subtitle": "Chronic Pain Relief",
  "seller": "Curable Inc.",
  "stars": "4.5",
  "rating": "1.3K Ratings",
  "price": "Free",
  "appDescription": "Tried it all, but the pain remains? Let the Curable app show you a (very) different path forward. Get started on your Curable journey for free by chatting with our virtual coach, who will design a custom program tailored to your symptoms and preferences. During your journey, you’ll learn about the latest pain science through bite-sized audio lessons, then apply what you’ve learned using 100+ science-backed exercises for relief. Your pain experience is unique, and your recovery program should be, too. Depending on your needs, Curable can help you to overcome fear of movement, reduce health anxiety, relax the nervous system, navigate flare-ups, and more. Hundreds of thousands of people in pain have used Curable to help them transform their relationship to back pain, migraine, shoulder pain, neck pain, knee pain, arthritis, fibromyalgia, trigeminal neuralgia, post-surgical pain, ME/CFS, sciatica, tinnitus, and more. Curable is not a tool to monitor your symptoms - it’s a tool to help you transform them. 69% of Curable users begin to experience physical symptom reduction in the first 30 days of use. We hope that you will be next! - *Source: Devan H, Farmery D, Peebles L, Grainger R Evaluation of Self-Management Support Functions in Apps for People With Persistent Pain: Systematic Review JMIR Mhealth Uhealth 2019;7(2):e13080 URL: https://mhealth.jmir.org/2019/2/e13080 DOI: 10.2196/13080 PMID: 30747715 PMCID: 6390192 - Free Resources & Paid Subscription Terms The Curable app offers numerous resources free of charge. It also offers the option to access a broader library of exercises with a paid subscription. This auto-renewing annual subscription is priced at $59.99 (USD). Pricing may vary by country of residence. Subscriptions automatically renew unless auto-renew is turned off at least 24 hrs before the end of the current period from iTunes Account settings. You can read our privacy policy at https://www.curablehealth.com/privacy and our TOS at https://www.curablehealth.com/terms. more",
  "reviews": [
    {
      "user": "awfdtnmd",
      "date": "04/24/2022",
      "title": "I love this app! It does what it says!\n\n    Developer Response",
      "review": "This app is so good! If you have any uncontrollable pain, or even a persistent discomfort, this app can help you. There is a wealth of knowledge that helps you understand that your brain is what tells us that we have pain. All pain originates in our brain - this does NOT mean the pain is in our heads, but that our brains generate the amount of pain we feel. We can also change our brain’s response to something that has caused us pain, and therefore reduce the pain. Knowledge is power, and in this case it is a scientifically proven, therapeutic way to reduce pain. I also love the recovery stories and expert interviews. There is guided meditation to help you relax (not my favorite because I don’t like her voice - I use a different exercise app), writing activities, and brain training. The only thing I wish were improved was that there would be more education and brain training into opportunities. For me, these alone helped get rid of my pain. It also reduced or eliminated other uncomfortable sensations I was feeling in my body (e.g., a really weird metallic/sour taste in my mouth I experienced for 9 months with no other medical explanation). I really think it was stress, and this app took it away for me! Please don’t hesitate to buy this app. It is worth it’s weight in gold (and cost of medical and psychotherapy sessions)! more Hi there - Thank you so much for sharing your positive and constructive feedback with us! We are glad to hear that you enjoy the app and that it has helped you. Best wishes, Jack from Curable Support more"
    },
    {
      "user": "Brettlight",
      "date": "02/23/2023",
      "title": "40 years of pain GONE\n\n    Developer Response",
      "review": "I am 57 years old, and I’ve been suffering from back pain since I was in my teens. For many years as a teenager I saw a physical therapist to help with my back pain. Unfortunately, it only helped a little. I live a very healthy lifestyle, and about 3 to 5 times a year my back will go out, and I will be completely debilitated for several days. Sometimes I am completely unable to even get off the floor or get out of bed as the pain is unbearable. The only thing I have found that helps is to continually exercise. Over the years I’ve consulted with many surgeons that said I was not a candidate for surgery. A few years ago I started getting epidural injections that would minimize the frequency of my severe lower back spasms. Of course I don’t like getting the injections and I haven’t had one in over 14 months. 2 1/2 months ago, I started using the Curable app and I’ve been 90% pain-free. I still have experienced back spasms, but unlike previously when I would be bedridden for a day or two and have to take pain pills and anti inflammatories and miss work for a few days, now my spasms go away within about a minute and so does the pain. I’m blown away by the results and am enjoying the process along the way. I honestly thought that I was going to live with this condition for the rest of my life, but now I know there’s a better way. more Hi there - Thank you for sharing a little about your journey with us. Congratulations on all of your amazing progress! Be well, Jack from Curable Support more"
    },
    {
      "user": "alex the girl thing😝",
      "date": "12/04/2021",
      "title": "Helping me manage pain from FAI/ labral tears/ back pain - amazing!\n\n    Developer Response",
      "review": "This app has been an absolute lifesaver over the past month. I was laid up in bed for 10 days not only with the pain of my congenital injury, but also with side effects of prednisone which led to excruciating muscle spasms in my quads that forced me completely out of commission because of the pain. I was on hydrocodone, but I was able to wean off of it by using this app to change my relationship with the pain and to breathe into a different mindset. Just this morning, I woke up with my back spasming, and I immediately went into fear mode. But I put on a meditation from this app, and I was able to calm my mind and my body, and therefore the pain has subsided considerably and I am able to move and function today. I also just completed the journal, and it helped calm my perspective on what lies ahead for me. I love that all of the lessons are research-based with valid scientific evidence. I hold a Master’s Degree in Kinesiology with a focus on Integrative Wellness, and so I understand the research that is relevant to this app since I have studied it previously. Even with that “logical” background, I am human and can still spiral into overwhelm and fear when the pain flares up. This app is just so well-designed, and I find myself recommending it to everyone I know who might be dealing with pain. Highly recommend! more Hey there - Thank you for taking the time to share a little bit about yourself and your experience with the app. We are thrilled to hear that the material is resonating with you and helping you along your journey. Be well, Susie from Curable Support more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Apple Vision"
  ],
  "size": "8 MB",
  "category": "Medical",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English"
}