{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "myPhonak 17+",
  "subtitle": "",
  "seller": "Sonova AG",
  "stars": "4.4",
  "rating": "70.8K Ratings",
  "price": "Free",
  "appDescription": "One app to personalize your hearing experience and track health data The new myPhonak comes with improved functionality and a new design to make your hearing experience as seamless and as tailored to your needs as possible. myPhonak provides you access to enhanced hearing controls and personalization options for your Phonak hearing aid(s) in addition to tracking your health data.* The Remote Control enables you to easily make changes to your hearing aid(s) to suit your personal preferences for various listening situations. You can easily adjust the volume and various hearing aid features (e.g., noise reduction and microphone directionality) or select pre-defined programs according to the different listening situation you are in. Additionally, you can make quick adjustments to the pitch of the sound in the equalizer by using the presets (default, comfort, clarity, softer, etc.) or more personalized adjustments using the sliders (bass, middle, treble). The Remote Support allows you to meet with your hearing care professional through a live video call and have your hearing aids adjusted remotely. (by appointment) Numerous functions are available within the Health section such as Steps* and Wearing time*, including Optional goal setting*, Activity levels*, Heart rate tracking**, Distance walked and ran***. * Available on Paradise Rechargeable, Audéo Fit, Lumity and Infinio devices ** Available on Audéo Fit only ***Available on Audéo Fit , Lumity and Infinio devices Finally, myPhonak allows for configuration of Tap Control, setting up cleaning reminders and provides additional information, such as battery level and status of connected hearing aids and accessories. Hearing aid compatibility: myPhonak is compatible with Phonak hearing aids with Bluetooth® connectivity. myPhonak can be used with: Phonak Audéo™ I (Infinio) Phonak CROS™ I (Infinio) Phonak Sky™ L (Lumity) Phonak Naída™ L (Lumity) Phonak CROS™ L (Lumity) Phonak Audéo Fit™ (Lumity) Phonak Slim™ L (Lumity) Phonak Audéo™ L (Lumity) Phonak Audéo Life™ (Lumity) Phonak CROS™ P (Paradise) Phonak Audéo Fit™ (Paradise) Phonak Audéo Life™ (Paradise) Phonak Virto™ P-312 (Paradise) Phonak Naída™ P (Paradise) Phonak Audéo™ P (Paradise) Phonak Audéo™ M (Marvel) Phonak Bolero™ M (Marvel) Phonak Virto™ M-312 (Marvel) Phonak Naída™ M-SP (Marvel) Phonak Naída™ Link M (Marvel) Phonak Audéo™ B-Direct*** ***Advanced Remote Control and Remote Support not available Device compatibility: iPhone 6s and newer running iOS Version 15.0 or newer. Phones with Bluetooth low energy (BT-LE) capability required. If you want to check if your smartphone is compatible, please visit our compatibility checker: https://www.phonak.com/en-int/support/compatibility Please find the Instruction for Use on https://www.phonak.com/en-int/hearing-devices/apps/myphonak. IOS is a trademark of Cisco, Inc. The Bluetooth® word mark and logos are registered trademarks owned by Bluetooth SIG, Inc. and any use of such marks by Sonova AG is under license. Always seek the advice of a doctor in addition to using this app and before making any medical decisions. The app is only available in countries where the compatible hearing instruments have received official approval for distribution. myPhonak supports integration with Apple Health when connected to a compatible hearing aid such as Phonak Audéo Fit. more",
  "reviews": [
    {
      "user": "Frustrated new user 1001",
      "date": "08/19/2023",
      "title": "Great hearing aids, app is not dependable\n\n    Developer Response",
      "review": "I love my new hearing aids and have been getting used to hearing my phone calls and music through them, along with everything around me. All great up until iOS 16.6 and they no longer stream or show as any option to use on my phone. They pair just fine but limited use for the app now and frustrating after getting used to hearing phone calls through them. I tried support and they didn’t even read the issue and just resent instructions on how to pair. Support really should not assume starting at step one especially when issue is explained. Back to removing hearing aids when I listen to music or stream.**Update** I was curious what response I would receive. Turns out the same as the emails, no help at all, pointing me to email again as though I had not tried two times already with the same canned reply. HOWEVER, the replies do contain a phone number which was my last option. I called and the person on the other end mentioned one VERY IMPORTANT step not in ANYTHING supplied so far. I had to place my hearing aids into the charger to re-pair the third streaming portion of the app. Phonak, I suggest adding this to your auto replies. more We apologize for the inconvenience and will forward your feedback to our developers team. For any help and support, please contact us at: apps@sonova.com Regards, Sonova Apps Team. more"
    },
    {
      "user": "Doc1764",
      "date": "10/20/2023",
      "title": "Phonak - Top Quality Hearing Aides\n\n    Developer Response",
      "review": "I have had a moderately severe hearing lost in both ears since birth. They failed to note my hearing lost until I was 7 years old. It was through the a very observant second grade teacher that my severe hearing deficit was discovered. Before that discovery, I repeatedly got in trouble because what was in reality was an inability to hear was chalked up as me beings a poor learner, poor attitude, and as one who had at birth had a intelligence deficit due to having also had a partially arrested hydrocephalus as well as hemolytic disease of some the newborn at birth as well. It once it was. discovered that a hearing deficit in both ears, I was fitted with hearing aides. That made all the difference in the world. I went from C’s,D’s, and F’s to A’s and B’s. So, I have been wearing hearing aides for a very long time. I can say that of all the various types of hearing aides that I have worn over the years, I can say without reservation that Phonak is the very best hearing aides that I have ever had. I will have no other. I hear things now that I have never heard before. Hearing conversations is effortless and clear. So, I unequivocally give Phonak 5 stars ! I would give more, but 5 is the top rating. They are absolutely top rated hearing aides. more Thank you so much for sharing your experience with us and taking the time to leave an excellent rating. We really appreciate! Regards, Sonova Apps Team more"
    },
    {
      "user": "Smoothgoingdown",
      "date": "04/06/2024",
      "title": "Great hearing aid\n\n    Developer Response",
      "review": "I have owned hearing aids in the past. Purchased high quality aids about 15 years ago and could never get accustomed to them. Found myself not using them due to their amplification of all sounds around you. I then later tried a lower cost hearing units and they did the same. So for the last 7 years I didn’t use hearing aids. My hearing was very difficult when trying to have conversations. I decided that my quality of life had to improve not just for me but those around me. I hope that technology had improved. I wanted top professional help so I went to highly recommended audiologist. I was fitted with some great hearing aids that I forget I’m wearing them. And my hearing has much improved during conversations in various noisy locations or just listening to the TV. You owe it to yourself and the ones around you to find a hearing aid if you are having difficulty with hearing certain words and pitches. And you can go walking and answer the telephone or play music grime your smartphone. Love them. Glad I made the decision to improve my life. more Thank you so much for sharing your experience with us and taking the time to leave an excellent rating. We really appreciate! Regards, Sonova Support Team more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch"
  ],
  "size": "150.7 MB",
  "category": "Medical",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English, Arabic, Bulgarian, Croatian, Czech, Danish, Dutch, Finnish, French, German, Greek, Hebrew, Hungarian, Icelandic, Indonesian, Italian, Japanese, Korean, Lithuanian, Norwegian Bokmål, Polish, Portuguese, Romanian, Russian, Serbian, Simplified Chinese, Slovak, Slovenian, Spanish, Swedish, Thai, Traditional Chinese, Turkish, Ukrainian, Vietnamese"
}