{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Pathway – Medical Knowledge 17+",
  "subtitle": "Clinical Decision Support",
  "seller": "Pathway Medical, Inc.",
  "stars": "4.7",
  "rating": "1K Ratings",
  "price": "Free",
  "appDescription": "Pathway is an accurate and efficient point-of-care reference tool that gives physicians, nurses, physician assistants, pharmacists, residents, and students rapid access to guideline summaries, mobile-friendly interactive algorithms, clinical calculators, landmark trials and more. • 40 medical specialties • 900+ diseases • 75,000+ topics • 120+ interactive pathways 96% 5 Star Reviews Trusted by clinicians in over 180 countries AS SEEN IN • MobiHealthNews: \"A well-designed decision support technology adapted to the realities of 21st-century medicine.\" • Physicians Practice: \"Provides easier access to important clinical information.\" SIMPLIFY YOUR DAILY PRACTICE • Find what you need, faster, with condensed summaries of evidence-based clinical guidelines. • Get patient-specific guidance with mobile-friendly interactive algorithms. • Easily assess the evidence with color codes, explanations, and links to the original text for seamless due diligence. • Quickly reference landmark trial summaries for 500+ diseases, all in one place. • Make the right diagnosis by easily consulting pertinent findings when a diagnosis is under question. • Find exactly what you need with deep search and an intuitive interface that understands you. • Stay up-to-date with notifications for practice-changing updates tailored to your specialty. • Get reliable guidance anytime, anywhere - even without an Internet connection. REVIEWS “None of the clinical reference tools available are as simple, efficient and to-the-point. This is the only medical app I use on a daily basis.” - Jane R., General Practitioner “The simple layout of guidelines is very much appreciated and allows for rapid access of clinical guidelines which is incredibly handy in a time sensitive situation.” - Louis S., Clinical Pharmacist “Perhaps the hardest part of medicine is information overload and Pathway provides the best solution to this challenge I have seen.” - Christian L., 2nd year resident “The color-coded evidence assessments are very useful for quickly evaluating the quality of the evidence. I’ve recommended Pathway to my colleagues and will continue to do so.” - Katie G., General Practitioner EVOLVING EVIDENCE-BASED MEDICINE With over 800,000 medical studies published every year, it’s nearly impossible to stay up-to-date on clinical guidelines and best practices. Our physician authors and editors painstakingly review, assess, and summarize the highest quality evidence-based clinical information and display it in a clear, simple interface to be acted on at the point of care. We master what’s tedious so you can master what’s important—caring for your patients. STAY CONNECTED • Website: https://pathway.md • Email: contact@pathway.md • Facebook: https://www.facebook.com/pathwaymedical/ • Twitter: https://www.twitter.com/pathwaymedical/ • Instagram: https://www.instagram.com/pathwaymedical/ LEARN MORE • Frequently Asked Questions: http://www.pathway.md/faq/ • Terms of Use: https://www.pathway.md/terms-of-use/ • Privacy Policy: https://www.pathway.md/privacy-policy/ *Pathway is intended for physicians, medical residents, medical students, registered nurses, and other licensed health professionals only.* more",
  "reviews": [
    {
      "user": "Msingh87",
      "date": "12/02/2022",
      "title": "Pharmacist\n\n    Developer Response",
      "review": "Pathway breaks down information in such a way that it's easy to find what you need. Databases like uptodate are great but are hard to read, the average sentence is 16-20 words long, which requires you to sit and evaluate the information, you can't really skim or read it on the go. With this app, everything is condensed, sources are present and statistics are color coded so all you need to do is get your phone out and do a quick search. Pathway is great for rounds, studying for boards and putting together presentations more Thank you for the glowing review! It's music to our ears to hear that Pathway is hitting the right notes for you. We've designed it with the hustle and bustle of healthcare professionals in mind—making sure that when you're on the move, the information moves with you, efficiently and effectively. Our goal is to keep things clear, concise, and at your fingertips, whether you're on rounds, studying for boards, or crafting your next presentation. Your success is our success, and your feedback fuels our drive to keep improving. Keep the suggestions coming, and thank you for making Pathway a part of your daily toolkit! more"
    },
    {
      "user": "SalGulA",
      "date": "06/06/2024",
      "title": "Great idea but could be executed better",
      "review": "I’m having a bit of hard time reading and comprehending the guidelines on the go because they are a jumbled mix of US/UK/Canadian guidelines and also vary by subspecialty society guidelines. I just want to be able to skim through to the diagnosis / management but it’s not intuitive. I would prefer the option of selecting what regional guidelines I want to follow and then my topics only list those regional guidelines. There are statements with a tiny expand / drop down option to view additional statements. That’s extremely confusing and not fun to use on the phone either. Maybe if user can select region it can shorten the text displayed and the need to have drop down lists. more"
    },
    {
      "user": "Sher Ali Khan",
      "date": "09/16/2024",
      "title": "Not Working. I don’t recommend buying it",
      "review": "I paid for full year membership (to use AI aspect of it) and then discovered that it’s not working. Sitting with patient I have limited time to search medical facts. First of all this app takes time to start up, then when you ask it a question, it takes time to bring up the answer, on top of that it hangs and stops working (crashes) quite frequently. It simply didn’t work for me. I asked them to reimburse me the money. They referee me to Apple for reimbursement. I asked Apple for reinstatement, they refused. I highly recommend against it, rather I would recommend using “OpenEvidence” online which is a free portal for health care providers. It never crashed since I have been using it. You ask it questions and the AI answers it within few of seconds along with references. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Apple Vision"
  ],
  "size": "364.9 MB",
  "category": "Medical",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English"
}