{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Telehealth by SimplePractice 4+",
  "subtitle": "Secure video appointments",
  "seller": "SimplePractice, LLC.",
  "stars": "4.7",
  "rating": "267.3K Ratings",
  "price": "Free",
  "appDescription": "Attend your appointment without leaving your home or office, or car, or private outdoor spot. With Telehealth by SimplePractice, clients and clinicians can participate in 100% secure, HIPAA-compliant therapy sessions from anywhere. Start video appointments instantly, no login or password required.",
  "reviews": [
    {
      "user": "United W Logistics",
      "date": "01/12/2024",
      "title": "Being Healthy and the word “No Excuses”",
      "review": "Has never been this easy, to provide the right explanation in a nutshell “stellar performance “ , having experienced many Different “Telehealth apps”, Nothing comes close to “Simple Practice “ you have indeed shifted the entire paradigm in Patients and clinicians way of communication the clarity, the simplicity, the ease, when we speak with a physician of any kind we have enough on our minds that is to worry about, Adding the way of communication used to add unnecessary anxiety to top it all , until You came along and not only Eliminated all the unnecessary stress and anxiety But quite on the contrary, “I cannot wait every time to speak with my healthcare provider knowing that it is your Amazing app that will deliver a service no other can. Thank you for changing the lives of millions!!! The number of Healings you contributed and responsible will never been known to mankind, But the one above never loses count, therefore many many year of success and prosperity for all who made and make this happen on a daily basis more"
    },
    {
      "user": "Sterling 943",
      "date": "03/12/2021",
      "title": "Read ALL of the privacy sections\n\n    Developer Response",
      "review": "It may or may not be a good App, I do not know because I stopped and deleted after reading their “privacy” policy. It is shocking. Their “privacy policy does not apply to the personal information they collect”. That is taken from paragraph 1 of their policy. Paragraph 2 allows then to collect personal information directly and automatically and third party, including social media. Paragraph 3 allows them to share my personal information with companies that market with them, for analytics with their affiliates. Paragraph 5 allows their tracking on any Facebook, Google, and LinkedIn, etc., for what I view. If I deny their use of “cookies”, information that take to “better benefit me”, and I configure “DNT (do not track)”, their system is set up to ignore my request, allowing them to track signals from my browsers and mobile devices. In some states, I can request deletion of files twice a year, free of charge, but by then, damage is done. You cannot undo what has been shared. I could go on, but please read everything. They escape legalities by informing us what they do, so we are then helpless. My information is taken directly from their website. I encourage you to read and think twice, is it really worth it, taking advantage of patients during COVID, when there is no other choice? more Hi there, I’d like to address your concerns with our Privacy Policy. To clarify, our Privacy Policy does apply to the Personal Information we collect from our customers, but doesn’t apply to clients’ Private Health Information (PHI) stored in customer accounts. Client information is protected by more stringent HIPAA regulations and our BAA. SimplePractice is HITRUST certified, which is the gold standard for measuring the security and compliance of an Electronic Health Records software. We do not sell, or disclose client data to third-party platforms in any capacity and take great precautions to ensure that our team is properly trained to handle PHI, when necessary to help customers with account specific questions. The Personal Information we reference in the Privacy Policy only applies to the information customers disclose when creating an account, reach out to us for assistance with their account, information we request when verifying a customer’s identity, or if they decide to interact with us through one of our social networks. The collection of Personal Information is used to directly service our customers, and internally analyze how we can best help our users and enhance our product. Our third-party partners are covered by our BAA and are only given the information necessary to provide services through our platform, such as our Online Payments function. They also do not sell, or share information collected through our platform. The use of cookies, or data collected through online activity is not unique to SimplePractice. Unlike some sites, that share and sell data, the sole use of this data in SimplePractice is to identify trends in customer engagement, diagnose server issues, protect against security breaches and manage risk. Thank you for your thorough review, let me know if there’s anything I didn’t cover, or if you’d like me to elaborate on any of the points made. - Ruth more"
    },
    {
      "user": "grandma's dearest",
      "date": "11/16/2022",
      "title": "My therapist Lauren",
      "review": "I am grateful for my therapist Lauren. I have a connection with her that is hard to find when getting a new therapist. This is a reminder. She is very compassionate. I think she is going to be an asset wherever she works when she’s done with Next Chapter.. it’s hard to find a therapist. That is a good fit. I’ve have always had therapist’s the same therapist for up to 10 years. I am 60 years old and can see and feel her compassion. And the hardest part is that she will be leaving in December. I think Next Chapter is a great service for those with mental illness. I would like to continue therapy. With a new student after Lauren is gone. I have been diagnosed bipolar for 33 years and recently found that I had attention deficit hyperactivity disorder. When she took me on as a patient Simon, she definitely got a full load of many issues of mine.. I am thankful for her. Thanks how many babies can a dinner are you hungry come more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch"
  ],
  "size": "101.3 MB",
  "category": "Medical",
  "ageRating": "4+",
  "languages": "English"
}