{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "BioLife Plasma Services 4+",
  "subtitle": "Let’s work Arm-In-Arm!",
  "seller": "Takeda Pharmaceuticals International AG",
  "stars": "2.6",
  "rating": "2K Ratings",
  "price": "Free",
  "appDescription": "Donating plasma just got easier with the BioLife Plasma Services mobile app. BioLife Plasma Services is part of Takeda TKPHF (OTCMKTS), the leading global biotechnology company focused on serving people affected by rare diseases and highly specialized conditions. These diseases are often misunderstood, undiagnosed and life-threatening. Key Features: Scheduling • Scheduling appointments is even easier now with one click scheduling on-the-go Check Reward Payments • Reward payment balance is easily accessible on the home screen • Quick reference to payment history Promotional Offers • Receive notifications for exclusive offers • Track your donation progress towards promotional rewards • Refer-a-friend via text, email or social and qualify to receive a Buddy Bonus more",
  "reviews": [
    {
      "user": "Joe\"&'",
      "date": "11/09/2023",
      "title": "Appointments mean nothing",
      "review": "The problem with this is that appointments mean nothing. You set an appointment, but 100 other people did at the time as well. 3 hour waits are normal. Defeats the point of “scheduling an appointment”. ^^^^^ And they seemingly randomly don’t allow you to schedule appointments. I know there’s not many people there in the morning, but they block you out from that so fast. But yet you can still schedule at 7:30 when tons of people are there and coming in. So it’s next to impossible for me to donate twice a week when I can only schedule an appointment one at a time, and on that short notice I can’t get a spot in the morning. ^^^^^ And I’m confused why it even blocks you out of scheduling at that time when less people are there than at other times that you can schedule. ^^^^^ It’s just a tremendously packed place at this location, would love to be able to come in and get it done but this confusing method of “scheduling appointments” that assumes you have all the free time in the world is very oddly done. I definitely recommend getting a better system more"
    },
    {
      "user": "Thaoboxer",
      "date": "07/22/2024",
      "title": "Garbage app",
      "review": "Whoever wrote this app should be fired. The thousand+ reviews already written that outline how garbage it is , should be a clue. I’ll add a new one. 1- u can’t donate without the app. Literally. We call 4 different ones within a 40 mile radius. No one ever ever ever ever answers the phone. Ever. So u need the app to donate. U get to the place and there is always a 1-3 hour wait BEFORE sign in. Because “someone called in sick “. Because of that u have to click early early times to get in. Sadly most of them are gone. Like say 9 am. U click 9 am and u might get in but not your spouse. So she goes at 9:10. There is a 10 minute grace period to sign in. Can’t be 11 minutes early or late to sign in( at the facility) now say u get there at 8:40. Since it’s a 30 minute drive. U leave a cushion. U try to change appointment. U have to CANCEL old one. And click to see if there is availability. Hopefully there is. If not u just lost you appointment. You can get around this by talking to the receptionist there “hey can u see if there is something earlier since we are already here “. The app should show if any appointment is available NOW before u cancel to reschedule. ( I’m talking same day. Not reschedule for other days ) more"
    },
    {
      "user": "Apple Joe Buck",
      "date": "02/06/2023",
      "title": "Appointments",
      "review": "The appointment calendar was better the old way. At least it was on my iPhone. If I make say 5 appointments, I can’t see where I made them if I come back into the app unless I click on the date again one at a time. Being able to see the whole month to schedule your appointment was much nicer. In the end it doesn’t really matter because the line to get tested is usually a half hour, then you wait in another line a half hour to get a chair, then you wait again for them to catch up and stick a needle in you. My scheduled last appointment took 2 hours to complete. I only need 45 minutes to give plasma so the rest is all waiting. Why even have an appointment? Must be like the airlines and overbook seats. This was in the Onalaska Wisconsin location. Now that I have completed my promotional coupon, I am done. I would consider going more but wait time is just terrible. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "39.4 MB",
  "category": "Medical",
  "ageRating": "4+",
  "languages": "English"
}