{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Labcorp | Patient 17+",
  "subtitle": "",
  "seller": "Laboratory Corporation of America",
  "stars": "4.8",
  "rating": "19.9K Ratings",
  "price": "Free",
  "appDescription": "The Labcorp Patient mobile app is easy to use and has convenient features that help you manage your health. Here are just a few of the things you can do, from the convenience of your mobile device: • Find a lab and schedule an appointment • Check in at a Patient Service Center by scanning a QR code at our kiosk or checking in from your mobile device • Receive a notification when your lab test results are ready • View, download, and print your official lab test result report • View historical lab test results • Receive a notification when a bill is available • View, download, print, and pay your bills • Share your account with someone else • Add minors to your account to manage their lab testing information • Manage your profile preferences • Reset your password • Log in using your Face ID or Fingerprint • Learn how you can participate in clinical research offered by Labcorp more",
  "reviews": [
    {
      "user": "shadesofbrandygold",
      "date": "09/14/2022",
      "title": "Changed Labs",
      "review": "I used to go to another Lab for blood work which was further from my home as a few places closed. So I called to see if t Lab Corp took my insurance. They did so I went there for the first time. What a difference. The front desk person was VERY helpful and made it simple and quick to sign in. I had a short wait as a walk in and the woman who did the test was so efficient and nice. This is where I would recommend to anyone needing those services. more"
    },
    {
      "user": "Miss_E_2015",
      "date": "02/16/2024",
      "title": "Can’t pay my invoice",
      "review": "When trying to pay my bill, I enter my name and it states by selecting next I’m agreeing to the terms and conditions. There isn’t a next button. I only see a cancel button. I’ve used the app to play my bill before, so I assume there is a temporary issue. I gave 3 stars because of this problem. I like the app to see my lab results. It’s easy to use and I see the results the day after my test. When this issue is fixed, I will give a 5 star review. Update- I still can’t pay using the app. Labcorp had the nerve to email me saying the company has made it simple. I realize I’m doing this from the convenience of my home, but I had to try several ways before I found a way to pay online. I checked to see if my app was updated and it was. I could pay online by logging on your site on a web browser. At least you know making a payment should be simple. Maybe one day you will actually make it easy. more"
    },
    {
      "user": "catsarecool_007",
      "date": "03/23/2023",
      "title": "Disappointed",
      "review": "Lame that when you’re scheduling an appointment, app kicks you into web browser to do that. Then what’s the point of the app? I downloaded the app specifically because I did not want to use the web browser to schedule my appointment ! Everything should happen inside the app. Also, all the capchas when I’m checking if appointments are available at different locations…I signed in with my password…that shouldn’t be necessary. Also, showing my birthdate, but covering my email and phone number. Again, I signed in with my password and I’ve used you guys before…no reason to put my birthdate on the screen…that’s much more valuable to identity thieves. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Apple Vision"
  ],
  "size": "39 MB",
  "category": "Medical",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English"
}