{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "SleepScore 12+",
  "subtitle": "Go Beyond Tracking",
  "seller": "SleepScore Labs",
  "stars": "4.4",
  "rating": "7.2K Ratings",
  "price": "Free",
  "appDescription": "SleepScore features patented, non-contact, sonar sleep tracker technology to measure your sleep from your nightstand, personalized actionable advice, sleep sounds, smart alarm, sleep cycle analysis, and more. Do you want to improve your sleep but don’t know where to start? Do you want to fall asleep with ease? Do you want to learn more about your sleep cycle? SleepScore measures every move and breath to measure each phase of your sleep, from deep and REM sleep to every nighttime awakening. Our measurement technology provides best-in-class accuracy backed by 14 published papers validating the measurement technology against PSG, the gold standard in sleep tracking. Based on the analysis of your sleep patterns, the app then provides detailed sleep insights and actionable advice, all personalized to improve your unique sleep. Plus, try SleepScore’s lifestyle challenges, sleep sounds, smart alarm, DreamScape, and more. FEATURED IN: Washington Post, The New York Times, Forbes, CNN, Men’s Health, Huffington Post, Wirecutter, USA Today, Business Insider, Digital Trends, & more! UNDERSTAND YOUR SLEEP -Track your sleep with SleepScore’s patented non-contact, accurate sonar technology -Explore insights about your unique sleep cycles each night -View trend & correlation charts based on your sleep patterns and lifestyle analysis -Receive a weekly sleep report to easily view and identify trends -Access your lifetime sleep history, trends, and sleep cycle analysis -Access validated screeners if signs of a more serious sleep disorder are detected -Download a comprehensive 30-day sleep report and screener results to share sleep concerns with your doctor IMPROVE WITH SCIENCE BACKED FEATURES, ADVICE, AND MORE -Receive daily actionable tips tailored to your lifestyle and sleep habits -Set sleep goals to focus on what you what’s important to you, or let SleepScore learn about your sleep and suggest the right goal for you -Try weekly sleep challenges to learn new behaviors that can improve your sleep and wellness -Listen to soothing sleep sounds that gradually slow down to help you relax and fall asleep faster -Measure and optimize the light, temperature, and sound levels in your bedroom -Wake refreshed with the Smart Alarm, designed to gently wake you in the morning at the ideal time in your sleep cycle APP HEALTH DATA Our app integrates with the Apple Health app to add your sleep data and read your activities, such as exercise. On supported devices, SleepScore reads data from the Health App with your permission to update your activities during the day to provide more personalized advice. SleepScore also writes sleep data to the Health app with permission. SUBSCRIPTION PRICING AND TERMS SleepScore is free to download and use. For advanced features, SleepScore has auto-renewing monthly & yearly subscription options. If you choose to purchase SleepScore, payment will be charged to your iTunes account. Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period. Your iTunes Account will be charged for renewal within 24-hours prior to the end of the current period at the cost of the chosen subscription length. Auto-renewal may be turned off at any time by going to your settings in the iTunes store. Any unused portion of a free trial period will be forfeited when you purchase a subscription to SleepScore. Not validated to accurately track sleep with iPad, iPod Touch, iPhone 5s, or iPhone SE. Privacy policy https://www.sleepscore.com/legal/privacy-policy Terms of Service https://www.sleepscore.com/legal/sleepscore-terms-of-service more",
  "reviews": [
    {
      "user": "Bobby is not me",
      "date": "06/26/2018",
      "title": "Nice app\n\n    Developer Response",
      "review": "Edit: thanks for the response. Do you have any plans on adding health app syncing? I really like this app. I have probably only one problem thus far. I also use the CPAP that this company makes so I have the app that tells me how I’m doing with that as well. But I wish that they could make them one app since they both measure different things. This one uses the sound waves/sonar and the other one tells you how your use of the CPAP went. But they are not the same. Some nights I take off the CPAP without thinking and then it stops tracking my sleep even though I’m still asleep. Would be nice to have both wrapped up into one app (set your wake time and have it start tracking your sleep when you start the CPAP) and get both scores with the premium membership included because you bought the machine and continue to buy the supplies. Just a thought. I’m still looking for one place to track my sleep and teach me how to do it better. The 2 apps come close. more Hi Bobby, I wanted to update you and let you know that we are now able to write information to the Apple health kit. If you download the most recent version of the SleepScore app you will notice the sleep data now being transferred. more"
    },
    {
      "user": "MaraLillian",
      "date": "08/25/2023",
      "title": "Helps improve my functioning with chronic illness\n\n    Developer Response",
      "review": "I’ve been using the app for about 4 months now. I have ME/CFS along with fibromyalgia and arthritis. When I first started using the app I noticed I was getting less than 30min of REM sleep a night and not enough deep sleep either. When I was able to get more REM sleep I noticed I felt much better and energy is improved overall. So as I’ve been using the app to increase my REM and deep sleep, my overall functioning has gotten better. Of course it’s not a cure for my chronic illness but has made a big difference! And for anyone with ME/CFS, you know that little bit better functioning is actually huge! It’s relatively low cost, the free version has worked fine but I paid for the subscription to save my data. It’s surprisingly accurate too. I can see when I wake up what kind of day I will be having now based on the data and knowing my body. The sleep score doesn’t always mean I feel well rested/alert because of my individual health issues but I can tell if I have enough sleep including rem and deep sleep that it will correlate to better functioning. more Thank you very much for your 5-star review!!! Glad you like it! :) more"
    },
    {
      "user": "Generator245",
      "date": "01/10/2019",
      "title": "Pretty good\n\n    Developer Response",
      "review": "Liking this app a lot after about a week and a half of use. It’s a little picky about how/where you have it placed so it can “detect” you and track throughout the night, but once you find a good position close enough to you it’s good. My only real feedback I would give right now is that there doesn’t seem to be a way to adjust the volume on my device in regard to the smart alarm feature. I really like this feature and I feel it has reduced my grogginess upon waking, but the app seems to have a default volume level for the alarm that is significantly louder than it needs to be, especially considering how close your device is in order to track your sleep! My husband is not usually woken up by my alarms but this one is so loud that it has woken him up a few times, and when I try to turn it down on my phone, the app moves the volume level right back up. Maybe this is just a bug that could be fixed? I would definitely recommend this app as it does have a lot of really good features and is a really good learning tool, but it does still have just some general bugs to be worked out. more Hi, thank you for providing your feedback. We are so happy to hear that you are liking the app, and that you have found the optimal setup for your room. We will be sure to pass along your feedback about the smart alarm volume to the team for improvement. If you have any other questions or concerns, please reach out to Support@sleepscorelabs.com and a customer service specialist will be in contact. Sleep well! more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch",
    "Apple Vision"
  ],
  "size": "180.3 MB",
  "category": "Health & Fitness",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English, German"
}