{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Hinge Health 12+",
  "subtitle": "Move beyond pain",
  "seller": "Hinge Health, Inc.",
  "stars": "4.9",
  "rating": "64.5K Ratings",
  "price": "Free",
  "appDescription": "At Hinge Health, we're on a mission to help people get relief from joint and muscle pain and move with confidence. We combine expert clinical care and advanced technology to go beyond traditional physical therapy. Our programs are available at no cost to our members through 1,800+ employers and health plans. Check if you're eligible at hinge.health/covered HOW HINGE HEALTH WILL HELP YOU: PERSONALIZED EXERCISE THERAPY Get a care program that's based on your medical history, self-reported information, and clinical questionnaire. Designed by physical therapists. ON-THE-GO EXERCISES Online exercise sessions take just 10-15 minutes and you can do them anytime, anywhere through the Hinge Health mobile app. EXPERT CLINICAL CARE We'll connect you with a physical therapist and health coach to tailor your exercise program as you go and provide the clinical and behavioral care that you need. Reach out anytime by scheduling a video visit or through in app messaging. AN EASY-TO-USE APP The Hinge Health app has everything you need. Get your exercises, reach out to your care team, and learn about your condition. Set goals, track your progress, and celebrate all your wins big and small. EDUCATIONAL CONTENT Unlimited access to a library of videos and articles that cover such topics as nutrition, sleep management, relaxation techniques, women's reproductive health and more. PAIN RELIEF THAT WORKS Studies have shown that Hinge Health members reduce their pain by 68% on average in just 12 weeks*. From gardening to hiking, to playing with your kids, live the life you love—with less pain. DRUG FREE PAIN RELIEF Enso (r) is a wearable device that relieves pain in minutes and may be available to you based on program and eligibility. Take a couple of minutes to prioritize your pain relief today. Check if you're covered at hinge.health/covered ABOUT HINGE HEALTH Hinge Health is creating a new health care system, built around you. Accessible to 25 million members across 1,800+ customers, Hinge Health is the #1 digital clinic for joint and muscle pain. Learn more at www.hingehealth.com *Participants with chronic knee and back pain after 12 weeks. Bailey, et al. Digital Care for Chronic Musculoskeletal Pain: 10,000 Participant Longitudinal Cohort Study. JMIR. (2020). Please note: Video calls with care team specialists are only available for some members, depending on the program. more",
  "reviews": [
    {
      "user": "Data123654",
      "date": "08/16/2022",
      "title": "Loving Care\n\n    Developer Response",
      "review": "Hinge Health is an excellent resource available to take care of yourself and make a difference in your health and longevity. My doctor was talking surgery. To me, surgery is a last resort. Insurance provided the opportunity to participate in Hinge Health physical therapy as a starting alternative. Knowing that physical therapy can make a huge difference I signed up. Hinge Health provided an excellent solution and I can participate fully right here at home. HH provided targeted physical therapy in an easy to follow format that allows me work at my own pace while strengthening and rebuilding weak areas. With HH, I have eliminated 95% of the pain associated with my condition and am becoming stronger daily, thus nullifying some of the underlying factors that contributed to my initial problem. Building up your strength slowly, with the help of your coach and the exercises customized to your needs can make all the difference long term. HH provides everything you need including your own online coach to cheer you on and monitor your progress. I have been using this program, sometimes not as much as I should, and recently realized that I have achieved some core strengths and abilities that I have never been able to do, even when I was younger and in top shape. Challenge yourself and give yourself the gift of targeted, loving care. The work you put in is worth every minute. The pay off is a stronger you. Maybe even stronger than ever! more Hi Data123654, Thank you so much for taking the time to share your experience in such great detail! We are thrilled to hear that you eliminated 95% of the pain associated with your condition. Your review is extremely valuable and keeps us striving to always go above and beyond with our program offerings. We are grateful to partner with you on your wellness journey. Sincerely, Anne from Hinge Health Support more"
    },
    {
      "user": "Denene7488",
      "date": "07/29/2024",
      "title": "Effective and convenient\n\n    Developer Response",
      "review": "I’m very thankful my insurance offers this program for it saves time and money while being very effective. I have used it first for pain in my neck and then the specific pelvic floor health program. I like the access to both a therapist who you can have telehealth appointments with to discuss individualizing your plan and a health coach to check in and encourage. I have had significant improvement in both programs and continue to feel much better and stronger. I can stick with doing my exercises weekly for I can do them on my own time and at home. The videos they provide are great and the articles are very helpful and informative. I tell all my doctors about this program and how it’s helped me. I used to have urinary frequency and urgency and pudendal nerve pain affecting me when sitting. Where I used to have to go to the bathroom every hour each morning, with the urgency being painful, I can go three hours in between and the signal to go is not painful. The nerve pain that would flare during sitting periods has greatly reduced and I have easy stretches throughout the workday to do to help. Many days I’m not bothered by it even with long days at the computer. I know all my improvements have been from doing this pelvic floor exercise program that I have completed and I will continue weekly to do the exercises to maintain. more We are thrilled to hear about the positive impact our program has had on your health and well-being. Your dedication to the exercises and the support from our physical therapists and health coaches are key elements to your success. Thank you for sharing your experience with your doctors, we appreciate your kind words! Sincerely, Jess from Hinge Health Support more"
    },
    {
      "user": "FiyaDansa",
      "date": "06/12/2024",
      "title": "Consistency & Support\n\n    Developer Response",
      "review": "I had done PT for a torn meniscus and realized that I had to keep the work going after PT ended to maintain my progress. I was struggling to be consistent on my own and identify new exercises that progressing with my improvements. I was falling off and my pain level increased. I was frustrated and demoralized. I took advantage of the app provided through my insurance. Through consistency I am back to longer walks, biking, dance sessions and more! The education passages at the end of each session have been so helpful particularly when I had a flare up. I’ve had flare up’s thats been attributed to arthritis (Uncle Arthur has been uninvited from the family reunion 😂) and this practice continues to provide benefits! I regularly go to the gym and workout in my own now AND I still find it invaluable to keep up this practice as my PT continues to modify my exercises to continue to strengthen the chain. I remember when I didn’t think I would ever walk with out pain, stand up with ease, or even get up off the floor again! Combining the app workouts with regular activity and exercise, puts me well on my way to pay personal goal of dancing and performing for hours again. It has been a journey to get back to the active lifestyle I’ve always wanted and my body craves! You can do this too! more Thank you for sharing your experience with us! We're thrilled to hear that our app has helped you stay consistent with your exercise routine and manage your pain levels. It's inspiring to see how far you've come and we're here to support you on your journey to an active lifestyle. Keep up the great work! Best, Jess from Hinge Health Support more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch"
  ],
  "size": "140.3 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English, French, Spanish"
}