{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Livi – See a Doctor by Video 12+",
  "subtitle": "Medical Advice & Prescriptions",
  "seller": "KRY International AB",
  "stars": "4.9",
  "rating": "356 Ratings",
  "price": "Free",
  "appDescription": "Livi lets you see a doctor by video, including same-day prescriptions, referrals and more – when and where it suits you. We’ve got drop-in appointments or you can book for a time that suits you – all from the comfort of your home. HERE FOR YOU AND YOUR FAMILY - We're open 7 days a week, including evenings and weekends - Have your appointment at home, work or on the go - Get expert medical advice - Get same-day prescriptions sent to your local pharmacy - Get a specialist referral - Renew a prescription - Let your child see a doctor from home Livi provides high-quality care to anyone, whether you connect with your local healthcare provider or use our paid service. Just register in minutes and see how it can work for you. TRUSTED BY PATIENTS We’ve seen over 10,000,000 patients by video, and we’re rated 4.9/5 for a reason (or many). Here’s what patients have to say... “Livi is so easy and safe to use. Doctors are kind and understanding.” “Talked with a doctor within 5 minutes of asking. Brilliant!” “Lovely doctor. Very engaging with my 5-year-old. Great service. Thank you!” “I love this service. So important at the best of times and all the more when the NHS frontline is so overburdened.” “What would usually take days was sorted within minutes – and on a Sunday afternoon!” “Felt as though I was in the surgery across from my doctor – but in the comfort of home.” WHAT CAN WE HELP YOU WITH? - Acne - Allergies - Anxiety and depression (mild to moderate) - Asthma (mild to moderate) - Constipation and stomach problems - Contraception and family planning - Eye inflammation - Fever - Headaches and migraines - Indigestion and heartburn - Insomnia or difficulty sleeping - Nail problems - Sinus problems - Skin rashes, eczema and other skin conditions - Urinary tract infection in women - Other health enquiries HOW DOES LIVI WORK? Simply download the app, enter your details and we'll let you know what services you’re eligible for. Wait a few minutes to see a doctor or book for a time that suits you. The doctor will call you within the app to start your appointment. Our doctors can then offer personalised medical advice, prescriptions delivered to a pharmacy near you, and a referral to a specialist if necessary. A LIFELINE FOR PARENTS If you’re a busy parent, Livi can be a huge help. Add your child through the app and get medical advice in minutes when they’re ill – without leaving home. You can use Livi for children aged between 1 and 15 years old, just login to your profile, tap ‘My children’ and follow the steps. YOU’RE IN SAFE HANDS UK-based GPs working in the Livi service are all experienced, GMC-registered GPs who have undergone training in the latest video consultation techniques. In France, doctors are registered with the French National Medical Council (Conseil de l’Ordre). Livi is a healthcare provider registered with the Care Quality Commission (CQC) and is committed to delivering the highest standards of clinical quality and safety. more",
  "reviews": [
    {
      "user": "Sweethome!",
      "date": "07/30/2021",
      "title": "Love it",
      "review": "I think it was a great idea to do a virtual doctor. I got my prescription and it’s all is great. Worked out great."
    },
    {
      "user": "iamnotafanoflivi",
      "date": "06/01/2022",
      "title": "Late GP, denied service - complete waste of money.",
      "review": "My GP was nearly 15 minutes late to my appointment, and we talked for an extremely short period of time. He was unable to resolve my issue, didn’t offer medical advice, and told me to meet with a private GP, which is not a financially feasible option as I am paying out of pocket. I called customer service to ask for a refund, and was denied on the basis of receiving so called \"medical advice\" from this ridiculous video visit. Infuriating and a complete waste of £40. more"
    },
    {
      "user": "chknofthescene",
      "date": "07/19/2023",
      "title": "No appointments, poor UX",
      "review": "My wife was suffering from a migraine and needed a prescription. The web site says there are same day appointments, however after downloading the app, putting all her personal information, including photos of her ID and herself, the app only then came back to say there were no appointments that day. Why couldn’t it have said that up front? What a waste of time and insult to her already sore head more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch"
  ],
  "size": "153.6 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Alcohol, Tobacco, or Drug Use or References\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English, French, Norwegian Bokmål, Swedish"
}