{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "EchoTools 17+",
  "subtitle": "Ultrasound Reference",
  "seller": "Rishi Kumar",
  "stars": "4.9",
  "rating": "1K Ratings",
  "price": "Free",
  "appDescription": "EchoTools is a free iOS ultrasonography educational reference covering point-of-care ultrasound (POCUS), transthoracic echocardiography (TTE), and transesophageal echocardiography (TEE). Additionally, it contains cardiac dimensions, native/prosthetic valve measurements, and lessons ranging from interventional procedures to mechanical circulatory support. About Rishi Kumar, MD, FACC, CMQ (\"RK.MD\"): I'm an adult cardiothoracic anesthesiologist and cardiovascular intensivist with board certifications in anesthesiology, critical care medicine, adult cardiac anesthesiology, and advanced perioperative transesophageal and critical care echocardiography (CCEeXAM). I am passionate about teaching with free, open-access medical education! Learn more on my site: https://rk.md more",
  "reviews": [
    {
      "user": "John062311",
      "date": "03/01/2024",
      "title": "Echo tools\n\n    Developer Response",
      "review": "I’m in school for adult echo and I love the app mainly because it has all the formulas in one location and convenient but all the other info and images are Extremely beneficial. Thank you for developing this helpful tool. more Thanks for the kind words and support!"
    },
    {
      "user": "ska020",
      "date": "03/10/2021",
      "title": "Great resource for anesthesia residents\n\n    Developer Response",
      "review": "CA2 on my echo rotation! Thank you for creating and offering this app for as a free resource! I am very excited to show my attending tomorrow in the OR. more Thanks so much for the kind words! Glad to know you like it! more"
    },
    {
      "user": "SoniaS75377",
      "date": "07/09/2020",
      "title": "Great App!!\n\n    Developer Response",
      "review": "Ideal for 1st year cardiology fellows learning how to read echo! Definitely saves time for trainees who are still dependent on the chamber qualification guidelines for normal cutoffs. Some of the normal chamber size ranges need to be updated from 2015 ASE guidelines (supplemental table 3) but otherwise a great app. more I'll work on updating to the latest guidelines as soon as possible! Thanks for the great feedback! more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "211.5 MB",
  "category": "Medical",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English"
}