{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Ambra 17+",
  "subtitle": "Access Your Medical Images",
  "seller": "Ambra Health",
  "stars": "1.7",
  "rating": "64 Ratings",
  "price": "Free",
  "appDescription": "Access Ambra Health's award-winning medical image management suite right from the palm of your hand. Users can effortlessly view imaging from anywhere, scroll through a series, and utilize radiology tooling like zooming, pinching, and rotating all from the palm of their hand. While not intended for diagnostic use, imaging can be securely shared directly from within the app to other physicians, administrators, and patients for enhanced communication and collaboration.",
  "reviews": [
    {
      "user": "mikewig",
      "date": "07/12/2024",
      "title": "Developer must be 2 years old",
      "review": "I’m 74 years old or 888 months old. That means I would have to tap more than 888 times to select my birth date to get this app to allow me to see my bulging apps. I’ve made my share of stupid mistakes and taken my share of hits for them. But never like this. Don’t you test your your apps? Where is your common sense? You must be an idiot or stupid. I’m freaking going out of my mind. No wonder we have astronauts stuck on the the ISS, door plugs falling out of airplanes, liars being elected to the presidency. What’s going on people. You really expect me to sit here tapping 888+ times to select my birthdate to birthdate to see my bulging discs. more"
    },
    {
      "user": "asrhjmnbvc",
      "date": "06/25/2024",
      "title": "Patient’s who can’t use Ambra, here’s how to have a great experience",
      "review": "As a patient, you can gain access to this program, but you need help from your participating health care program. Basically, you just need to have their records department share an old Ambra image with your email address. Then, sign in to your account by going through your health service (MyChart, for instance) then Test Results, get an automatic sign in link to view your imaging. Once you’re there, select all your imaging, and share them to your email address. Now that you have an Ambra account, and all your records are available through your Ambra account, all of your records will be available through this app. Note: After each new imaging, you’ll need to access Ambra through your health service account, through the Ambra portal, and then it’ll also be available. I’ve had to figure this all out through being diagnosed with multiple sclerosis, getting stable imaging results, and learning as much as I can. MRIs are paramount to the status of multiple sclerosis patients, and this app has earned 5-stars for me!! more"
    },
    {
      "user": "Catmomma19",
      "date": "04/09/2024",
      "title": "Image of CT",
      "review": "Zero stars actually given. Was unable to sign in on app or view ANY IMAGES OF EXAM. Just kept going in circles. I see why one stars have the largest number on reviews. As another person said, I was forced to give one star review because ZERO STARS wasn’t given as option. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "12.4 MB",
  "category": "Medical",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English"
}