{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Videos for POCUS: Ultrasound 17+",
  "subtitle": "+ medical search suggestions",
  "seller": "Usatine & Erickson Media LLC",
  "stars": "",
  "price": "Free",
  "appDescription": "+ SMART SEARCH SUGGESTIONS - EXCLUSIVE APP ONLY FEATURE! The Search tab only suggests words that appear in this content as you type to help spell long medical terms. This app contains the video library for Pocket Guide to POCUS: Point-of-Care Tips for Point-of-Care Ultrasound by McGraw Hill Education. Over 160 videos are available for quick access on your mobile device. No Internet connection needed to view the app after it has been downloaded. It is all ready for quick video and information retrieval. This app is optimized for whatever size device you are using, either phone or tablet. This app is easy to navigate, allowing you to browse the contents or search for topics. The search tool shows you suggestions that appear in the text as you type so it is quick and helps with spelling medical terms. It also remembers past search terms so you can go back to a topic very easily. You have the ability to create notes and bookmarks to enhance your learning. You can also change the text size for easier reading. Check out https://usatinemedia.com to learn more and watch a video demo of this app. Editors: Cameron M. Baston University of Pennsylvania Healthcare System Department of Medicine Christy Moore University of Pennsylvania Healthcare System Elizabeth A. Krebs Thomas Jefferson University Hospitals Department of Emergency Medicine Anthony J. Dean University of Pennsylvania Healthcare System Department of Emergency Medicine Nova Panebianco University of Pennsylvania Healthcare System Department of Emergency Medicine Disclaimer: This app is intended for the education of healthcare professionals and not as a diagnostic and treatment reference for the general population. Developed by Usatine Media Richard P. Usatine, MD, Co-President, Professor of Family & Community Medicine, Professor of Dermatology and Cutaneous Surgery, University of Texas Health San Antonio Peter Erickson, Co-President, Lead Software Developer more",
  "reviews": [],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "399.4 MB",
  "category": "Medical",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English"
}