{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Healthy Benefits Plus 12+",
  "subtitle": "Easy access to your benefits",
  "seller": "Solutran, Inc.",
  "stars": "4.6",
  "rating": "56.5K Ratings",
  "price": "Free",
  "appDescription": "This is a sponsored program. You must be an eligible sponsored member to register for Healthy Benefits+™. With the Healthy Benefits+ mobile app, you can access your benefits anywhere, anytime. You can instantly redeem your benefits on qualifying products with your card number or barcode when you checkout. It’s that easy! Healthy Benefits+ gives you easy access to the benefits you need to help you live a healthier lifestyle. With Healthy Benefits+, you can: • View your benefit balance • Review your shopping options • Browse qualifying items • Use your card number or barcode to redeem benefits • Review your transaction history • Update your account information Review your welcome materials or login to your program website for a full description of benefits and shopping options. more",
  "reviews": [
    {
      "user": "Fed up, stay away",
      "date": "04/13/2020",
      "title": "Not helpful at all, fed up\n\n    Developer Response",
      "review": "You can not use the card in Walmart stores at all, you must do a phone order or a mail order. Tried to order by phone first using the catalog sent with card after activating the card , operator could not find catalog number from the computer data base, gave up. Tried a second time by phone, catalog number were not in data base or out of stock, gave up. Tried mail order, order 6 items , received one item, now the app shows a balance $5.14, but no details about the order. So I do not know if there more items coming or not. Received a letter from Walmart, system overwhelmed . Something is wrong with all the 5 star ratings. This app is no use , it only shows balances, not items order or shipped. The app may show a balance, but there may be back ordered item that have not been shipped. April 2020, nothing has improved, Walmart still can not handle the business. Placed a mail order April 1st, I know we are in trying times, but I do not know if they received the order, the app is of no use, it will only show a balance, the app will never gave a brake down of items to be shipped or back order. Update: April 13, 2020, Received a conformation email from Walmart showing all item ordered( but one ) and the shipping dates, order coming in 4 separate packages over a period of 2 weeks. One item I ordered not showing up at all. more Hello there, thanks for taking the time to share your experience. You can view your transaction history by tapping Redeem at the bottom of the screen. After tapping Redeem, swipe to the bottom of the page and you’ll see a Transactions button. Tap the button, and you’ll be able to view your list of purchases. If you have any other questions about the app or your program, feel free to email us at healthybenefitssupport@solutran.com. We’d love to help! Thank you, Gary. more"
    },
    {
      "user": "mdsailmaster",
      "date": "05/30/2023",
      "title": "Donald Klapproth reaction to",
      "review": "Changing the number of people (1) allowed now on one email account is ridiculous as we have the same now on all other accounts like insurance and health / hospital accounts! (2)! Also since I have placed orders directly with health benefits before in this year why doesn’t it have my records attached with out membership numbers? Absolutely crazy!!! Also using off shore people for customer care matters when 98# of your members are old with hearing problems is another crazy and hurtful matter to seniors. You must be aware that these customer care people do all they can not hanging up after talking so we can’t give them low scores on our feelings after talking with them! 10 times last year they refused to hang up !We have a daughter in the same customer care phone field and it makes me more aware of customer care people’s feelings and dealings with customers! I’m Always friendly and Courteous ! If this situation doesn’t change for the better this year we ei be looking for a Medicare company that uses American People without Asian customer care sorbet can understand better American language. Their use of the military alphabet with their accents isn’t on many cases understandable for hearing impaired persons! Accents of all types is in Most cases not understood, period! more"
    },
    {
      "user": "Mbwilson42",
      "date": "08/05/2024",
      "title": "Needs fixed",
      "review": "It has lots of problems. Using it at the store especially at Dollar General. It won’t pay for all the things it’s supposed to. If they scan the card multiple times it usually works but now we are told that they can only scan it once according to new policy. Well that means we lose out and end up having to pay for most out of pocket. I have even ordered a new card recommended by your help number I called. Didn’t help. I thought that the purpose of the card was to help us make it through the month easier. I don’t have a lot of extra money each month living on a fixed income on disability. Dollar General is the only place in my county that takes the card. The closest other stores are like 30 mins away and I don’t get around that easy. ALSO your app needs fixing also. The transactions history tab doesn’t work anymore. That lets me remember what I have paid so far this month so I don’t forget anything. It now says “ error fetching data. Please check your network connection “ I redownloaded the app and didn’t help. Very frustrating. I really do appreciate the card for the help paying for stuff but PLEASE look into fixing. Maybe it’s a app program problem. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch",
    "Apple Vision"
  ],
  "size": "114.3 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information\n                Infrequent/Mild Alcohol, Tobacco, or Drug Use or References",
  "languages": ""
}