{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Baby Tracker by Nara 4+",
  "subtitle": "Track Feeding, Sleep, Diapers",
  "seller": "Nara",
  "stars": "4.9",
  "rating": "13.7K Ratings",
  "price": "Free",
  "appDescription": "Meet the Nara Baby Tracker! A fuss-free way for new parents to track baby’s health, activities and milestones while logging postpartum recovery and mood. Designed by a mom to track her own newborn’s activity, the Nara Baby Tracker is free (and ad free!). Its intuitive, calming design allows you to track naps, diaper changes, feeding schedules, wake windows, pumping and more. Seamlessly create routines while tracking baby’s progress and sleep patterns. Nara Baby makes it easy to coordinate and share across multiple parents and caregivers with complete privacy. The app is also built to track and compare multiple children or twins. Over 50,000 parents use Nara Baby every day to track, learn and grow alongside their babies Track breastfeeding & bottle feeding - Tap the breastfeeding timer to track left/right feeding; Nara notes which side ended the last feed - Track bottle feeding (formula or breastmilk) by time and amount - Record and track solids — dozens of first foods are already preloaded - Identify feeding patterns and create a feeding schedule - Upload photos and notes for any feeding session - Log breast pumping sessions with amount and duration - Use the pumping timer on each side for easy tracking - Not breastfeeding? Turn off any activity you don’t want to track Track diaper changes - Quickly record wet, dirty or dry diapers - Record diaper rashes with one tap - Accurately track bowel habits and share with your pediatrician - Seamlessly hand off childcare with the most recent diaper change recorded Track sleep patterns and naps - Use the sleep timer to record naps or nighttime sleep - Manually add sleep sessions with start/end times - See sleep patterns with automatic graphs and comparisons by day or week - Create a nap routine based on wake windows - Accurately record when baby starts sleeping through the night Track your baby’s growth & health - Record weight, height, and head size by date - Accurately track newborn weight gain - Track developmental milestones by age - Log medical records and medications - Record vaccines by date and add notes post-doctor appointment Create personalized routines & memories - Track routines like tummy time, baths, story time and more - Quickly see the day’s routine when switching caregivers - Record memories with the “Baby First” section; add notes and upload photos for baby’s first smiles, steps, teeth and more Track postpartum health & recovery - Log hydration, food and sleep to help support your recovery - Note your daily mood, from happy to anxious and everything in between - Write journal entries to keep track of the days and create memories - Add routines — like yoga, exercise or snacktime — to help with self-care - Share postpartum moods and health with partners and doctors Share across caregivers and multiple children - Invite partners, grandparents, and caregivers to your Nara Baby account - View baby’s recent activities when caregivers switch roles - Access the app from multiple devices, including your Apple Watch - Get personalized insights based your baby’s activity Here's what users are saying: “I tried 5+ different apps to track my baby’s feeds and diaper changes, and Nara is by far the best one. The app is simple, well designed, and functional.” Nina Vir “This app has EVERYTHING!!! Thanks Nara for delivering such a high quality app for parents to use.” TRUTHurtz209 “Tracking my twins’ feedings has been so easy with this app! Anything you want to track is there. So user-friendly and intuitive. I love that I can easily switch between babies and can add other family members as well!” KellieDVG “Love Nara! Tried after Ovia, The Bump, Huckleberry, and others. Can track across mine and my husband's phone. Super simple, clean and beautiful interface. The trends are awesome and make DRs visits simpler.” NotionSocratique Follow us on social: Instagram: @narababy Facebook: facebook.com/narababytracker TikTok: @narababyapp more",
  "reviews": [
    {
      "user": "KelseyEG",
      "date": "04/15/2024",
      "title": "Beautiful, Simple, and Quality\n\n    Developer Response",
      "review": "If you are looking for a simple way to track your baby’s feedings, diapers, and sleep plus your pumping output and record milestones, this is the best app out there. Not only is it aesthetically pleasing but it’s intuitive and practical. You can compare how things have changed in 1 day, 1 week, or 2 week chunks but it isn’t overwhelming. I was nervous that I would become too obsessive in tracking my baby’s feedings or sleep so this gives me just what I need to ensure he’s well fed and well rested. Bonus feature I didn’t start using until about 3 months in are the widgets! You can add multiple Nara Baby widgets to your Home Screen for easy access to the features you use the most. It’s so convenient to just look at my phone for a quick reminder of how long it’s been since he ate or how long he’s been asleep rather than opening the app each time. I also just had a wonderful experience with the app’s tech support. The widgets had frozen on me and were not updating so I wrote the developers an email detailing the issue. Didn’t really expect to get a reply but I was so desperate for what had become my favorite feature to work again that I took a chance. To my surprise, they not only responded to let me know they’d be looking into it but also emailed me when they released an update that would hopefully correct the issue! The widgets now work again and I’m a very loyal Nara Baby fan! more We're thrilled to hear about your positive experience with Baby Tracker by Nara! It's wonderful to know that the app has been helpful in tracking your baby's needs and milestones. Thank you for highlighting the convenience of the widgets and sharing your tech support experience. Your feedback truly means a lot to us. If you ever need further assistance, feel free to reach out. Happy tracking! more"
    },
    {
      "user": "k.katherine.s",
      "date": "04/20/2022",
      "title": "Baby and Mama tracking done right!\n\n    Developer Response",
      "review": "This app is gold. It has all the common activities you’d want to track for your baby done simply, beautifully, intuitively, and without fuss. I love that you can be as specific or as simple as you want, other apps won’t let you save an activity without filing out all the fields. As a second time mom, there’s plenty of times where the toddler distracts me from logging right away and getting some info entered later in the day is better than none! As others have mentioned, typing things in or just hitting start/stop is intuitive and easy - I’m never saying “how do I do this?” with this app! BUT what makes this app really special is the ability to track activities for mom. With my first baby, the baby blues quickly spiraled into Postpartum Depression because keeping myself hydrated, fed, and showered was easy to forget. While babies cry to remind you something’s forgotten, Mama bodies will just keep grinding until you’re so depleted you can’t get out of bed. Tracking myself along with baby in one place is simple and beautifully executed! There’s even the ability to track mom sleep (not that you have much control over it) but when you “wake up” from a night of 2 hour stretches b/c of a growth spurt, it’s easy to see why you feel foggy and short fused! Without a doubt I’m a better mamma because of the insight I get from this app! more Thank you so much for your glowing review! We're thrilled to hear that you find our app intuitive, easy to use, and helpful in tracking both your baby's activities and your own. We're glad that the app has made your life as a second-time mom much easier. If you have any questions or need further assistance, please don't hesitate to let us know. more"
    },
    {
      "user": "NikolaiLamparzyk",
      "date": "05/21/2024",
      "title": "An especially useful app for an especially demanding need!\n\n    Developer Response",
      "review": "I’m not even one for being on my phone much, but I’ve got to say it: the convenience and utility offered by Nara, being able to glance at timers and a calendar for a quick visual overview of where your baby is at, is so incredibly helpful by taking the stress out of having to otherwise keep track of everything manually in your head, while still having all of life’s other demands on your plate. Multiple caretakers also benefit greatly: my wife and I, even grandma for example; anyone added to the app can mark changes, feedings, naps, and more, while anyone with their phone can also see the updates in real time. It makes coordination so much easier. Lastly, you can see from the calendar view and other metrics how your baby grows and changes over time, to include their natural rhythms, when & how often they’re hungry, how & when they need naps and sleep, etc., to the degree that you can easily predict what needs are coming up next and how to fold them into your plans. TL;DR: this app greatly makes light the work of a parent’s job in scheduling and timekeeping for their baby. Eventually you’ll outgrow the need for it, but in the demanding early days especially, it is so massively handy and a habit worth investing the time into using! more We truly appreciate your detailed feedback and are glad to hear how the app has helped to streamline and simplify the demanding task of parenting in those early days! Your insights on the convenience and utility provided by the app for caregivers are invaluable. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch",
    "Mac",
    "Apple Watch",
    "Apple Vision"
  ],
  "size": "42.1 MB",
  "category": "Medical",
  "ageRating": "4+",
  "languages": "English"
}