{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "MoleCare 4+",
  "subtitle": "Mole Health Screening",
  "seller": "2AY Ltd",
  "stars": "3.6",
  "rating": "5 Ratings",
  "price": "Free",
  "appDescription": "MoleCare is a self-management app for those wishing to take control of their skin health, monitor and compare your moles, perform ABCDE Analysis MoleCare is a self-management app for those wishing to take control of their skin health. The primary goal of the app is to provide you with convenient and secure storage for photos of skin lesions that you wish to monitor. Learning more about skin health as well as performing regular skin self-exams are key activities that would help you look after your skin thoroughly and spot changes. MoleCare feature-set supports these activities. With MoleCare you can: - Monitor and compare your moles MoleCare allows to track moles as well as their characteristics i.e. bleeding, itching, crusting, multiple color, uneven, changed over the last 3 months, over a period of time and spot changes. - Perform ABCDE Analysis MoleCare allows you to compare individual moles in accordance with ABCDE analysis. • Body Appreciation Program, • establish a health and easy to follow routine which enables to experience the benefits of skin self-examination in full, • gradually become more aware of your skin and your body, • do skin self-exams with pleasure, • learn more about benefits of doing skin self-exams, • pdf report - Insights Insights view enables better visual control of your skin care progress. - Podcasts Meditation-alike podcasts will guide you through different parts of your skin and at the same will give you the opportunity to have these precious moments for yourself to be mindfully grateful for your unique body. - Learn more about skin health MoleCare supports a library of resources that can help you learn more about skin health and answers to intimate questions. We will appreciate any feedback and reviews to know what is important for you. Thank you and take the right step today towards a healthier future tomorrow!!! DISCLAIMER: Dear users, please seek a doctor’s advice in addition to using this app and before making any medical decisions. more",
  "reviews": [
    {
      "user": "Skysalla",
      "date": "02/12/2021",
      "title": "Almost good",
      "review": "I like the simplicity of this app. But it has some key features I feel are missing. -login does not persist. It’s a small thing. But annoying -cannot remove anything. I put a mole in the wrong category and can’t remove it. I also have a photo that loaded to the wrong mole and can’t remove that. -cannot rename anything. I’d like to fix a typo and cannot change the name of the mole. -cannot set photo date. I do appreciate that you can load previously taken photos. But you can’t set the date they were taken so it just shows them all with today. If all those things weren’t an issue I’d love this app. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "34.9 MB",
  "category": "Health & Fitness",
  "ageRating": "4+",
  "languages": "English"
}