{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Hims: Telehealth for Men 12+",
  "subtitle": "Hair loss, sexual health",
  "seller": "Hims & Hers",
  "stars": "4.8",
  "rating": "47.6K Ratings",
  "price": "Free",
  "appDescription": "Hims: Telehealth for convenient, quality care 100% online. Get access to best-in-class treatment for men's health concerns like hair loss, sexual health, weight loss, mental health, and skincare. Hair Growth: Regrow hair and stop hair loss with clinically proven prescription ingredients. Sexual Health: Improve your sexual health with personalized treatment and effective medications for erectile dysfunction, premature ejaculation, and other sexual health concerns from the comfort (and privacy) of home. Weight Loss: Prescription weight loss personalized to your lifestyle, eating pattern, health history, and goals so you can lose weight and keep it off. Mental Health: Manage stress, ease anxiety, and get depression help with trusted medication and professional support. Skincare: Put your best face forward with treatments for acne, wrinkles, and signs of aging. With the app you can enjoy the benefits of telehealth from anywhere. Get questions answered quickly (responses typically within 24 hours), manage your shipments, access exclusive men's health content, and more. Feel great through the power of better health, with Hims. Please note: Content in the Hims app is for informational purposes only and does not constitute medical advice. Consult with a healthcare provider for any questions about your treatment, medical condition, or need for medical advice. more",
  "reviews": [
    {
      "user": "Young Anderson",
      "date": "09/07/2024",
      "title": "WHAT THE WORLD HAS BEEN WAITING FOR | Hims hears us, & great patient care.\n\n    Developer Response",
      "review": "This is simply amazing, life changing for me. Hims holds a special place to me because in a world full of chaos and crooked insurance & medical care, Hims has changed the game. The ability to get treatment for my depression in an easy and friendly process with insanely affordable prices due to no insurance, I was able to get Depression medicine for a year for $350. That’s absolutely fantastic, less than $1 a day. All of this while still maintaining great communication and doing follow ups & LISTENING to their patients. And while doing this I was able to utilize some of their other products that are things that many of us ignore but Hims makes it so easy & stress free to get these very helpful treatments that tradition doctors make such a painful process to do so we just never go. help with depression, Better sex, better hair, BETTER LIFE! Even anti aging products as well to keep you looking and feeling great. I am very thankful for Hims and can’t even put a price tag on how helpful it has been for me, especially as someone with no medical insurance. If you have not tried Hims yet it’s definitely worth a shot to try and the agents and doctors really are helpful and do follow ups & allow you to manage your treatment and ACTUALLY LISTEN TO YOU! more Hey, Thanks so much for sharing your experience with us! You really made our day. If you need anything, we’re here to help you in any way we can! The Hims & Hers Team more"
    },
    {
      "user": "BillNRachel",
      "date": "08/01/2023",
      "title": "As advertised",
      "review": "I think that really sums it up. They offer certain medications for certain reasons. You tell them what you’re interested in, they ask you questions and if you qualify based on your answers then they send you the meds you ask for. If you want to change your prescription be it a different medication or a different quantity you can literally get on the app and it’s stupid easy. If you don’t have the bread to cover it at the moment you can just “snooze” the prescription, and then if you end up with the money later you can simply click “refill now” like I just did and you get your script soon after. I honestly don’t pay attention to how long it takes to ship but it seems fairly quick. I don’t remember ever feeling like I was waiting forever for them. Oh, and also you can chat with your medical provider at anytime though the app and I’ve never waited longer than a few hours for a response. Under normal circumstances you just get your little brown box in the mail and you don’t have to mess with anything but enjoying feeling better or giving it to your wife. The only negative I have… is that it seems expensive. I’m not really knowledgeable but it seems very expensive for the sort of thing it is. Surely it’s not that expensive to produce and provide, but what do I know. I’m a satisfied customer though, that’s a certainty. more"
    },
    {
      "user": "25AGAIN",
      "date": "10/05/2024",
      "title": "What Hims is Really About",
      "review": "I was not prepared for this, when I first heard about Hims. So if anyone is concerned about these guys, I know that I was, and I wish someone would have told me this when I was thinking about using them. First, and most importantly, these guys really are, 100%, a helpful, caring team of people who really, and I mean REALLY know their business. They are helpful, knowledgeable, caring and MOST of all, a team that works together to get you taken care of FAST. I don’t have a bad thing to say and I mean that with all my heart. I had an anniversary coming up and these guys got me what I needed a day before my anniversary, instead of the 2 weeks afterwards when it was originally scheduled. Thank you everyone there for everything you have helped me with. You have definitely made me feel much more comfortable in dealing with this situation. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch"
  ],
  "size": "86.8 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English"
}