{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Foundation Doctor Handbook 17+",
  "subtitle": "Surviving foundation years",
  "seller": "DOCTOR'S HANDBOOKS LTD",
  "stars": "5.0",
  "rating": "2 Ratings",
  "price": "$2.99",
  "appDescription": "Updated 2024 Survive the wards with key information to help you tackle common clinical scenarios Provides clear and succinct information to help UK Foundation doctors navigate some of the common clinical scenarios that they will face on the wards With an easy to use navigation and over 100 referenced documents, this is a must have app for any Foundation doctor ### FEATURES ### 18 ASSESSMENT documents: - Wide variety of presenting complaints - Assessment reminders in A-E format - Provides potential differential diagnoses to consider - Including: Chest pain, SOB, Low GCS, and more... 44 MANAGEMENT documents: - Management information for typical conditions and symptoms - Presented in easy to follow flow diagram / step-by-step format - Including: ACS, Acute asthma, Sepsis 6, Electrolyte disturbances, and more... 27 REFERENCE documents - Quick reference information regarding a range of clinical topics - Including: Radiology interpretation, ECG interpretation, Insulin and Antibiotic information, Basic anatomy, CSF / Joint fluid analysis, and more... 24 CALCULATORS - Commonly used medical calculators and scoring systems - Including: Wells DVT / PE, GCS, Creatinine clearance, HAS-BLED, CHAD-VAS, and more... ### USABILITY ### Easy to use navigation system, including favourite list and search function to help you find the key information fast All documents are downloaded into the app and are therefore available at all times ### CONFIDENCE ### The Foundation Doctor Handbook application provides academic references where possible and SHO, SpR and Consultant level doctors have reviewed its content ### LEGAL ### This application is designed for fully qualified UK based Doctors only. You must read, understand and accept the Disclaimer + User Agreement to use this application. This application requires and collects non-identifiable information for research purposes, including but not limited to: your grade, your trust and the documents you view. It does not ask for nor collect any identifiable information such as: name or email address. You must read, understand and accept the Privacy Policy to use this application. The Disclaimer + User Agreement and Privacy Policy are available at: http://www.doctorshandbook.com and we advise you review these before downloading this application. more",
  "reviews": [],
  "compatibility": [
    "iPhone",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "104.7 MB",
  "category": "Medical",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English"
}