{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Sydney Health 4+",
  "subtitle": "Anthem/Wellpoint",
  "seller": "Elevance Health, Inc",
  "stars": "4.8",
  "rating": "316.7K Ratings",
  "price": "Free",
  "appDescription": "Use the Sydney™ Health app to find care, share your digital ID card, and check your claims. You can understand your benefits, improve your health, and save money. Easily manage your benefits at your fingertips whenever you need them with your personalized health and wellness information all in one place. Through integration with HealthKit, you have the option to enable sharing information from your fitness devices with this app. This may include tracking your steps, calories, sleep data, and weight management. - Digital ID card – Your digital ID works like a paper ID, enabling you to always have access to your current ID and easily share it with your care team in person or by email. - Chat – Use our 24/7 chat to find what you are looking for, or find more in-depth answers by chatting with a Member Services representative. - Plan details – Understand your share of the costs, including your deductible and copay. Find out what’s covered and check your claims. - Find care – Search for care when and where you need it. Locate doctors, labs, hospitals, and other healthcare professionals in your plan’s network. See your estimated costs before you receive care. - View claims – Easily track your claims including the status and your costs. - Virtual care – Routine care, prescription refills, and urgent care right from your app, whenever it works for you. - Refill your prescriptions – You can set up automatic refills and reminders for your medications. Download Sydney Health to your device today. Sydney Health is offered through an arrangement with Carelon Digital Platforms, a separate company offering mobile application services on behalf of your health plan. ©2020-2023. The Virtual Primary Care experience is offered through an arrangement with Hydrogen Health. Sydney Health options are based on each member’s plan, so some features may not be available to all members. more",
  "reviews": [
    {
      "user": "JMATT79",
      "date": "04/30/2020",
      "title": "Fantastic & User Friendly\n\n    Developer Response",
      "review": "Sydney Health is an upgrade to the Anthem Anywhere App. It’s streamlined and interactive. It can be used at home or on-the-go and with the cute little Sydney interactive helper it makes the app kind of fun to use too. Anthem BCBS has definitely taken consumer feedback and improved their product. If your plan comes with pharmacy then the pharmacy is right there and you can order your scripts through the app as well as set up your auto refill/auto pay. You can save your payment information, view and print your ID card as well as fax or email a copy of your card to your doctor’s office BEFORE you arrive for your appointment. Finding a doctor is easy, searching claims is easy as well as keeping track of your deductible and out of pocket totals for the year. It’s got everything. I highly recommend the app. more Hello, thank you for taking the time to share your feedback with us. We're always happy to see our Members having the positive experiences they deserve. If you have any questions, or want to share additional feedback with us, let us know at Sydney@anthem.com. Thank you. ~ Sydney ~ more"
    },
    {
      "user": "Hadhighhopes898",
      "date": "01/15/2020",
      "title": "HSA Glitches All Day\n\n    Developer Response",
      "review": "I loved the Anthem website and used it all the time for Bill Pay with my HSA account. I downloaded this app and now it has taken 3 calls to Customer Service to get this basic task done. I needed to ‘pay myself’ with my HSA to resolve a balance this week with a provider so I can have a procedure done. I went through the normal steps on Friday January 10th. I log in yesterday and it says it was denied although I had more than enough in there. I tried it again, same transaction. Got all the way to the end screen saying “submitted”. Checked back about an hour later (typically when I do this, it takes the funds out of my balance within seconds), funds were all still there. I look in pending transactions and my recent bill pay submission isn’t there. I waited and checked back today- it’s like it never happened. This app allows you to go all the way to the submit screen, submit it, tells you you’re all set, but meanwhile is doing absolutely nothing. I called customer service and they were dumbfounded, telling me “oh if it said you submitted it then you did but I don’t see it here. Can you do it on the phone with me now? It should show up in real time.” I go through all of the steps for a third time, nothing shows up. No pending transaction. I have no HSA card or time to wait for one to be sent so I may have to move my procedure because of this weird glitch where it won’t let me do a basic task. more Hello Hadhighhopes898, we can understand why that would be frustrating. If you could, please email us your Username at Sydney@anthem.com, we want to assist you in getting this reviewed as quickly as possible. Thank you. ~ Sydney ~ more"
    },
    {
      "user": "PJ Abeyta",
      "date": "01/08/2023",
      "title": "Telehealth fails 90% of the time\n\n    Developer Response",
      "review": "The app doesn’t refresh accurately on iPhone or iPad. I waited one night and With 8 people ahead of me according to the app. Waited and got a text that said return to the app I’m next in line or they’re reviewing my information. And nothing happened. For an hour. So I was also logged out several times “for my security” I tried again. Now there’s 12 ahead of me. Fine. I commit. Then I notice the same thing happening as before. So, I navigate away and come back to the request an appointment page. Which then goes straight to the virtual waiting room and, lo and behold, there’s 4 ahead of me. So I start navigating away and returning back periodically, about every three minutes. This is the ONLY WAY I can make the app refresh. It it doesn’t end there. No. What do you think happened when I was texted to return to app? The same thing. No refresh. I’d try a few times and severely times I had to get back at the end of the line. Until finally, five hours later, I get into a virtual visit. The dr said my information shows up several times. But when they try to connect, “no one ever shows up”. I guarantee you, I was sitting there staring at the screen. I was struggling from Covid and needed someone to help. This app is terrible for that function. Terrible. more Hello, We're sorry to hear you had an issue with your virtual visit. If you could, please email us at Sydney@anthem.com with your name, ID # and a brief description of when your visit occurred. We would like to investigate this further! Thank you. ~ Sydney ~ more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch"
  ],
  "size": "128.4 MB",
  "category": "Medical",
  "ageRating": "4+",
  "languages": "English, Spanish"
}