{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Babyscripts myJourney 17+",
  "subtitle": "",
  "seller": "1EQ",
  "stars": "4.8",
  "rating": "7.1K Ratings",
  "price": "Free",
  "appDescription": "Babyscripts is the first-ever virtual care platform prescribed by healthcare providers to expectant mothers at the start of their pregnancy. The mobile app delivers custom content to patients, from their OB team, on a weekly basis to guide them through their pregnancy with practice-specific, provider-approved tips related to nutrition, exercise, and other behaviors that support a happy and healthy pregnancy. support@babyscripts.com THE BABYSCRIPTS MYJOURNEY APP (“APP”) PROVIDES ONLY INFORMATION, AND YOU SHOULD NOT RELY ON THE APP FOR PURPOSES OF MEDICAL ADVICE, DIAGNOSIS, AND/OR TREATMENT. IN ADDITION TO USING THE APP TO OBTAIN INFORMATION, YOU MUST SEEK A DOCTOR’S ADVICE PRIOR TO MAKING ANY MEDICAL DECISIONS. more",
  "reviews": [
    {
      "user": "GenevieveHodges",
      "date": "05/05/2021",
      "title": "10 stars!! Reliable and empowering",
      "review": "I don’t know what I would have done without Babyscripts! I felt safe knowing all the information had been pre-reviewed by my doctor. When I had questions or wanted knowledge during my pregnancy, the app was so reliable and provided what I needed. I wasn’t getting various answers from google or waiting on hold to speak to a nurse from my doctors office. Cannot say enough good things!!! If your provider doesn’t offer Babyscripts, you are missing out!!!! Providers- if you aren’t offering this to your moms, get with it! It’s 2021 in a post-pandemic world! more"
    },
    {
      "user": "K_Rymer",
      "date": "08/14/2021",
      "title": "Absolutely Amazing",
      "review": "10 stars and more . This app empowers pregnant women with resources and tools to be knowledgeable. Not only do they give you weekly updates , but you also get daily tips , advice or articles to read . They have a whole resource section to check out if you have a question or concern . I would recommend this to any pregnant mom or woman planning to be come pregnant! more"
    },
    {
      "user": "Stephaniesutkaa",
      "date": "03/10/2020",
      "title": "Horrific\n\n    Developer Response",
      "review": "Moved over to a new app mid pregnancy and of course the home screen doesn’t even load. Just says how many weeks I am up top, and loads forever, leaving nothing at the bottom. Also cleared out all of my weight data from before, so my graph for comparison is completely blank. In addition to this, on my “info” page my care team isn’t even listed and it just appears to be some random billing phone number for my hospital in another state with no additional place to get help. The other app was fine and if they wanted a makeover I feel like updating the old app would make the most sense. Luckily I have another app for my care team but I liked babyscripts because it kept me updated on growth and tips for each week. more Thank you for your feedback, and congratulations on your pregnancy! It sounds like the app upgrade might have a glitch specific to your phone that we would like to resolve for you. We will be reaching out directly to learn more and get this fixed for you! more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Apple Vision"
  ],
  "size": "56.5 MB",
  "category": "Medical",
  "ageRating": "17+\n                Infrequent/Mild Medical/Treatment Information\n                Unrestricted Web Access",
  "languages": "English"
}