{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "SimplePractice Client Portal 12+",
  "subtitle": "Access your care with ease",
  "seller": "SimplePractice, LLC.",
  "stars": "4.9",
  "rating": "5.9K Ratings",
  "price": "Free",
  "appDescription": "If you’re receiving services for behavioral health, counseling, speech pathology, occupational therapy, physical therapy, or any other wellness service by a practitioner who uses SimplePractice, this app is for you! The SimplePractice Client Portal iOS app empowers you to manage care for you or your loved ones from one secure place. Stay connected with your practitioner between appointments from the convenience of your phone. Your personal information is kept private, yet easily accessible for your convenience. Simplify how you access care with features like: • Passwordless login – Securely log into your Client Portal without the hassle of a username or password by setting up a passcode, touch ID, or Face ID for instant access. • Personalized notifications – Get push notifications sent right to your phone regarding any new messages, invoices, or documents that have been sent to you by your practitioner. • Secure messaging – Message your practitioner directly from your phone knowing that all communication is secure and private. • Upcoming appointments and requests – View all your upcoming appointments, and request a new appointment with your practitioner directly from the app. • Digital payments – Add new payment methods to pay your bills including HSA and FSA cards. You can even pay directly from the app. • Digital paperwork – Complete documents and questionnaires related to care on your own time. • Telehealth – Join virtual appointments with your practitioner directly from the app, so you never have to find a link buried in your inbox again. • Appointment directions – Get automatically transferred to your preferred mobile navigation app for easy directions to your practitioner’s office. • Profile switching – Quickly toggle between any Client Portal you’re managing—whether you’re seeing different providers who use SimplePractice for practice management or are managing care for multiple individuals. To access the SimplePractice Client Portal iOS app, you must be invited to use the SimplePractice Client Portal by your practitioner. When you first log into the app, the email you provided to your practitioner will be used to authenticate your Client Portal access. After you’ve signed up, turn on Face ID, Touch ID, or a four-digit passcode for hassle-free login. Please note: what you can see and do within the SimplePractice Client Portal app may vary, and is limited to the specific features your practitioner has enabled for your profile. Are you currently looking for therapy services? To find a behavioral health therapist that uses SimplePractice near you, visit www.meetmonarch.com. more",
  "reviews": [
    {
      "user": "super psych",
      "date": "11/21/2023",
      "title": "Helpful and pleasant graphics too",
      "review": "I’m a clinician and just tried using the application for clients to get acquainted so that I can recommend it. I’m impressed with the ease of use and did not find any of the problems mentioned in the reviews about slowness or messages not going through and I was able to request an appointment and also cancel it easily. And on my clinician side I saw things come through quickly and now that I’ve tested it myself I will recommend it and give it five stars! I’ve been using SimplePractice for about five years for my notes and scheduling and Medicare billing. I can get personal help when I have difficulties with billing or anything else from simple practice staff. I don’t use it for any other billing because I don’t take any other insurance and I handle my cash payments through QuickBooks. more"
    },
    {
      "user": "Cruder Buddy",
      "date": "09/23/2024",
      "title": "Love the app!!!!!",
      "review": "My favorite part is after the appointment and a new appointment is made before I hang up that information is in the app, so I can reference it at any time. I can leave a MESSAGE ONLY by text For my provider at any time of the night or day 24 seven, not for emergencies, but only so the information is there, the next time you provider accesses my file they can respond at that time. PLEASE NOTE: IF THIS IS AN EMERGENCY CALL 911 IMMEDIATELY… DO NOT LEAVE A MESSAGE!!! It is so nice that if an appointment needs to be changed or canceled it can be done right there on the app. It is so nice that any forms, mood, charts, or any review of what’s been happening since your last visit is there and waiting, and better yet it reminds you prior to your appointment there forms to be completed. DID I MENTION I LOVE THIS APP? more"
    },
    {
      "user": "k.Wil7",
      "date": "06/13/2024",
      "title": "Ease of Use\n\n    Developer Response",
      "review": "I enjoy the ability to communicate via the chat function and have everything I need in one place with push notifications (appointment schedule, bill pay, joining a session, and all documents/related updates as needed). The request appointment function does not work though, it would be nice to be able to see the available schedule of your therapist and request a time slot for approval/alternative time & date. Overall my experience thus far has been great for keeping track of everything in one location. more Thanks for your feedback. We recommend approaching your provider about access to online appointment requests from the app. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch"
  ],
  "size": "128.2 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English"
}