{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "AdventHealth 17+",
  "subtitle": "Health Care at Your Fingertips",
  "seller": "Adventist Health System Sunbelt Healthcare Corp",
  "stars": "4.6",
  "rating": "18.6K Ratings",
  "price": "Free",
  "appDescription": "AdventHealth's app offers a range of helpful features. See a doctor wherever you need one, no matter the time of day. Receive lab results in your pocket, renew prescriptions from the comfort of your couch, pay your bill conveniently and have your medical records at hand. You can even book an appointment while watching the big game. A growing number of Primary Care Patients can chat with a Care Advocate to assist in many areas related to their health journey. Document your progress using the Health Journal or Health Tracking feature. Care Advocacy integrates the AdventHealth App with Apple Health Kit. With AdventHealth’s easy-to-use app, getting care on your terms is simpler than ever. Get the cure for the common app. more",
  "reviews": [
    {
      "user": "mkf51",
      "date": "03/01/2024",
      "title": "My Experience Was Life Saving\n\n    Developer Response",
      "review": "With my prior 2 years experience with heart problems and multiple procedures and test, my aortic valve was discussed multiple times! I was told it wasn’t ready for replacement! After a hospital stay in December 2023 I was released from the hospital with shortness of breath and fatigue/weakness and edema in my legs symptoms! My insurance authorized home care nurse and physical therapy. After several weeks my progress was minimal and the shortness of breath and edema had gotten worse! At that point my home care nurse called my nephrologist with concerns of my well being. I was told to go directly to hospital ED and she, the nephrologist , would meet me there! After a couple of test it was determined I needed my aortic valve replaced! I was admitted to Advent Hospital Pepin Heart Institute for the surgery. After a weekend of dialysis I was cleared for surgery and the results were a miracle! Now 30 days after TAVR surgery I’m feeling better everyday and currently attending Advent Cardiac Rehabilitation and I’m up to 2 miles on my goal of 3 miles a day in the near future! Feeling better than good and thankful to God, my Doctors, Nurses, Technicians at Advent Hospital for saving my life! God is Good!🙏 more We are delighted to hear about your remarkable journey to recovery and the outstanding care you received at AdventHealth. Thank you for sharing your inspiring story with us! more"
    },
    {
      "user": "Rajeci93",
      "date": "08/04/2024",
      "title": "Winter Park Hospital",
      "review": "I was admitted due to a fall in August 2024 and the care I received was phenomenal from the minute I walked in, everyone was attentive and helpful trying to ease my concerns. Once I was admitted to a room I was quickly taken for the required test and monitored every hour. I saw many people, doctors, nurses and specialists but one nurse was absolutely amazing. Her name was Kendra and I honestly have never met a human who was attentive, calm, patient and kind as her. She checked on me kept me informed on my status got me food early because I had not eaten anything and while I took a shower she changed my bedding. During discharge she told me what to look for and things in my labs I should follow up on. She was the sweetest caring nurse I have ever met and truly helped me during that very scary situation. I thank everyone who I came in contact with those two days I was there but she will forever be in my heart for the care she provided me. more"
    },
    {
      "user": "ItsMe777_777",
      "date": "02/16/2024",
      "title": "App crashes and kicks me out upon signing in\n\n    Developer Response",
      "review": "App has improved tremendously with new capabilities and performance. HOWEVER, ver 3.1.1 (and previous versions) crashes upon signing in. Tried with and without faceid, same. Uninstalled and reinstalled app, would work and look at me sign in only to run into the same problem again. No issue logging in on the website/patient portal with same credentials. Add to Calendar from appointments/upcoming visits doesn't work. I recall it working in previous versions (?) It would ask me to allow Calendar access in iPhone settings, but the app doesn't show any Calendar to turn on. Running iOS 17.3.1 latest at time of this review. iPhone 12 Pro Max. I'm off to uninstall and reinstall the app, again! ☹️ ***************€* UPDATE: After submitting my review, I've decided to peruse version notes. Sure enough the previous version (3.1 I assume?) was to fix the login crash. Many users report app still crashing at login with latest 3.1.1 version. Good news I'm not alone. This should be fixed for good ASAP. Without being able to log in makes the whole app useless needless to say! more We're happy to hear that you've noticed improvements in the app's capabilities and performance. We apologize for the inconvenience you're experiencing with the login crash on version 3.1.1. Our development team is actively working on a solution, and we appreciate your patience as we address this issue promptly. Thank you for your valuable feedback! more"
    }
  ],
  "compatibility": [
    "iPhone",
    "Apple Vision"
  ],
  "size": "220.8 MB",
  "category": "Medical",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English, Arabic, Danish, Dutch, Finnish, French, German, Norwegian Bokmål, Spanish, Swedish"
}