{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Skin-Check 12+",
  "subtitle": "Democratizing Early Detection",
  "seller": "Skin Check Inc.",
  "stars": "4.6",
  "rating": "295 Ratings",
  "price": "Free",
  "appDescription": "SkinCheck is a free triage tool to allow anyone to check their lesions for skin cancer*, track their lesions over time, and compare their lesions to an index of different cancerous and non-cancerous lesion types. * Skin lesion image analysis limited in the U.S. and select regions. According to the Skin Cancer Foundation, two people die every hour from skin-cancer in the U.S. alone. The hope for my app is to bring down this alarming statistic by letting users know if their moles are concerning and recommending them to seek treatment. Disclaimer: SkinCheck app does not provide medical advice, diagnosis or treatment. The assessments provided are heavily dependent on the quality of the image. If you have any concerns you should see a certified doctor. Our Terms Of Service are defined by Apple's Standard: https://www.apple.com/legal/internet-services/itunes/dev/stdeula/ Our Privacy Policy can be found here: https://docs.google.com/document/d/1YG0xHpPRhJ1fnMtlE6lnj7EvIfC0B-ff/edit?usp=sharing&ouid=107249345779631537731&rtpof=true&sd=true more",
  "reviews": [
    {
      "user": "LavenderLover2468",
      "date": "04/02/2024",
      "title": "I love using this for my dad with skin cancer",
      "review": "Skin check is an app that I’ve loved using for 3 years now! Watching it grow into a full company has been amazing because I’ve believed in the vision! Keep up the hard work because me and my father who has skin cancer love to check in weekly to see when he needs to get it removed! more"
    },
    {
      "user": "donutmuffin",
      "date": "01/15/2024",
      "title": "Love the app!",
      "review": "Even though my region is US so I couldn't fully use a diagnosis function I still found the AI detection and follow up options really helpful!"
    },
    {
      "user": "paullital",
      "date": "11/16/2019",
      "title": "This app literally saved my teachers life.",
      "review": "I introduced this app to one of my teachers he was a bit unconvinced but then decided to try it. The results came out as skin cancer, he of course didn’t believe it so he went to get it checked out, and it turned out to be true. He got it removed before it got any worse, I am thankful we caught it early. This app is like my hero. Thank you. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "Apple Vision"
  ],
  "size": "111.9 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "French, German, Italian, Portuguese, Spanish"
}