{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "FreeStyle Libre 2 - US 4+",
  "subtitle": "Flash Glucose Monitoring",
  "seller": "Abbott Labs",
  "stars": "2.4",
  "rating": "4.5K Ratings",
  "price": "Free",
  "appDescription": "This app is only for use with FreeStyle Libre 2 System Sensors. ◆◆◆ The world’s #1 CGM takes diabetes management to a new level. [3]: SMALL AND DISCREET: Remarkably small and discreet Sensor NO FINGERSTICKS: Unsurpassed accuracy, for adults and children [2],[4] ALARMS: Optional real-time glucose alarms, along with an urgent low glucose alarm, alert you of highs and lows so you can take action [1] ◆◆◆ COMPATIBILITY Compatibility may vary between phones and operating systems. The FreeStyle Libre 2 app is only compatible with FreeStyle Libre 2 Sensors. Learn more about compatibility at https://freestyleserver.com/distribution/fxaa20.aspx?product=ifu_art41556_202&version=latest&os=all&region=us&language=xx_yy BEFORE STARTING YOUR SENSOR Before you start your Sensor, choose whether you want to use the reader or the FreeStyle Libre 2 app. If you are using the FreeStyle Libre 2 Plus sensor with an Automated Insulin Delivery (AID) System, do not activate your sensor with the FreeStyle Libre 2 app or reader. Please visit your insulin pump manufacturer's website for specific activation instructions.which device you want to use. Alarms and glucose readings can only be received on your phone or your FreeStyle Libre 2 Reader (not both). [1] To receive alarms and glucose readings on your phone, you must start the Sensor with the FreeStyle Libre 2 app. To receive alarms and glucose readings on your FreeStyle Libre 2 Reader, you must start the Sensor with your Reader. Note that the FreeStyle Libre 2 app, Reader and your Automated Insulin Delivery (AID) system do not share data with each other. When not using an AID, for complete information on app or Reader, scan your Sensor every 8 hours with that device; otherwise, your reports will not include all your data. You can only upload and view data from app and reader on LibreView.com. ◆◆◆ APP INFORMATION The FreeStyle Libre 2 app is intended for measuring glucose levels in people with diabetes when used with a FreeStyle Libre 2 System Sensor. For more information on how to use the app, refer to the User’s Manual, which can be accessed through the app. Consult a healthcare professional to confirm if this product is right for you or if you have questions about how to use this product to make treatment decisions. The circular shape of the sensor housing, FreeStyle, Libre, and related brand marks are marks of Abbott. Other trademarks are the property of their respective owners. For additional legal notices and terms of use, go to http://FreeStyleLibre.com If you are using the app, you must also have access to a blood glucose monitoring system as the app does not provide one. [1] Notifications will only be received when alarms are turned on and the sensor is within 20 feet unobstructed of the reading device. You must enable the appropriate settings on your smartphone to receive alarms and alerts, see the FreeStyle Libre 2 User’s Manual for more information. [2] FreeStyle Libre 2 User Manual [3] Data on file, Abbott Diabetes Care. Data based on the number of users worldwide for FreeStyle Libre family of personal CGMs compared to the number of users for other leading personal CGM brands and based on CGM sales dollars compared to other leading personal CGM brands. [4] Fingersticks are required if your glucose alarms and readings do not match symptoms or when you see Check Blood Glucose symbol during the first 12 hours. ◆◆◆ Before using the app, review product labeling and the interactive tutorial at https://www.freestyle.abbott/us-en/support/overview.html#app2 To resolve any technical or Customer Service issues you are having with a FreeStyle Libre product, please contact FreeStyle Libre Customer Service directly at 1-855-632-8658. more",
  "reviews": [
    {
      "user": "Tlna C",
      "date": "05/22/2022",
      "title": "Loved the app in the former version\n\n    Developer Response",
      "review": "This is crazy! The old sensors are discontinued, so I had to get the new one. I thought the problems I read in the other reviews were probably not going to be an issue because my sugar is pretty stable. No hi-low alarms for me… well I hate to say that alarm still goes off randomly and at the most inopportune times! I was in a meeting and got a little too far away from my phone. By the time I got to get into the app and stop it, the alarm had gone off 4 times! And when I use the word alarm, I mean it. It is very loud, ear-piercing and startling, not just annoying. That’s great if it’s saving somebody’s life, but utterly ridiculous for me at this point. That being said, in setting you can (supposedly) shut off the alarm for when your Bluetooth cannot connect, like when you’re too far from your phone. So I did that, but it still alarms sometimes for no good reason. No trouble with my sugar, and no identifiable reason for an alarm. !_! Problem is, I’m stuck. At least for the month, since I already paid for two new sensors. And one more thing, this one is reading consistently higher than the other one did, and I have not changed my very strict diet. I know it’s not accurate enough to make treatment decisions based on this sensor, but it’s still disturbing. We’ll see what my next blood test says. In the meantime I just keep using this sensor and hope it doesn’t startle me into having a wreck while driving. RANT OVER more Thanks for the comment. We'll need more information to help with this issue, so please contact our Customer Care team at 855-632-8658. more"
    },
    {
      "user": "Thomas Buboltz",
      "date": "01/21/2024",
      "title": "Alarms don’t work while app is closed and drains battery quickly\n\n    Developer Response",
      "review": "As someone who is blind, this is a great app, but I haven’t even used it for 24 hours and the alarms are annoying which isn’t that bad because you can just turn them off. however, the real problem is the fact that you need to constantly run the app in order to receive those alarms and there’s no way to run the app’s alarm feature in the background or more specifically, while the app is closed. I don’t know if it’s normal for the sensor to lose its signal with your phone while the app is closed but it makes no sense why the app has to run to stay connected to the sensor and receive alarms and within the first 24 hours of attaching the sensor to my arm, it lost its signal 3 times Plus, having the app always running will just drain your device’s battery quicker which I don’t appreciate due to the fact that I have an older iPhone model. you need to fix the app so that you don’t need it to constantly run just to be able to use the alarms. I mean most GPS apps allow and give you the option to use your location while the app itself is closed. So, why can’t you just receive the alarms while the app is closed? It’s so annoying that I have to charge my phone even more now because of this app draining my battery while open. more Thanks for the comment. We appreciate hearing from you. more"
    },
    {
      "user": "hhetzel4kd",
      "date": "12/11/2021",
      "title": "Needs Improvement\n\n    Developer Response",
      "review": "This app is supposed to help improve my blood sugar by constantly monitoring it, but it actually makes it worse. Let me tell you why. Unless you turn the sensoring off all together, it would obnoxiously allow. I understand it’s for my health, but I can not have this thing beeping and going off so annoyingly all the time. I have work, I go to church, I need to sleep. There are lots of places where I can’t just have this thing beeping. You do realize that if I’m high, and I do a correction it takes time for my blood sugar to come back up. But it’ll keep going off, it’ll keep saying I’m high even though I already corrected it. So I just turn it off and then forget to turn it on and miss being more accurate in my blood sugar because this thing is so annoying. Me and both my 2 diabetic friends have talked about it, we all turn it off until we need to test again. If I got a nice silent notification that my blood sugar is high, I would correct it. Vs not knowing at all for an extra 3 hours because I turned it off. There NEEDS to be a setting to turn off the sound and still get notifications. Stop trying to control us so much that this thing has to beep so loud and so obnoxiously when we’re not in target and just make it like a text message so we can choose wether it’s completely silent, vibrates, or alarms. Because I promise you’re doing more harm than help. more We're sorry to hear this. Please contact our Customer Care team at 1-855-632-8658 so we can better assist. more"
    }
  ],
  "compatibility": [
    "iPhone"
  ],
  "size": "52 MB",
  "category": "Medical",
  "ageRating": "4+",
  "languages": "English, Spanish"
}