{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "WatchPAT 17+",
  "subtitle": "",
  "seller": "Itamar Medical",
  "stars": "2.6",
  "rating": "202 Ratings",
  "price": "Free",
  "appDescription": "WatchPAT™ONE product is a used as a diagnostic aid for the detection of sleep related breathing disorders. Caution: Federal law restricts the WatchPAT™ONE device to sale by or on the order of a licensed healthcare practitioner. Please use the WatchPAT™ APP only if you were provided with the WatchPAT™ONE device through a licensed healthcare practitioner. Please seek a doctor’s advice in addition to using this APP and before making any medical decisions.",
  "reviews": [
    {
      "user": "JJ 826",
      "date": "05/04/2022",
      "title": "Tried but it kept waking me up",
      "review": "I really tried to do this test last night, the finger monitor was so tight on my finger that it actually hurt and kept waking me up, I tried to put it on different finger within just a few minutes I had indentation on the other finger to. So I waited for awhile without it on put it back on maybe slept for an hour and woke up hurting again so I don’t even know if this worked for me but I’m not going to try it again if it didn’t bc I took photos of both fingers and will show and speak with my doctor about it. Wish everyone luck that it doesn’t happen to you as well. more"
    },
    {
      "user": "Jmmercer",
      "date": "03/06/2024",
      "title": "Easy to use, results transmitted without issue",
      "review": "Test was transmitted without a hitch. Attaching the sensors was easy. Pairing the device went flawlessly. Not really sure what all the negative reviews are about. I didn’t have a single issue. No discomfort. I just followed the instructions which were clear and easy to follow. 💁🏼 I checked in with Lofta to make sure everything got to them as I’ve read several reviews the test information did not send. They received it without issue. I got my test results from a sleep doctor in less than 12 hours and a full personalized recommendation. It was easy to understand. I requested my prescription and it was password protected and emailed to me, again within 12 hours. I really can’t speak enough to the level of care I’ve received. A few tips. If you follow the instructions to the letter, you won’t have any issues. Go step by step. If at any point the device isn’t working, contact Lofta. Their customer service is awesome. Be patient with the technology. Make sure it’s connected (green light) and that the watch is not too tight. Attach the sensor on your chest with some medical tape. Don’t put the finger with the sensor over your head or higher than your heart and you won’t have discomfort/throbbing. Be patient. Relax. more"
    },
    {
      "user": "just like i said",
      "date": "03/27/2024",
      "title": "Works like it should",
      "review": "This has been a bank saver and what I mean by that is I didn’t have to go spend 1,000 to 5,000 taking the sleep test. I’ve seen a lot of bad reviews, far as their finger being sore (unbearably). As a 6 foot 300 pound man with bigger than normal fingers, I did not have the same experience as most. Am not telling you your finger won’t be a little sore when you take it off, it was sore for maybe 45 minutes but it was nothing to get on here and write a bad review about it. After taking the test, my results were in and I had an appointment scheduled the next day to talk with someone. If you or someone that can follow directions fairly well this test is for you. If you take it upon yourself thinking you know best with every situation, you should probably go and see a specialist. Best thousand of dollars I’ve saved yet! more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "96.8 MB",
  "category": "Medical",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English, Arabic, Danish, Dutch, Finnish, French, German, Greek, Hebrew, Italian, Japanese, Latvian, Norwegian Bokmål, Polish, Portuguese, Romanian, Russian, Slovenian, Spanish, Swedish"
}