{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Cardiac Trials 17+",
  "subtitle": "Sharim's Cardiac Trials",
  "seller": "Justin Sharim",
  "stars": "4.7",
  "rating": "46 Ratings",
  "price": "$4.99",
  "appDescription": "Cardiac Trials is an educational tool that aggregates landmark clinical trials within cardiology at your fingertips. The hallmark of Cardiac Trials is its organization: the application organizes clinical trials by discipline and furthermore by subject matter within each discipline, allowing quick access to bite-sized morsels of practice-changing clinical trials within seconds. Cardiac Trials is a must-have for clinicians in-training: fellows, residents, students, but can be used and studied at any level. Constantly updated, Cardiac Trials strives to reflect both historical and the most up-to-date clinical trials published to date within the field of cardiology. more",
  "reviews": [
    {
      "user": "Dr CJJ",
      "date": "09/19/2019",
      "title": "Valuable resource in training or in practice.",
      "review": "Such a thorough and up to date resource to quickly find evidence based data so well organized and accessible immediately. I have been in medical practice for over 30 years and have relied on periodically reading articles, attending CME courses to stay current but with the large amount of data and trials it is difficult to be keep up. When in doubt I further have to further research the particular topic. This brings it all together in a very well organized format with both landmark historical as well as the most up-to-date trials. Not only is this app going to be a timesaver but knowing that you can have access to this valuable data at your fingertips will add additional level of confidence when making critical medical decisions. All clinicians in training or in practice can benefit greatly by including this app in their armamentarium. more"
    },
    {
      "user": "jadens2626",
      "date": "11/20/2021",
      "title": "Well organized and up-to-date!\n\n    Developer Response",
      "review": "I hardly ever buy apps, but bought this last week at the recommendation of a friend - and already using it everyday. So well organized and up-to-date. Love how it includes trials just recently published. Wish I downloaded sooner. more Thank you for your review. This is exactly why this app was created. Here’s to spreading evidence-based medicine worldwide 🌎 more"
    },
    {
      "user": "Gtd man",
      "date": "11/21/2022",
      "title": "Incredible App",
      "review": "Cardiac trials is an incredibly unique app. I found myself referencing it constantly while on CCU and cardiology consult services. It helped me stand out and really impress our faculty at our program. I will definitely be using this app in the future. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "27.7 MB",
  "category": "Medical",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English"
}