{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "scanoma - mole check 12+",
  "subtitle": "snap'n save the skin you're in",
  "seller": "Scanoma Pty Ltd",
  "stars": "4.7",
  "rating": "923 Ratings",
  "price": "Free",
  "appDescription": "1. Scan your mole with scanoma 2. Get an idea if it looks like a suspicious mole 3. Send the scan to a dermatologist • 100% Anonymous • No ads • No subscriptions Worried about a mole? A skin blemish that's changing color or appearing to grow in size? Scanoma checks your moles, tells you if your image resembles confirmed skin cancer images, and connects you with trained dermatologists for a professional second opinion. With the power of computer vision and the expertise of licensed medical practitioners, scanoma helps your learn about skin issues and get feedback on worrisome skin problems. Simply snap a picture of your mole and then send it to a scanoma doctor for a checkup. With scanoma, get a free diagnosis with our AI algorithm trained from thousands of images and get a second opinion from a trained dermatologist from the privacy of your home and using your iPhone. Detect skin cancer risks today. Take care of your skin and make sure you get it checked often with scanoma. Support: support@scanoma.com DISCLAIMERS ------- - Scanoma does not replace a human doctor. Computer vision is not 100% accurate. scanoma tells you if your image looks like a regular mole or skin cancer based on similar confirmed patient images. - Results are only applicable to moles. (a picture of anything other than a mole will not provide reliable results. (birthmarks, various objects, things that are not moles) - The free scanoma AI exam does not replace physical evaluation of skin cancer by a trained doctor. If in doubt, connect with a dermatologist on scanoma for a second opinion (consultation fee), or have your skin issues physically checked by a local dermatologists. - scanoma works best with clear, unobstructed skin images. At this point scanoma does not work with tattooed skin. - scanoma works best with push notifications enabled. Make sure scanoma notifications are enabled by going to settings-> scanoma -> allow notifications -Scanoma is not suitable for children. If you child is under the age of 13, please visit a paediatrician for a diagnosis. For feedback and questions send us an email to: support@scanoma.com more",
  "reviews": [
    {
      "user": "drdrace",
      "date": "10/31/2021",
      "title": "Helped save my life\n\n    Developer Response",
      "review": "Scanoma labeled my lesion 83% concerning. I paid the $20 to have their dermatologist confirm. They got back to me overnight confirming it was indeed concerning and to get it biopsied with sufficient margins. The dermatologist I saw in person wasn’t aware of Scanoma and said he wouldn’t trust an app and that I should be more worried about another lesion I had. He therefore biopsied both but only the one Scanoma predicted concerning came out a malignant melanoma stage 0. To be fair, I didn’t use Scanoma to scan the other one, but still, the app held its own! I caught the cancer in time, so it’s no exaggeration to say the app helped save my life. I’ve also used the app’s predictions as evidence to push for getting the best post-diagnosis care possible. PSA: Please search for IMPACT Melanoma for more information on what to do if you’re ever in my situation and never continue with a general/cosmetic dermatologist if you get diagnosed with any type or stage of Melanoma. Foundations such as the American Cancer Society, National Skin Foundation, Aim at the Melanoma, and IMPACT melanoma, all recommend seeing a melanoma specialist after a melanoma diagnosis because it is critically important. more Thank you for your detailed review and PSA to potential patients. Wishing you all the best, The scanoma team. more"
    },
    {
      "user": "eagles34?!",
      "date": "05/27/2023",
      "title": "Fast, easy, and helpful for anxiety\n\n    Developer Response",
      "review": "As someone with health anxiety, I downloaded this app last night because of a spot on my lip that hasn’t went away for months. Everyone in my family said it was fine but I still have an appointment scheduled with a dermatologist in a month. For me, waiting a month was too long and I was far too anxious to wait so I decided to pay the $29 for some peace of mind while i wait for my derm appt. The AI said my picture was possibly concerning with a confidence of 63%, and the doctor quickly responded to the image letting me know that the lesion showed no signs of cancer and wasn’t concerning. They still recommended I see a doctor (with which I will) and monitor it for changes. This app did a tremendous job soothing my health anxiety until I see an in person doctor. Thank you!! more Thank you for your review and you’re very welcome. If we can help you with anything else, please don’t hesitate to reach out to us at any time. more"
    },
    {
      "user": "Courtney4367732",
      "date": "09/30/2024",
      "title": "Cannot get camera to focus",
      "review": "Having already had melanoma and surgeries for them both, I am trying to find a way to keep track of these between 3 month check-ins. Unfortunately, I cannot get the camera to focus at all no matter what I do or what lighting is used. It’s very frustrating because I have two places that look like my past melanomas, but the camera won’t pick up the multiple colors within the lesion or the irregular border. In the pictures, they look like normal freckles. If you have a history of melanoma, just save yourself the trouble and try to get to the dermatologist. Unfortunately, I am the caregiver of a disabled child who is in and out of the hospital, so that’s not that easy for me to go as often as I need. I will check back in a few weeks and see if they’ve updated the app. I see I’m not the only one who has this problem after reading through reviews. It’s not my phone either; I can take very clear pictures with my camera. Unfortunately, you can’t upload anything to this app. That is frustrating as well. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac"
  ],
  "size": "80.2 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English"
}