{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Prepry - ARDMS & CCI Exam Prep 4+",
  "subtitle": "Ultrasound Registry Review",
  "seller": "Imago AI LLC",
  "stars": "4.8",
  "rating": "2K Ratings",
  "price": "Free",
  "appDescription": "Ace your ultrasound registry exams with Prepry! 30K+ success stories, 4000+ Questions, SPI Video Review, Study smarter, anytime, anywhere. Boost grades & confidence. Prepry was created by experienced sonography educators and practicing sonographers who understand the struggle and pressure of ultrasound students just like you. We have helped more than 30,000 ultrasound students prepare for the ARDMS® SPI and specialty exams, CCI® Exams and boost their class grades. With our proven Space Repetition algorithms, you can be confident you are getting the most out of your study time. Use Prepry to study anywhere, anytime… even offline! The content is updated frequently to ensure you have the most current information available. Get started today and be ultrasound ready! 4,400 QUESTIONS: ARDMS SPI Ultrasound Physics: 810 Vascular Sonography: 700 Abdominal Sonography: 500 Obstetrics and Gynecology Sonography: 340 Pediatric Sonography: 220 Breast Sonography: 170 Adult Echocardiography: 560 Fetal Echocardiography: 170 100's of Ultrasound Anatomy Images VIDEO REVIEW COURSE: ARDMS SPI Ultrasound Physics Save time and study smarter with a tool designed with your busy lifestyle in mind. Prepry is the perfect tool for both on-the-go and lengthy study sessions. FEATURES: - Learn, review, and master questions with our spaced repetition algorithm - Target weak areas - Flag questions for later review - Build custom exams - Detailed results analysis - Optimized for phones & tablets - Question Bank - Question of the Day - Study reminders - Exam day countdown Our ARDMS-focused registry review app is a comprehensive tool for mastering sonography and ultrasound concepts. It offers in-depth coverage of ultrasound physics, essential for ARDMS exams, with modules on Doppler imaging, transducer mechanics, acoustic artifacts, and much more. The app's interactive features simulate ARDMS exam conditions, enabling the practical application of sonographic principles. It includes extensive content on abdominal, obstetric, and gynecological ultrasound, aligning with ARDMS specialty exams. Advanced learning technologies provide an immersive experience essential for grasping the complexities of ultrasound and sonography for ARDMS certification. This condensed, efficient learning tool is crucial for ARDMS exam preparation, ensuring a thorough understanding of the key elements in sonography and ultrasound. Subscriptions can be managed, and auto-renewal can be turned off in the App Store Settings after purchase. Once purchased, refunds will not be provided for any unused portion of the term. Please read our full Terms of Service and our Privacy Policy at - https://www.prepry.com/privacy-policy - https://www.prepry.com/terms-of-service - https://www.prepry.com/disclaimer ARDMS® is a registered trademark of the American Registry for Diagnostic Medical Sonography and is not associated with this app. CCI® is a registered trademark of Cardiovascular Credentialing International and is not associated with this app. This app is designed for professionals in the sonography and ultrasound fields and those preparing for the ARDMS exam. It provides up-to-date information on these rapidly advancing areas, including detailed ultrasound physics and sonographic imaging content. However, it's important to note that this app is not intended for clinical use or to replace medical care. If you have any medical or legal concerns, please seek professional advice. more",
  "reviews": [
    {
      "user": "dooannanamf",
      "date": "07/23/2021",
      "title": "I passed SPI\n\n    Developer Response",
      "review": "I pass studying this over and over and with Edelman book. The book helps me a lot . The app helps me understand basics and Doppler. I go on quizlet also go get mock exams from urr and traci fox . Some questions was on SPI . Not Prepry though . Prepry Doppler images really the only thing. I would master resolutions, doppler, spatial compounding, relationships. I spend one whole day reviewing edelmans book. And taking notes I use different papers for different categories like one paper on resolutions. One on relationships… more Thank you so much for your kind words. We really appreciate you taking the time out to share your experience with us — and we agree, they are all great tools! more"
    },
    {
      "user": "Dirtygirl22",
      "date": "08/19/2021",
      "title": "Love it but...\n\n    Developer Response",
      "review": "I love this app. This is exactly what I need to pass my boards! I’ve also recommended it to some of my friends that have tried to take theirs birds to but has failed. This could be an outstanding app and the only reason I’m writing this review is so that you can fix the minor errors so it can be this amazing app it is supposed to be. Problem #1 it’s difficult at first to understand how to use it. It also doesn’t save your progress when you click on “save your progress” Problem#2 some of the answers have two of the same multiple choice answers so when you pick one of the 2 it’s wrong. This is all I have a problem with I love the app and will keep using it! Just minor bugs to work out that’s all. Thank you for making this app! more Thank you so much for your kind words. We really appreciate you taking the time out to share your experience with us and bringing these issues to our attention. more"
    },
    {
      "user": "Disappointed1017",
      "date": "03/22/2021",
      "title": "HATE THE NEW UPDATE\n\n    Developer Response",
      "review": "When I originally downloaded this app it was fantastic. It would give me the option to take a mock exam with 110 questions, and it also had quizzes that you can adjust to your learning style. I was able to study and learn 440 questions. It was really helping me study for my SPI. Unfortunately with the newest update it wouldn’t load so I had to keep deleting the app and redownloading it to work. With this TERRIBLE new update it will only let you take a mock exam or quiz with only 10 questions. If you try to take another quiz or mock exam it will keep giving you only the same 10 questions. The only way to get the great experience is to pay for it. With the new update, the app won’t even load yet they want money for there app?! Absolutely ridiculous more Sorry to hear that. You can email us at support@imago-ai.com and a member of our support team will help you. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "159 MB",
  "category": "Medical",
  "ageRating": "4+",
  "languages": "English"
}