{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Teach Me Surgery 17+",
  "subtitle": "Educational Surgical Textbook",
  "seller": "TeachMeSeries Limited",
  "stars": "4.8",
  "rating": "182 Ratings",
  "price": "Free",
  "appDescription": "TeachMeSurgery is a comprehensive encyclopaedia for surgery and perioperative care. Created by a team of surgeons and doctors, TeachMeSurgery provides a concise and structured insight into over 400 surgical topics across a wide range of specialities, with each article individually reviewed and revised by world-leading experts. The TeachMeSurgery App is here to make sure you get the most out of your studies today, to help you care for the surgical patients of tomorrow. FEATURES: -- Articles: Over 400 comprehensive articles, covering a huge range of surgical topics and specialities. -- Media gallery: Over 1000 full colour high-definition surgical illustrations and clinical images. -- Quick quiz: 600 multiple choice questions to test your knowledge within surgery, with detailed explanations to aid your learning. -- Examination guides: Easy to follow clinical examination guides, helping you hone your practical skills. -- Summary boxes: Each topic is summarised at the end of every article, aiding you in consolidating your learning. -- Offline store: Every article, illustration, and quiz is stored offline for instant access at any-time. more",
  "reviews": [
    {
      "user": "Paywandp.n",
      "date": "04/21/2020",
      "title": "great app\n\n    Developer Response",
      "review": "this app is just perfect!! easy to use, straight to the point and really enjoyable more Thanks for the feedback - its great to hear that you've found the app easy to use and consise - that's exactly what we aimed for! Please reach out if you have any questions more"
    },
    {
      "user": "Letter fun",
      "date": "11/04/2021",
      "title": "Mid",
      "review": "Mid"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "144.5 MB",
  "category": "Medical",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information\n                Infrequent/Mild Sexual Content and Nudity",
  "languages": ""
}