{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "MyHealthONE 17+",
  "subtitle": "Patient Health Portal",
  "seller": "HCA Healthcare, Inc.",
  "stars": "4.6",
  "rating": "48.5K Ratings",
  "price": "Free",
  "appDescription": "The MyHealthONE app features are designed with you in mind: • Access medical health records securely • View lab results as soon as they're available • Find local doctors • Schedule appointments • Fill out medical paperwork hassle-free • Pay a bill • View imaging reports • Integrate with other healthcare portals • Manage accounts for multiple family members • Sign up for classes or events MyHealthONE simplifies the patient and caregiver experience. The easy-to-navigate healthcare mobile app lets you manage your health information and track your health journey in one convenient place. It's healthcare on your terms, when you need it. Whether you are managing your own health or that of a loved one, MyHealthONE is the partner you need in the healthcare journey. Secure and straightforward, just how healthcare should be. more",
  "reviews": [
    {
      "user": "rossial",
      "date": "04/11/2023",
      "title": "Excellent Referral",
      "review": "I appreciate my referral to Dr Nudell recommending ‘He is the Best Gastrointerologist in the Tampa Bay Area.’ I was able to acquire an appointment with Loren Anderson, whom is Excellent! She reviewed my symptoms with detailed knowledge of my medical history reflecting her research and review before my appointment. Loren stepped out to discuss my case with Dr Nudell, then in a short time he entered with introduction and review of his diagnosis and tests to be scheduled in his office before recommended surgery that I knew I needed. Dr. Nudell is a top specialist who took time with me to discuss my options, explain what he prescribes to help me and give me total confidence in him as The Best. more"
    },
    {
      "user": "anncp7",
      "date": "08/09/2023",
      "title": "Total Joke of an app",
      "review": "I went three times to urgent care the records of which were supposed to populate to this app. They never did. I called twice for assistance. The first time I was told they weren’t populating due to the urgent care entering my address incorrectly. I had them correct the address, but the visits still weren’t appearing. I called again and after the worker tried and failed to figure out the problem, I was told that it would be sent to tier two to see if they could figure out the problem. Next, I tried the mess engine function in the app. The first response revealed that they hadn’t bothered to read and comprehend my message. I sent another message. That time, they said I would have to call yet again before they would forward it to tier two. I had already talked to these people nearly two hours, so I’ve had enough. more"
    },
    {
      "user": "CareNow- Horrible",
      "date": "09/22/2021",
      "title": "Patient Test Results\n\n    Developer Response",
      "review": "I need to get Covid results for my son but it’s only showing me results for myself. The location in Dickinson told me to download the app and I should find my sons test results there. However she did not explain how to obtain those results. I tried creating an account in his name but I was unable to so I have no idea how to get his results. The app does not explain if you can add dependents or not. Now I have to drive to the Care Now location to pick up my sons Covid results in order for him to return to school. I was originally told to download the LabCorp app and the results would be downloaded there. I did and his results are still not there. I was Covid positive over a month ago and my results are still not in LapCorp. So I have now downloaded two apps and neither can give me the documentation I need. more We are sorry to hear you've had trouble accessing your son's results. In order to view minor records within MyHealthONE, you will first need to complete a proxy form - either in clinic or by phone at (855) 422-6625. This will authorize you to connect your son's records to your portal account and view his results. Please give us a call and an agent will be happy to assist. Thank you. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Apple Vision"
  ],
  "size": "44.5 MB",
  "category": "Medical",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English"
}