{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "CareConnect Mobile 4+",
  "subtitle": "",
  "seller": "MCT Technology, Inc.",
  "stars": "3.7",
  "rating": "68 Ratings",
  "price": "Free",
  "appDescription": "CareConnect is the all-in-one Early Care and Education platform that empowers educators to connect with families, children, and communities. CareConnect allows you to do everything you need: sign in/out, manage students’ enrollment and schedule details, track subsidy billing and payments, manage tuition billing and payments for parents, and much more! PROGRAM STAFFS: Sign in/out or add daily activities, manage student’s profile and immunization, keep emergency contacts, contactless attendance with parent kiosk, submit subsidy time sheets and invoices. PARENTS: Report absence, view attendance record, set up online bill pay, sign in/out, and more features are coming soon! PARENT KIOSK: Parents sign in/out using unique PIN codes. Contactless option with QR Code is also available. VIEW PARENT PIN CODE: Staffs access to manage the parents' PIN codes, send PIN code via email or text message. MANAGE STUDENT’S PROFILE: Maintain family contacts, siblings, allergies, medication, diet restrictions, immunization records, and enrollment schedules. SUBMIT TIME SHEETS and INVOICES: Staffs access to the subsidized students' time sheets and invoice information, and submit them digitally to the connected child care Agencies. ***Additional features are available on the CareConnect website including features mentioned above with easier access! more",
  "reviews": [
    {
      "user": "Mishyd23",
      "date": "12/06/2022",
      "title": "The app and the company used to be so much better!",
      "review": "Finding a reliable, useful app for after school/camp services is difficult at best. Care Connect was our answer to a prayer in the beginning but as they have grown so have the headaches. Getting in touch with a real live breathing human is way too difficult now. Not all of the children’s info populates on different pages within the app. I have an iPhone and have problems but our staff who use android devices are pulling out their hair trying to get the app to work. Our parent often experience problems signing in. Sorry to leave this poor review but my attempts to reach someone in support have fallen flat! more"
    },
    {
      "user": "Turbow50",
      "date": "03/27/2023",
      "title": "Amazing Customer Service and Features!!!",
      "review": "I was trying to find a way to separate my evening and weekend (differential) hours from my total hours. Zahy was super helpful and solved my problem quickly. This will save me countless hours of data entry over the years to come. Thank you very much Zahy!!! I highly recommend CareConnect. FIVE STARS!!! more"
    },
    {
      "user": "Erika1610",
      "date": "04/01/2022",
      "title": "Agradecimiento",
      "review": "Gracias Erik Monteon por todas las atenciones y la paciencia que tuviste al enseñarme cómo utilizar esta aplicación"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Apple Vision"
  ],
  "size": "103 MB",
  "category": "Education",
  "ageRating": "4+",
  "languages": "English, Simplified Chinese, Spanish"
}