{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "ASCCP Management Guidelines 17+",
  "subtitle": "",
  "seller": "American Society for Colposcopy and Cervical Pathology Inc",
  "stars": "4.8",
  "rating": "6.3K Ratings",
  "price": "$14.99",
  "appDescription": "New 2019 ASCCP Risk-Based Management Consensus Guidelines for abnormal cervical cancer screening tests and cancer precursors provide new recommendations. ASCCP is pleased to offer this app to streamline navigation of the ASCCP Risk-Based Management Consensus Guidelines for abnormal cervical cancer screening tests and cancer precursors. The guidelines articles, as published in the Journal of Lower Genital Tract Disease, as well as the comprehensive risk estimates, can be accessed through https://www.asccp.org/guidelines. These evidence-based management guidelines, initially developed in 2019, came together through a consensus process of 19 organizations. The updated management guidelines aim to: • Allow for a more complete and precise estimation of risk • Provide more appropriate intervention for high-risk individuals (detect and treat more precancer) • Recommend less intervention for low-risk individuals (decrease testing and treatment that won’t prevent cancer and may cause reproductive harm) • Allow for the future addition of new risk modifiers and screening and management technologies See https://www.asccp.org/UserGuide for tips on using the app. more",
  "reviews": [
    {
      "user": "SLOPeeDee",
      "date": "06/13/2020",
      "title": "Chock full of information\n\n    Developer Response",
      "review": "This new app will take time to get used to. It is definitely not as intuitive as the original. My first attempts to figure out where to jump in for a complex patient were completely frustrating. But with some guidance from the ASCCP listserv folks ( some of whom developed the app) it was easier. Apparently ASCCP is going to offer some educational sessions to help with using the app. I recommend it but don’t expect to “get it” on the first try. Since the new guidelines are so “dense” not surprising the new app is too more Thank you for using the new ASCCP app and sharing your thoughts with us. more"
    },
    {
      "user": "Mark H Einstein",
      "date": "06/12/2020",
      "title": "Simplified patient care\n\n    Developer Response",
      "review": "This app is a very user friendly medical app that includes all of the updates management guidelines so I can better manage my patients. It includes prior risk thresholds that predict current and future risk. Like the last app this one takes some wine to get used to, but once you do, it makes shared decision making very efficient. more Thank you for downloading the ASCCP Management Guidelines app and your 5-star review! more"
    },
    {
      "user": "RBeardsley",
      "date": "07/06/2020",
      "title": "Not user friendly",
      "review": "The previous version was far more intuitive. When you try to start entering in your most recent results and where to go from there, it becomes unclear if it is wanting you to collect and enter in cytology and HPV status from AFTER your last test (eg colpo biopsy or LEEP) or if you are entering in cytology and HPV from BEFORE your last test. Then, if what you have done in the past or what you have been given (such as a new patient you’re trying to catch up on) doesn’t match up with the algorithm order, it just doesn’t even give you any recommendations. I feel like I’m going to have to know the guidelines so thoroughly in order to even use the app that I won’t even need it by then! more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "43.3 MB",
  "category": "Medical",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English"
}