{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "ASPIRE Galderma Rewards 17+",
  "subtitle": "Aesthetics Loyalty Program",
  "seller": "Galderma Laboratories, L.P.",
  "stars": "4.9",
  "rating": "9.8K Ratings",
  "price": "Free",
  "appDescription": "The ASPIRE Galderma Rewards app makes it easy to view and redeem your rewards, access special offers and track your aesthetic journey. Provider information, ASPIRE Rewards – it’s all there and just a touch (or glance) away! Key Features: LOGIN WITH A GLANCE From Face ID® to your username and password, choose an easy and convenient way to login including with Google, Facebook or Touch ID®. SAVINGS MADE EASY Redeem points for ASPIRE Rewards in two easy steps and instantly apply them to your treatment(s). REWARDS AT YOUR FINGERTIPS Access your ASPIRE Reward details and information on current special offers – all in one place. GET PERSONALIZED NOTIFICATIONS Stay informed about point activity, special offers and when you’re due for your next treatment. TRACK YOUR RESULTS Upload Before & After photos to your Gallery and see the difference your Galderma aesthetic treatments make. PICK YOUR PREFERRED SPECIALIST Find and save a preferred aesthetic specialist so calling to make appointments becomes quick and easy. ASPIRE Galderma Rewards is a rewards program for aesthetic patients ages 18+. more",
  "reviews": [
    {
      "user": "Wisemagl",
      "date": "06/19/2020",
      "title": "Way better than other apps of its kind\n\n    Developer Response",
      "review": "I’ve used other apps like this and this one works much better and has more functionality included so I don’t have to do some things on my desktop and some on mobile. Can’t wait to try their new product. more Well, you made us blush! Thanks for saying such great things about our app! more"
    },
    {
      "user": "tracylmG",
      "date": "09/08/2021",
      "title": "Bad customer service\n\n    Developer Response",
      "review": "So received an email to by a certificate from them. Bought it , the transaction went through they got their money but they never gave me the certificate. When I went to use it the person on the phone said the transaction didn’t go though and i said you got the money from my bank 2 days ago. She had nothing to say but I would receive my certificate in 3-5 days. There was no manager I was allowed to talk to. They have had my money for 10 days and I just received and email saying I will get the refund I asked for (but I didn’t ask for one) in another 3-5 days. Very frustrating and no customer service at all. Even the doctor’s office tried talking to them and they were like oh well ! more That sounds really frustrating! We’re sorry you’re having that experience, and we’d like to help. Please call us at 844-5-ASPIRE (844-527-7473) so we can get more information about what’s happening and try to fix the issue. more"
    },
    {
      "user": "Debi911",
      "date": "11/08/2022",
      "title": "Purchases a $150 certificate\n\n    Developer Response",
      "review": "Purchased a $150 certificate and was charged and never received it. Was on hold over an hour to customer service with no one answering, now have to report to my bank as a fraud charge and waste another 30-40 mins faxing them the receipt to protest charge. Definitely never using this app/program again. Never been so upset and disappointed in a company. If you do not have customer service to resolve issues then you are failing. I’ll be switching to Botox I never had issue with them or making purchases more We’re sorry to hear the app wasn’t working properly. Please reach out to our customer support at 844-5-ASPIRE (844-527-7473). We may need to get a few details in order to address the problem. Thanks for bringing this to our attention! more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "192 MB",
  "category": "Medical",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information",
  "languages": ""
}