{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "CSL Plasma 4+",
  "subtitle": "",
  "seller": "CSL Plasma",
  "stars": "3.5",
  "rating": "966 Ratings",
  "price": "Free",
  "appDescription": "Save time and manage your rewards! Download the app and get more out of every donation. Complete your online health screening, skip the kiosk line and activate your iGive Rewards® to start earning additional points you can redeem for cash. Get the CSL Plasma App to: • Get updates and learn about local promotions • Manage reward points • Launch your Donor360® health questionnaire to start your visit before you arrive • Refer friends and earn reward points Make your donation process a better experience with the CSL Plasma App. Use the CSL Plasma App to find your center, see your first month rewards, get donation tips and connect with customer service. You will get your donor ID when you register at your local CSL Plasma Center. If you already have your donor ID, download the App and get started! Help save lives, while making a difference in your own. Do the AMAZING. Donate plasma today. For more information about CSL Plasma please go to www.cslplasma.com more",
  "reviews": [
    {
      "user": "Miwildcat",
      "date": "11/01/2022",
      "title": "Needs Additional Features for Improved Customer Service",
      "review": "The app is OK to simply track your donor history and schedule a time. Scheduling a time is meaningless it gets you no benefit at all. There is no ability to get in line before others who may have just walked in. In reality the center is completely walk in basis. If I schedule a time but now the center is showing a long wait time a notice should be pushed letting me know. The donor360 questions should be an integrated part of the app not taking me to a website. That is rather annoying. I have to log into separate websites to check payment on my card and any bonuses received. Technically this is now a 3rd login. Push notifications regarding center status would be extremely helpful. I filled out questions at home drive to center only to find it full of people who could not check in and systems appeared to be down. Had I known there was an issue I would not have driven to the center instead I would have planned around the centers issues. It wasn’t worth my time to wait for an unknown amount of time waiting for system to be up and running and all the other people waiting at 7:45am to be checked in. more"
    },
    {
      "user": "Imthatlezbo",
      "date": "06/19/2022",
      "title": "App and Center",
      "review": "It would be nice to actually receive the refer a friend bonus as promised. I have sent 4 new donors only got money for 2. Then I started as a new donor in June I was to receive 1000 for that month but the 1st 2weeks I was shorted on 4 donations. So that bad odds. I’ve called several times to try and allow them to correct the issues. I’ve emailed. I never got anyone to correct it. Center claims they don’t do back pay? You shorted me like $200. I’m sure your making plenty off the fluids that I donate. That is bad for business and I don’t trust the center to pay me to recruit my friends anymore. It’s sad that your doing it to help people but the center that’s collecting the plasma is shorting the donors. Can’t make it right with you and don’t even give you a reason. I guess they don’t care about nothing but the money they make off your plasma. Nothing you can do but stop donating and people that need the medication will pay even more for it because we all know the less their is the more it costs. more"
    },
    {
      "user": "Nathan1992*",
      "date": "08/06/2023",
      "title": "Stole money from me",
      "review": "I referred my wife and after donating I never received my bonus . I called customer service and the representative and I believe got confused with my problem and told me there was no way to fix it. She then started yelling aggressively with me. She pretended she couldn’t hear me and hung up. I called again and another representative said she couldn’t do anything about it . I asked to speak with a supervisor, and she said I would get the same answer, but she wouldn’t mind transferring me. Why does she have to make such a bad comment? Why can’t she just transfer me like I asked. After a brief whole time, she answered the phone again, and apologized and said something can be done about it after all! So while she was processing my bonus again the call dropped ! I never received my bonus and me and my wife stopped going for good. On top of all this I never received 2500 points I was supposed to have. BPL plasma and Grifols pay more anyways. And Grifols has WAY shorter lines than CSL. Don’t even waste your time and if you like your money. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch",
    "Apple Vision"
  ],
  "size": "54.1 MB",
  "category": "Medical",
  "ageRating": "4+",
  "languages": "English"
}