{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Mosby's PDQ Respiratory Care 17+",
  "subtitle": "Pulmonary Reference",
  "seller": "Skyscape Medpresso Inc",
  "stars": "5.0",
  "rating": "1 Rating",
  "price": "Free",
  "appDescription": "*** 2 Weeks Free Trial *** Portable guide provides rapid access to vital respiratory procedures, facts, and formulas with an emphasis on critical care \"Try before you buy\" - Download the FREE App, which includes sample content. In-App purchase required to unlock all content. Find critical respiratory care information fast! Mosby's Respiratory Care PDQ is a comprehensive and precise, this portable guide provides rapid access to vital respiratory procedures, facts, and formulas with an emphasis on critical care. Easily access all the information on your smartphone or tablet with the option to bookmark frequently accessed topics. Whether you use it as a clinical resource, a study tool, or a quick refresher, this full-color resource offers quick access to just the right amount of practical, must-know information – essential for boosting your confidence at the point of care. A quick-reference format provides all of the key information you need with fast-access to respiratory care guidelines, including assessment, arterial blood gases, EKGs, medications, and PFTs. You’ll also find essential information on pulmonary diseases, equipment disinfection, and neonatal and pediatric care. KEY FEATURES * PDQ mobile reference guide perfect for the fast-paced clinical setting. * Robust indices, table of contents and section menus make it easy to quickly locate key information within each section. * Full-color design includes illustrations and clarifies important facts to help you easily find what you need. * Commonly used and updated clinical information, including tables, formulas, equations, algorithms, and lab values – all necessary to deliver safe and efficient care. * Designed for speed with much of the data organized into fast-access charts and tables. * The entire scope of adult pulmonary care is included with a section on Neo/Peds. * Sections include Diseases, ABG’s, Hemodynamics, Lab Values, PFT’s, X-rays, Mechanical Ventilation, Formulas, & much more! NEW TO THIS EDITION * AARC Clinical Practice Guidelines content has been redesigned into easy-to-use, compact algorithms. * The latest asthma guidelines * Increased coverage of neonatal and pediatric care * Expanded BLS and ACLS protocols; updated medications, therapies, and therapeutic devices; and updated ventilator modes * More formulas and facts than in the previous edition ISBN 10: 0323100724 ISBN 13: 978-0323100724 SUBSCRIPTION : Please purchase a yearly auto-renewing subscription to receive content access and available updates. Yearly auto-renewing payments- $22.99 Payment will be charged to your iTunes Account at confirmation of purchase. Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period. Subscription may be managed by the user and auto-renewal can be disabled at any time by going to your device “Settings” and tapping “iTunes & App Store”. Any unused portion of a free trial period will be forfeited when you purchase a subscription, where applicable.\" If you have any questions or comments, email us any time: customersupport@skyscape.com or call 508-299-3000 Privacy Policy - https://www.skyscape.com/terms-of-service/privacypolicy.aspx Terms and Conditions - https://www.skyscape.com/terms-of-service/licenseagreement.aspx https://www.skyscape.com/index/privacy.aspx Author(s): Helen Schaar Corning, RRT, Helen Schaar Corning, RRT Publisher: Elsevier Health Sciences Company more",
  "reviews": [
    {
      "user": "Sydne Shields",
      "date": "05/22/2022",
      "title": "Fantastic!!",
      "review": "This is AMAZING!! I wish I found this when I first started my courses! If you’re taking courses for Respiratory Therapy this is 1000% worth the money, I wish I found it sooner! My only issue is trying o connect my account from my iPad (where I paid for the subscription) to my laptop (MacBook) with the same app. But either way, a tiny inconvenience for a major study/learning resource! —- update: if you purchase on one device and want it on your other (I have 2 apple devices and an android, because I bout it on the apple store and not the google store they do not cross and this won’t work) log into your account, go to settings click “catalog/purchases” UNDER the big red “purchase options” button it says “already purchased? Restore purchase” click that and it takes 2 seconds and it’s fixed!! more"
    },
    {
      "user": "A future RT",
      "date": "01/18/2021",
      "title": "It’s Not Free!\n\n    Developer Response",
      "review": "They lead you to believe this app is free. You can access the app for free but not the information within the app. Very misleading. This app is $23. more We are sorry if you were confused into thinking the app was free. We allow our customers download and look at about 10% of the content to make sure the app meets their needs. In the TOC the free sections are listed. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "11.7 MB",
  "category": "Medical",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English"
}