{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "CardMedic 17+",
  "subtitle": "Fluent in Healthcare",
  "seller": "CardMedic",
  "stars": "5.0",
  "rating": "4 Ratings",
  "price": "Free",
  "appDescription": "Struggling to communicate with your patients across language barriers? Finding it challenging to communicate with deaf or blind patients? Having difficulties communicating with patients with learning disabilities, dementia or other cognitive impairment? CardMedic is an innovative and multi award-winning \"One Stop Communication Shop\" able to overcome any communication barrier at the point-of-care, providing clarity and reassurance to anxious and vulnerable patients, and improving patient confidence in understanding healthcare information by 28%, up to 95%. Written by clinical experts and carefully designed to be intuitive, clear and concise, CardMedic offers instant access to a flexible communication support tool for patients with differing language needs, sensory abilities and capacities. Comprising an A-Z list of pre-written scripts replicating clinical conversations around common healthcare topics, you choose the topic and display the screen to the patient, facilitating the clinical interaction. At the touch of a button, content can be converted to different languages, sign language videos, easy read with pictures or read-aloud mode. The integrated speech-to-text translation tool enables conversations to expand beyond the scripts. At CardMedic, we are on a mission to make healthcare information more accessible and reduce health inequalities. Founded by a frontline clinician and developed with a multi-disciplinary team from across the globe, at the heart of CardMedic is the drive to improve patient safety, experience and quality of care. Feedback from staff, patients and members of the public is at the core of enhancing our product - so please get in touch with any thoughts, comments or suggestions, info@cardmedic.com! more",
  "reviews": [],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "31.2 MB",
  "category": "Health & Fitness",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English"
}