{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Klinio: Health & Weight Loss 4+",
  "subtitle": "Meal plan & tracker",
  "seller": "DIABETES SOLUTIONS UAB",
  "stars": "4.1",
  "rating": "575 Ratings",
  "price": "Free",
  "appDescription": "Klinio is a personalized meal & tracking app as well as your personal weight loss assistant. Our meal planner and carb counter will help you organize your meals and find healthy recipes suitable for anyone wanting to get healthier and fit. Manage and monitor your weight easily - track your health progress! Our program offers flexible customization while staying within the recommended amounts of carbs, protein, sugar, and other essential metrics. Our Klinio team of qualified nutritionists created these meal plans and diet recipes to help you improve your health and lose weight. We believe that every person deserves to live the best life possible. Therefore, we ensured that you would enjoy this diet without being forced to eat the foods you don’t like. Our fitness professionals also prepared a list of exercises you can do without any equipment. Boost your chances of achieving desired results anywhere and anytime with a weight loss program. Work out at home! We work to cater to your successful transition into a healthier lifestyle and guide you along the way with 24/7 support. Try it out today and get ready for positive, life-changing results! KLINIO FEATURES A PERSONALIZED MEAL PLANNER Get a customizable meal plan created to fit your body’s needs: your total calorie intake, recommended amount of carbs, sugar, cholesterol, and other vital metrics. SHOPPING LIST FOR YOUR CONVENIENCE Find all your meal plan ingredients faster and easier with a categorized weekly shopping list. AT-HOME WORKOUTS FOR YOUR WELL-BEING Complete simple yet effective challenges, or opt-out for a personal workout plan that’s entirely based on your preferences. Work out at home and improve your health with our weight loss program! YOUR HEALTH PROGRESS TRACKER Easily monitor & track your calories and macros, weight, workouts, and water intake - all in one place! Track your steps and calories burned. Sync heart rate and step data from your Apple Health app. SUBSCRIPTION TERMS Klinio offers paid and auto-renewing subscription options in order to access the general functionality of the app. Workout subscriptions are excluded from the general subscription and are available as a separate subscription-based purchase. Pricing for the subscriptions may vary based on region, and actual charges may be converted to your local currency depending on the country of residence. The subscription will automatically renew unless canceled in advance. Download our tracker & log app and start monitoring and improving your health. Find healthy recipes and organize your diet with our meal planner and carb counter. Start your weight loss journey! --- Terms and Conditions: https://klinio.com/general-conditions/ Privacy Policy: https://klinio.com/data-protection-policy/ more",
  "reviews": [
    {
      "user": "Jbg0707",
      "date": "09/03/2024",
      "title": "More recipes\n\n    Developer Response",
      "review": "This is a great app but long term it will present a challenge because the meal options are limited. They become repetitive within a few weeks. I don’t mind eating things I like on a regular basis but some additional options added on would help with variety. Some Recipes with cauliflower in them, especially as a crust for a pizza, for instance, would be nice if they meet the requirements. Also, a feature that would let me build a meal and see its micronutrients balance would be nice. Five stars would come if the recipes would expand. more Thank you for your thoughtful feedback! We're glad to hear you're enjoying the app and appreciate your insights on how we can improve. We’re committed to enhancing the experience, and your input is invaluable in helping us achieve that. Thanks again for your support! more"
    },
    {
      "user": "Bubbapotem",
      "date": "06/03/2024",
      "title": "Needs work\n\n    Developer Response",
      "review": "I went ahead and subscribed to this app for six months, but I wish I had tried out the app first. It's hard to log food, logging my exercise results in a double entry on Apple+. I wish I could just enter numbers instead of being forced to scroll. I can't find out what things like \"quinoa salad\" contain so I can't judge which selection is most correct to what I ate for dinner. I can't enlarge the page to full screen on my iPad, which is annoying because it would work better for me if I could. It's not the worst health app I've ever used, bit it is definitely on the lower end of the list. I likely won't renew. Update: I've been using the app for about a week. I'm taking off a star. This app is ridiculously difficult to use. Worse, it freezes up all the time. The inability to enter custom numbers is a huge problem. The app is awkward and clunky, and fully half or more of what I log is likely inaccurate because there is almost no customizing available. If I was simply dieting, this wouldn't be a huge problem (although annoying nonetheless), but I'm using this app because I'm prediabetic, and accuracy is vital. I'm not getting what I need out of this app. I'm moving on to something else. Two stars is generous. more Hello there, Thank you for taking the time to share your detailed feedback. We are sorry to hear that your experience hasn't been as smooth as expected. We understand your frustrations and are constantly working to improve the app. We're planning to release a new feature soon to make food logging super easy. Would you be interested to participate in our first user testing of smart food logging feature? Please reach out to us at hello@klinio.com mentioning this review and we'll provide more details. We truly appreciate your input and hope to better meet your needs in the future. Best regards, Emma. more"
    },
    {
      "user": "MnM Grambo",
      "date": "02/22/2024",
      "title": "Don’t Waste Your Money\n\n    Developer Response",
      "review": "UPDATE: the developers sent me an email telling me that they were sorry that I had the experience that I had. They also said, “We do offer refunds for initial charges within the first 24 hours” This was simply not true. When I contacted them just a couple of hours or so after I downloaded the app, they replied that they don’t give refunds. After I filed the dispute, they offered half of the price back. This was not acceptable. I am STILL not happy, but I had to take what I could get and count my losses. DON’T WASTE YOUR MONEY I was a customer for a few hours before I realized this app was not for me. I contacted them, and they were gracious; however, they would not refund my money. I filed a dispute via PayPal, and they offered to give me half of my money back, even though I had only used it for a couple hours. to me, it was not user-friendly. It was hard to navigate. It did not give me the meal choices that I thought it would give. I decided to close out the resolution and take half of my money back because that’s all they would give. I would not recommend that you purchase this unless they give you a free grace period to determine if you liked the app or did not like it. more Hello, We apologize for any inconvenience you experienced with our app. We strive to provide a user-friendly experience and are disappointed to hear that this was not the case for you. We do offer refunds for initial charges within the first 24 hours, and we regret any miscommunication regarding this policy. If you would like us to review your case again, please don't hesitate to reach out to us at hello@klinio.com. We value your feedback and are committed to improving our services based on customer experiences. Thank you for bringing this to our attention. Best regards, Emma. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch",
    "Apple Vision"
  ],
  "size": "83.6 MB",
  "category": "Health & Fitness",
  "ageRating": "4+",
  "languages": "English, French, German, Italian, Norwegian Bokmål, Polish, Spanish"
}