{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "AI Dermatologist: Skin Scanner 17+",
  "subtitle": "Skin diseases checker",
  "seller": "Acina",
  "stars": "4.6",
  "rating": "3.9K Ratings",
  "price": "Free",
  "appDescription": "An innovative prediagnostic app helps you to monitor and detect your skin health using Artificial Intelligence techno AI-Dermatologist: Your Personal Skin Health Monitoring App Experience the revolutionary AI-Dermatologist app, a cutting-edge solution to monitor your skin health and identify any potential skin conditions that require attention. We all desire healthy and radiant skin, and achieving this goal necessitates consistent efforts and various skincare methods. Whether it's identifying rashes, nevus or cancer, checking moles, analyzing your skin's condition, or scanning for acne. AI-Dermatologist combines all these functions and recognizes 58 different skin conditions in one convenient application. By incorporating today's most advanced Artificial Intelligence technologies and drawing from the expertise of dermatology professionals, our app empowers you to assess the risk of various skin issues, such as spots, birthmarks, acne, moles, or papillomas. In just one minute, AI-Dermatologist provides you with valuable insights and recommends the appropriate next steps to take if any concerns arise. Furthermore, the app enables you to store photos, allowing you to monitor changes over time and track your skin's health in the long run. By creating an AI-Dermatologist, we aim to make skin screening and monitoring accessible to everyone. With AI-Dermatologist, you can enjoy the following features: - Capture snapshots of skin spots, birthmarks, moles, and other skin conditions, including angiomas, warts, papillomas, mollusks, and more. - Take or upload photos to track and observe changes over time. - Easily log the tracked your skin conditions locations on your body for better record-keeping. - Receive timely reminders for taking new photos, take pills or build a skin care routine and tracking progress. - Сreate your own scheme for the medicines or cosmetics’ use according to your schedule. - Monitor the dynamics of baseline and follow-up results for a comprehensive view of your skin health. - Utilize our advanced AI Consultant to gain deeper insights into your skin condition and receive personalized recommendations in real-time. - Access an extended PDF report that offers a comprehensive and detailed description of your skin condition, providing extensive information to help you better understand and manage your skin health effectively. It is essential to understand that an AI-Dermatologist is not a diagnostic tool and cannot replace or substitute a visit to your doctor. Our application aims to raise awareness of your skin condition through self-examination, but it should not be considered an online dermatology platform. If you ever notice any discomfort or changes in your skin spot, such as irritation, itchiness, or bleeding, we strongly advise reaching out to a medical specialist promptly. Early consultation with a healthcare professional can help avoid potential risks associated with melanoma or other skin diseases. Download AI-Dermatologist today and take charge of your skin's well-being with the power of AI and professional dermatological expertise at your fingertips. Stay proactive, stay informed, and prioritize your skin health. By signing up for this subscription, you agree to our Terms of use http://ai-derm.com/terms/terms_of_use.html Privacy Policy http://ai-derm.com/privacy/privacy.html more",
  "reviews": [
    {
      "user": "Red Fairy Dust",
      "date": "12/02/2022",
      "title": "Review\n\n    Developer Response",
      "review": "Thank you so much😊 it's about time I figure this out, it's the worst & painful. I've seen many doctors an not a one can be straight with me or even know what it is. I've been told numerous of times, I'm on drugs or your doing meth. U have relieved a lot of stress off me and now I can finally deal with it and get my nice, clean skin back & not be so embarrassed to go out with friend's & family. Thank you!!!💛 more Thank you very much for sharing your valuable and useful review as well as the five star rating! Really means a lot. Choose the best plan for yourself and your health! more"
    },
    {
      "user": "Hfhf69696969",
      "date": "02/09/2024",
      "title": "Don’t use this if you have medical anxiety.\n\n    Developer Response",
      "review": "The only reason I’m giving this app two stars is because it told me what the condition was actually named which I knew I had previously confirmed from my doctor. However, it pretty much says every result is concerning or has a high cancer risk. For example I have benign seborrheic keratosis on my arm that I’ve had since I was a teenager and it said my cancer risk was 85% and I needed to run to a dermatologist. Even a quick google search will tell you seborrheic keratosis are not pre-cancerous. Yet, they say it is a huge cancer risk. They also diagnosed me with lentigo on my arm saying it was most likely (74%) precancerous when Lentigo is, by the books, harmless but can resemble dangerous lesions. Then they try to get you to pay for a “dermatologist” of theirs opinion. Just go to the doctor or monitor your own skin and go with your instinct. This will only make anxiety flair. more We are sorry that you did not like our application. We would like to note that our App can't substitute a doctor, the app helping you to monitor your skin health and detect any unusual or alerting skin conditions. AI Dermatologist screening recognizes 58 different skin conditions and tells you when to book an appointment. App is created on the basis of artificial intelligence as a result of joint work of IT specialists and doctors. Again we would like to remind everyone (and this has been emphasized honestly throughout the process) that we are not a replacement for physician consultation and we cannot diagnosis. And we will constantly improve to make the application more and more perfect. more"
    },
    {
      "user": "Hi3874726",
      "date": "06/06/2024",
      "title": "Horrendous\n\n    Developer Response",
      "review": "Just to preface, a large majority of these 5 star reviews aren't real people. This app is a great example of why AI is not yet capable of adequately replacing people. Out of curiosity, I downloaded it to snap a picture of a small circular cut on my arm. To my surprise, the app tells me there's a 90% chance I have squamous cell carcinoma and that I need to see a dermatologist immediately. My cut has since healed and was nothing more than a small bump. I can understand the principle of overestimating these things, but the fact that this app charges you for what is more likely than not to be a misdiagnosis is disgusting. If you're really concerned about a spot on your skin, don't bother with this and just go straight to your physician. more Thank you for sharing your experience. We want to clarify that our app does not provide diagnoses or recommendations, but rather assists users in monitoring their skin health. We're sorry to hear that you're dissatisfied with our app, and we understand your concerns. However, we assure you that all our reviews are from real users, and our goal is to help individuals keep track of their skin health. We appreciate your feedback and will continue to work on improving our services. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "177.6 MB",
  "category": "Medical",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English"
}