{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Body Temperature App For Fever 12+",
  "subtitle": "Thermometer Tracker + Checker",
  "seller": "AboutMe Apps, Inc.",
  "stars": "4.8",
  "rating": "18.2K Ratings",
  "price": "Free",
  "appDescription": "Estimate your body temperature, log and track your data, making it easier to spot potential fever symptoms—all without a thermometer! Knowing your temperature is crucial for maintaining well-being and taking the best care of yourself, so stay proactive about your health by monitoring your body temperature with our app. With just a few simple steps on your mobile device, you can track your body temperature trends and take proactive steps towards your health goals. But wait – there's more: • Find out, track and log your body temperature with ease. • Log and easily export your body temperature data and more into PDF to share with your doctor. • Easily measure wrist temperature with the Apple Watch app and save your data in our app. (requires Apple Watch 8 or newer) • Use your phone’s camera to estimate your heart rate and then easily log your data afterward. • Track, log, and export your symptoms and medications effortlessly. • Monitor the heat index based on location to safeguard yourself against heat-related conditions that could pose health risks. • Add family members and monitor the body temperature of each. • Discover how weather conditions can influence your body temperature using our widget. Whether you're at home or on the go, managing your health has never been easier. The Body Temperature App for Fever is free to download and utilize. However, users can opt for a subscription to access additional features. Your subscription will automatically renew and you’ll be billed based on the plan you choose. You can cancel your subscription at any time in the App Store. Disclaimer: For wellness use only. The App is intended to improve your awareness of general wellness. The App can't be used for diagnostics or medical purposes. The App does not diagnose, treat, mitigate or prevent any disease, symptom, disorder or abnormal physical state. Always seek a health care professional or emergency services if you believe you may have a medical issue. Terms of use: https://aboutmeapps.com/terms-of-use/ Privacy policy: https://aboutmeapps.com/privacy-policy/ more",
  "reviews": [
    {
      "user": "TwiztedSyn",
      "date": "03/19/2024",
      "title": "Extremely useful!\n\n    Developer Response",
      "review": "This app is extremely helpful for keeping track of most everything that I need to know about what’s happening with my health. It truly helps keep track of my health symptoms throughout the day so I can find patterns and make adjustments to my daily routine in order to better my overall future health. I also love that it communicates with the Apple Health app. It’s very user friendly and easy to use. My only complaint is when I manually enter my body temperature on my Apple Watch, it doesn’t actually record it in the app. Maybe it’s a glitch or something… It DOES, however, keep track of my wrist temperature whenever I’m wearing my watch, so that’s another helpful feature. It also keeps track of my heart rate and blood oxygen levels (newer models of the Apple Watch have this feature) throughout the day and night, which is VERY important for me to keep track of due to my current health status. In summary, it’s an excellent app for tracking symptoms in one place, so you can easily find patterns and share with your doctors and caregivers. more Thank you for your feedback! ❤️ You motivate us every month and every day! We will fix the manual entering on Apple Watch. more"
    },
    {
      "user": "rkvgornskf cuggi",
      "date": "04/12/2023",
      "title": "Thermometer app.",
      "review": "Really relives anxiety. I don’t get sick often but when I do I’m completely Incapacitated. My panic attacks make me feel like there is more wrong than there really is. But with this app I can stand sit or lay down. Do my quick breathing exercise (5 breathes in big and slow, 5 breathes out long and slow) it’s used the flash to check your pulse and a tapping prompt on screen to calculate your inhale/ exhales). Then calculates your body temp. I think it’s $4.00 for a week or a month I can’t remember. 5 stars tho. Y’all stay safe and contact your primary care physician if you don’t trust the app. It works for me but I am not a doctor. It might be different for other people. more"
    },
    {
      "user": "Emmahalie11",
      "date": "09/12/2024",
      "title": "IT DOES WORK!",
      "review": "Yes, it does work if you pay attention to what you’re doing. You do have to go through a few steps to get to the temperature and no you don’t have to buy anything…I knew I wasn’t feeling great, so I went to the doctor and find out I have Covid plus a fever…I was like dang, I got home and I was like if I let me see what this thing will tell me and if it was similar to what I was told and boom, 1 degree off from what I was told. I can say this app is quite reliable and if you’re reading the bad reviews, they are doing it wrong. I don’t pay for apps and I don’t normally review anything, but this is impressive. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch",
    "Mac",
    "Apple Watch",
    "Apple Vision"
  ],
  "size": "229.4 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English, French, German, Italian, Japanese, Portuguese, Russian"
}