{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "EczemaWise Track Skin & Eczema 17+",
  "subtitle": "Symptoms Tracker & Treatment",
  "seller": "National Eczema Association",
  "stars": "4.6",
  "rating": "203 Ratings",
  "price": "Free",
  "appDescription": "Welcome to EczemaWise: Skin Conditions & Treatment Eczema tracker app. EczemaWise was created to help people understand and manage their eczema treatment. Built in collaboration with the eczema community and leading health care providers, EczemaWise is designed to help users track the daily happenings that research has shown may cause eczema to flare or get worse. EczemaWise also helps you work with your doctor to get the most out of your appointment. The platform takes you through a step-by-step process called shared decision making to best prepare you for your visit. EczemaWise helps you inform your doctor of the reason for your visit and your preferences around eczema treatment. It helps you research your medication options and choose the ones you’d like to discuss with your provider at the appointment. EczemaWise compiles all this information along with your tracking data and creates a health report you can download and send to your provider. By helping you keep track of your daily life with eczema, EczemaWise is your tool for better health. Research shows that people who manage their chronic disease using a paper or digital tracking method experience improved health and more control over symptoms. more",
  "reviews": [
    {
      "user": "iHarryDo",
      "date": "10/28/2020",
      "title": "Must Need App for Eczema",
      "review": "This app is very beneficial to patients with eczema and caregivers. It’s also great for non eczema sufferers that want to learn more about this condition with articles"
    },
    {
      "user": "A.Newt",
      "date": "11/16/2022",
      "title": "It could be great\n\n    Developer Response",
      "review": "I recently learned about this app at the ACAAI meeting in Kentucky and was thrilled. As a person who as eczema who is also a health care physician who takes care of people with eczema, I think this is an incredible tool. It is so frustrating trying to keep track of what meds work, which don’t, what the triggers are etc. The best part of the app WOULD be the ability to make a visit summary for my dermatologist. It would be fabulous BUT it is so glitchy that it never loads the summary. Please fix this. I want to tell all of my patients about this but I can’t promote it if it doesn’t work. more Hi A.Newt! We are delighted you find EczemaWise a useful tool as a patient and a doctor! We pushed some updates that helped with the appointment summary glitches and are continuing to work on improving the picture selection experience as well. Did you know we added in PO-SCORAD to the summary? I hope you'll try creating the summary again to see if these bug fixes helped. If it does, we hope you'll consider updating your rating! Thank you! -Isabelle more"
    },
    {
      "user": "4637Leah",
      "date": "03/21/2022",
      "title": "Please please please fix the diet tracker section.\n\n    Developer Response",
      "review": "I used to love this app but ever since they made the app remember food items, the diet tracker section glitches on me every time. I cannot record food because it doesn’t save properly. It doesn’t even let you delete food items in the list of saved foods. Way too much to for me to scroll through. I’ve already discussed this with someone from the app, and they said they would fix it in the next update. Please do so. more Hi 4637Leah! We've pushed a couple updates out that should fix Diet Tracker saving issues. Apologies for the inconvenience there. We've also taken note of how cumbersome it can be have a long list of foods, and the inability to edit them. We'll think through the design a bit better and hope to release an improved version in the future. Thank you! -Jose more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch",
    "Apple Vision"
  ],
  "size": "34.6 MB",
  "category": "Health & Fitness",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English"
}