{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "FreeStyle Libre 3 – US 4+",
  "subtitle": "Continuous Glucose Monitoring",
  "seller": "Abbott Labs",
  "stars": "2.3",
  "rating": "2.8K Ratings",
  "price": "Free",
  "appDescription": "The FreeStyle Libre 3 app is cleared for use with the FreeStyle Libre 3 System Sensor. The newest member of the FreeStyle Libre family is the most advanced continuous glucose monitoring (CGM) technology designed to fit into your life: • Glucose readings are automatically sent to your smartphone every single minute. • The world’s smallest, thinnest, and most discreet sensor [1]. • Consistent, accurate [1], all the time [2]. • Optional, real-time glucose alarms let you know the minute your glucose is too low or too high. • Glucose readings are updated 5x faster than other CGMs [3]. • Outperforms other CGMs in connectivity [4]. • Get detailed reports, including your time in range, to better understand your glucose trends and patterns. • When you connect with family members using the LibreLinkUp app [5], they see your current glucose reading, 12 hour historical glucose graph, set their own alarm notifications and receive alarms in real time [6]. • View glucose results discreetly in Dark Mode Download the FreeStyle Libre 3 app and talk to your doctor to learn more about the FreeStyle Libre 3 Continuous Glucose Monitoring System. COMPATIBILITY You can only use the FreeStyle Libre 3 app with FreeStyle Libre 3 System Sensors. It is not compatible with FreeStyle Libre or FreeStyle Libre 2 System Sensors. Compatibility may vary between smartphones and operating systems. Learn more about compatible smartphones at www.FreeStyleLibre.com. APP INFORMATION The FreeStyle Libre 3 app is intended for measuring glucose levels in people with diabetes when used with a FreeStyle Libre 3 System Sensor. For more information on how to use the FreeStyle Libre 3 Continuous Glucose Monitoring (CGM) System, refer to the User’s Manual, which can be accessed through the App. Consult a healthcare professional to confirm if this product is right for you or if you have questions about how to use this product to make treatment decisions. [1] Data on file, Abbott Diabetes Care, Inc. [2] 60-minute warm-up period required when applying the sensor. [3] Dexcom G7 CGM User Guide and Medtronic Guardian Connect System User Guide [4] Based on the signal strength in Dexcom G7 CGM User Guide and Medtronic Guardian Connect System User Guide. [5] The LibreLinkUp app is only compatible with certain mobile devices and operating systems. Please check www.LibreLinkUp.com for more information about device compatibility before using the app. Use of the LibreLinkUp app requires registration with LibreView. [6] The user’s device must have internet connectivity for glucose data to automatically upload to LibreView and to transfer to connected LibreLinkUp app users. The circular shape of the sensor housing, FreeStyle, Libre, and related brand marks are marks of Abbott. For additional legal notices and terms of use, go to www.FreeStyleLibre.com. Before using the app, review product labeling and the interactive tutorial at https://www.freestyle.abbott/us-en/support.html#app3. ======== To resolve any technical or Customer Service issues you are having with a FreeStyle Libre product, please contact FreeStyle Libre Customer Service directly. more",
  "reviews": [
    {
      "user": "NuttyNet",
      "date": "05/12/2024",
      "title": "Background Refresh Broken?\n\n    Developer Response",
      "review": "This freestyle Libre 3 app doesn’t have the feature control switch listed in the section to control background refresh… not sure that’s why it continually loses signal and I have to leave the app open and active of my device to Not loose the signal. But it is suspicious! AND… Really missing not being able to use Apple Watch stand alone… without rigging all the other apps to get the info on my watch… perhaps you are familiar…the option that requires you to Still carry your phone everywhere…and rely on three other apps(two additional companies) to feed the data to your watch…Doh!!! BUT… it’s NOW BROKEN even more… Now it’s worse, because with the app is constantly losing signal… it just breaks all the apps connected to it… signal loss alarms a blazing… annoying as ever and eating at my battery… regardless… because I have to keep my phone screen active and on… not to mention the awkward privacy concerns of having to always having the app open and HUGE displayed on my phone for everyone to see! I would delete and reinstall the app… but I don’t believe there is a way to reconnect the sensor I’ve already started 😩 Otherwise the tech is brilliant and it’s really super amazing and helpful to know your numbers without constantly dealing with bulk of a bag, the poking, and the endless sanitizing and cleanup… Abbott, please go that last mile to make this product 5 stars please!!! more Thank you for your comment. Please contact our Customer Care team at 855-632-8658 so we can better assist. more"
    },
    {
      "user": "GrantEatonDesign",
      "date": "01/04/2023",
      "title": "An amazing tool, but app needs work\n\n    Developer Response",
      "review": "I want to begin with my critique of the app. The critical alarm needs to be customizable. It is an ear-piercing alarm that you cannot adjust the volume of. Please allow for different volumes and allow for vibration alerts too. I understand that it’s a liability if the alarm isn’t heard, but the fact that there’s no way to lower the volume makes me uncomfortable with using it at work/in class. I can’t have this beeping when I’m attending a lecture or taking an exam. This really needs to be changed in order for diabetics to make this part of their daily life. This is my only critique as if 14 days of use. It is an amazing tool that relieves stress immensely. After 20 years of pricking my finger, it’s incredible to not constantly have to use traditional meter testing. While I still do use my meter everyday, the frequency with which I test is down by about 60%. Before Libre 3, I tested 12X a day. Now it’s around 5X. Also, the comfort of having truly accurate sensor readings upon simply opening my app is life changing. Thank you for giving diabetics some sense of normalcy and a break from the relentless guessing game of blood sugars. Even with proper management, some things just can’t be controlled. The Libre 3 has eased some anxieties and given me comfort I never thought I would have. Just please fix the alarm system. I want to enjoy this 24/7, not just when I am comfortable with a loud alarm going off in the privacy of my own home. more Thank you for your comment. Please contact our Customer Care team at 855-632-8658 so we can better assist. more"
    },
    {
      "user": "Mad35554",
      "date": "10/12/2024",
      "title": "Can’t turn off alarms. Inaccurately wakes me up all night.\n\n    Developer Response",
      "review": "Update. After using for six weeks the third sensor ended in the middle of the night, cutting out about three hours of use, based on when I applied the last, and then the app froze on “you must be an adult”. After applying a new sensor, the app remained frozen. Tried turning on and off my phone. That didn’t help. I had to uninstall the app and reinstall, losing all my history data. Here’s my original review. No changes since my review: You can’t turn off certain alarms in this version, so the app keeps waking me up. The problem is I’m a side sleeper so the sensor regularly loses connectivity or senses an inaccurate low reading. I have resorted to turning off my Bluetooth in order to get any sleep. When turning on my Bluetooth in the morning it won’t connect unless I reopen the app and wait three minutes. Thankfully, the sensor seems to have some built in memory, so it generally charts my nighttime numbers once I reconnect. I also dislike the fact that I can no longer take an immediate reading. It’s nice that the app reads the sensor every few minutes, but sometime you need to know right away and don’t have the luxury of staring at your phone for a few minutes in order to get a current reading. Fix these few things and it will be a great app. Not sure what can be done about the inaccurate readings when sleeping on my side, but I can live with that since I’m pretty consistent with my night numbers. more We'd like to follow up with this. Please give us a call at 1-855-632-8658 so we can better assist. more"
    }
  ],
  "compatibility": [
    "iPhone"
  ],
  "size": "47.7 MB",
  "category": "Medical",
  "ageRating": "4+",
  "languages": "English, Dutch, Finnish, French, German, Italian, Norwegian Bokmål, Norwegian Nynorsk, Spanish, Swedish"
}