{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "ShiftKey - PRN Healthcare Jobs 4+",
  "subtitle": "Nursing / Therapy / Dentistry",
  "seller": "ShiftKey, LLC",
  "stars": "4.7",
  "rating": "16.6K Ratings",
  "price": "Free",
  "appDescription": "ShiftKey gives you the FREEDOM to work when and where you want. Open up your world - and connect with available nursing, therapy, and dental shifts near you*. ShiftKey connects CNAs, LPNs, RNs, RTs, PTs and other healthcare professionals with open shifts at facilities in your area. Select the shifts you want to work and how much you want to make. ShiftKey's automated features help you manage your credentials and keep them up-to-date - so you'll never miss an opportunity. * Not all specialties available in all states -WORK WHERE YOU WANT Gain access to our nationwide network of clients with hundreds of PRN shifts in your area. -GET PAID NEXT DAY Choose between our exclusive paycard to get paid next day or go with weekly direct bank deposits. -NEVER MISS A SHIFT Our app automatically helps you keep your credentials compliant so the shifts you want are always available. Healthcare Professionals have scheduled millions of hours throughout the US. Join the movement! more",
  "reviews": [
    {
      "user": "amh9717",
      "date": "05/08/2023",
      "title": "I will never work full time CNA AGAIN!\n\n    Developer Response",
      "review": "I love everything about this app, especially love that they changed to daily pay using the pay card. Shifts are easy to pickup as well. BUT I do have a suggestion. I work nights (10pm-6am) and it’s a little annoying to have to change the filter every time I open the app. It sets to 150 miles away and I have to change that every time as well. If that can be changed to where it keeps your filters rather than resetting every time, I would be fulfilled with the app. Or also when premium shifts pop up, if you can choose in the app to be notified about only the shifts that you want to be notified about. Ex. I work 10pm-6am, then I can set only premium shifts that pop up for that time as my notifications since the premium shifts show up aaallllll day (while I’m trying to sleep during the day). more Hi there! Thank you for taking the time to write a review. ⭐️⭐️⭐️⭐️⭐️ We love that the ShiftKey app is able to provide great caregivers like you control of their schedule, flexibility and, ultimately, peace of mind.As a growing organization, we're always open to feedback & suggestions. You're feedback has been passed along to our Development team. Please feel free to email us at resolutions@shiftkey.com with any other suggestions that you may have! more"
    },
    {
      "user": "sickovethebs",
      "date": "07/04/2024",
      "title": "THEY DONT PAY YOU EVEN WHEN THE FACILITY DOES YOU WRONG\n\n    Developer Response",
      "review": "To all my health care professionals, BEWARE. Do not go to Brooklyn Queens Nursing home in brooklyn. They have needs on shiftkey and require nurses and cna’s to work 1 orientation shift with them. I requested it and they approved it 3 days later, 4 days before the scheduled shift. When myself and another healthcare professional arrived, the scheduler (the one in charge of booking everyone) greeted us and then asked for our paperwork. Why? Esp when we are cleared on the platforms to work. (Drug test, physicals and licensure) after that she had us wait about a hr and half to gathet the forms and said we needed to go Home because thats not how they do things and “shiftkey knows not to book anyone without them calling and meeting with admin before hand” which is a lie because they dnt book us, THE FACILITY DOES. So because i spent 3 hours traveling from one end of ny to brooklyn to provide services to them they REFUSED TO PAY ME, told me and the aide that and is now not answering to shiftkey demands to pay me for the hour and a half i was there and trouble and travel pay because they wasted my time. Shiftkey, KNOWS ABOUT ALL OF THIS, and have been delaying my pay for 3 weeks now because of this and let this facility treat their workers anyway. My case was assigned to maribel and do you think she has reached back out to me? DONT WASTE YOUR TIME PEOPLE more Thank you for your review. We are unable to locate you on the ShiftKey marketplace with the name used to post this review. We would love to resolve your issue. Please contact us at resolutions@shiftkey.com more"
    },
    {
      "user": "Keisha<3!",
      "date": "05/16/2022",
      "title": "Not sure how to feel\n\n    Developer Response",
      "review": "Haven’t been able to secure a shift yet. Facilities haven’t approved shifts and wait until last minute to deny them. I think they should make it rule where facilities have to approve or deny a shift no later than 8 hours before it’s supposed to start. Tired of picking up five days in advance for a morning shift with no word or approval on if I’m working. Also tired of going to bed the night before and having to wake up early just to not have my shift approved. Also they need to add either the scheduler’s or the DON’s contact info. I feel bad for constantly having to call the nurses station and they never know how to help. The help option should be available 24/7. We work all hours of the day not just 9-5. Overall it’s just really annoying trying to navigate. I shouldn’t have to call facilities to have my shift approved they should be required to look at it as soon as they get it. I also don’t understand the premium shifts. I understood they pay more because they’re last minute help, but even those still take forever to be approved. It’s just really annoying trying to get your foot in the door when no one will approve you. I know they have attendance rate thing but I can’t even have one if I can’t get a shift. more Hello, Thank you for bringing this issue to our attention! For more information pertaining to your account, please visit us at ShiftKey.com and engage with one of our chat reps 24 hours a day, 7 days a week! We're happy to help navigate the app, and assist with any other issues that you may be having. Thank you for taking the time to leave a review and we hope to see you on the ShiftKey platform! more"
    }
  ],
  "compatibility": [
    "iPhone"
  ],
  "size": "74.3 MB",
  "category": "Medical",
  "ageRating": "4+",
  "languages": "English"
}