{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Cathlas 17+",
  "subtitle": "Coronary Angiography Atlas",
  "seller": "Spectre Software Inc.",
  "stars": "5.0",
  "rating": "16 Ratings",
  "price": "Free",
  "appDescription": "The Cathlas app is a comprehensive “atlas” of angiographic videos in various topics, developed for interventional cardiologists and cardiac catheterization lab staff. The progress of technology allows for the delivery of a collection of rare and important video images to users in a practical way that cannot be similarly produced via textbooks or peer-reviewed journals. The app is designed to cultivate and integrate contributions from users who would like to add educational images, videos and data that will enrich the knowledge of the interventional cardiology peers community. The moderation and inclusion of images will be processed by experts in the field prior to their publication online. DISCLAIMER: Cathlas has been developed as a reference aid only, and no guarantees are made regarding the completeness or adequacy of the representations shown and information conveyed by the app. The app will not be liable for any claims arising from its use. Please seek a doctor's advice in addition to using the app and before making any medical decisions. This app does not contain any personal information. Cathlas includes angiographic videos in various topics – for example: Anatomy of coronary arteries with focus on coronary anomalies • Coronary angiography videos with corresponding CT images • Explore and learn to recognize complications • Images of congenital heart disease and right heart catheterization hemodynamics • Unique images of coronary bypass grafting and acute coronary syndrome • Left ventriculogram and aortogram • Mechanical valve fluoroscopies – learn to recognize different valves, normal angels of opening and closing • Intracoronary imaging with intravascular ultrasound and optical coherence tomography images • How to recognize device in fluoroscopy • Rare and important incidental findings on fluoroscopy • Structural cases of TAVR, mitral clip, TMVR, Watchman… • Practice your diagnostic skills with set of heart catheterization videos • Explore high-quality heart catheterization images more",
  "reviews": [
    {
      "user": "dove24noa",
      "date": "01/11/2023",
      "title": "Amazing Cath Lab Resource!!",
      "review": "As a Cardiovascular Technologist working in the cath lab, I found this app to be very informative and useful. Great images and detailed descriptions. I think this app is a great study tool for RCIS as well. more"
    },
    {
      "user": "Meridorledorvador",
      "date": "01/11/2023",
      "title": "Excellent!",
      "review": "Thank you for developing this excellent and useful tool!!!"
    },
    {
      "user": "Danel T",
      "date": "02/05/2023",
      "title": "👍",
      "review": "Very useful informative Cardiovascular Resource."
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "32 MB",
  "category": "Medical",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English"
}