{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Welldoc 12+",
  "subtitle": "",
  "seller": "WellDoc, Inc.",
  "stars": "3.6",
  "rating": "18 Ratings",
  "price": "Free",
  "appDescription": "We know that managing your health can be tough. But it doesn’t have to be. The Welldoc App supports prediabetes, diabetes, heart failure, hypertension and weight management, with tools available to manage your mental wellbeing. We’re here to help you think less about your condition—making those day-to-day choices so much easier—so you can stay focused on living. Think of the Welldoc App as a smart, digital health coach on your phone. Right by your side, right where you need it. Welldoc provides you tips, reminders, and insights in the way that’s just right for you. It’s easy-to-use and secure. And the more you use it, the better it gets! Note: • The Welldoc App is only available via your health plan, health system or employer. The Welldoc App can help make managing your health easier with: DIGITAL COACHING: It brings together thousands of data points—everything from your day-to-day actions to your overall health goals—to give you guidance right when you need it. TOTAL HEALTH APPROACH: Help build better habits by understanding how medications, nutrition, activity, sleep, and device data, such as data from Apple Health®, affect your health. PERSONAL TO YOUR GOALS AND JOURNEY: Set goals and challenges to keep you motivated and on the right track THE SUPPORT YOU NEED TO MANAGE YOUR HEALTH: The more you know, the better your choices. Learn what you need—at your own pace—with tools, education, and guidance all in one place! SHARE YOUR PROGRESS: Celebrate your successes and share your challenges with your doctor and care team —easily and quickly. The Welldoc App is not intended to replace the care provided by a licensed healthcare professional, including prescriptions, diagnosis, or treatment. Seek the guidance of a licensed healthcare professional before making medical decisions. The Welldoc® App includes Welldoc Diabetes and Welldoc Diabetes Rx, which is Software as a Medical Device (SaMD) intended to be used by healthcare providers (HCPs) and their patients – aged 18 years and older – who have type 1 or type 2 diabetes. Welldoc Diabetes and Welldoc Diabetes Rx is intended to assist patients in managing their diabetes with guidance from their providers. Welldoc Diabetes Rx requires a prescription. Welldoc Diabetes and Welldoc Diabetes Rx should not be used by patients with gestational diabetes or patients using an insulin pump. Improper use of Welldoc Diabetes and Welldoc Diabetes Rx may result in unsafe recommendations that could result in hyperglycemia or hypoglycemia. Visit www.welldoc.com for full labeling information. The privacy and security of your personal information is very important to us. We protect it in accordance with the Health Insurance Portability and Accountability Act. ABOUT WELLDOC Welldoc is committed to improving the health of individuals living with a chronic disease. © 2009-24 Welldoc, Inc. Intellectual Property. All rights reserved. The Welldoc and BlueStar name and logo are trademarks of Welldoc. Made in the USA. Manufactured by Welldoc. more",
  "reviews": [
    {
      "user": "Cfrwnchfries",
      "date": "11/09/2023",
      "title": "Well doc\n\n    Developer Response",
      "review": "I love it Thank you for the five star review! We're happy to hear you're enjoying the Welldoc app. Keep up the great work! more"
    },
    {
      "user": "JStump5255",
      "date": "07/19/2023",
      "title": "Not a good first impression\n\n    Developer Response",
      "review": "I downloaded the app, prompted via them, for not even 10 mins. I tried signing up and it ask about my health conditions. It asks about diabetes, heart failure, and high blood pressure. I don’t have any of these conditions but I have to select one in order to complete the sign up. Otherwise it doesn’t let you continue. Not a good first impression. more Thank you for sharing your feedback. We apologize for the issue you experienced during registration. Welldoc app eligibility and access are determined through a participating health insurance plan, employer, or health system. Please call our Customer Care team at 1-888-611-4794 to discuss your plan options. Thank you. more"
    },
    {
      "user": "Eduardo2157",
      "date": "01/26/2023",
      "title": "Worst App Developed\n\n    Developer Response",
      "review": "This app has a lot of issues it stopped working today. I reinstall the app twice and the app will not open prior to having this problem. I had issues with Bluetooth, connecting with the meter. Before this app was released to the pubic it should’ve been thoroughly tested. more Hello - We are sorry to hear you are experiencing issues accessing the Welldoc app. We want to work with you to make this right. Please call our Customer Care team at 1-888-551-4228, so we can investigate this further. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch"
  ],
  "size": "189 MB",
  "category": "Health & Fitness",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English, French, German, Spanish"
}