{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "VA: Health and Benefits 17+",
  "subtitle": "US Dept. of Veterans Affairs",
  "seller": "US Department of Veterans Affairs (VA)",
  "stars": "4.8",
  "rating": "164K Ratings",
  "price": "Free",
  "appDescription": "With the official VA: Health & Benefits app, you can manage your VA health care, benefits, and payments from your mobile phone or tablet. Features include: Biometric sign-in - Use your phone’s built-in security features—like fingerprint and face recognition—to securely access your information. Health care tools - Refill and track your VA prescriptions. - Send and receive secure messages from your VA health care team. - Review appointments and add them to your calendar. - Get your records for VA vaccines, such as COVID-19. Benefits tools - Check your disability rating. - Review your claim or appeal status. - Submit evidence for your claim or appeal. - Download common VA letters. Payments tools - Review payments we’ve sent you. - Update your direct deposit information. Facility locator - Find VA facilities and services near you. Veterans Crisis Line - Get quick access to the VA Crisis Line. Proof of Veteran status - Show proof of your Veteran status. Need help with this app? Call us at 800-698-2411 (TTY: 711). We’re here 24/7. more",
  "reviews": [
    {
      "user": "joel bowden7",
      "date": "08/23/2024",
      "title": "Pretty Solid 🤯",
      "review": "I have been using the app since the beginning of 2021. They have continually improved and updated since then and the updates have been helpful and the additional resources included in the app, such as messaging your actual, personal, local, medical providers and getting real-time responses in my experience on average 10 minutes or less. This is huge in helping veterans with social isolation or suicidal ideations and PTSD and other disabilities schedule appointments and reach out for care without physically talking to someone on the phone, but still being able to reach a VA employee who can schedule all the care needed on a case by case basis and tailor it to your personal needs. Since the amount of time a claim requires for processing from beginning to end is average 3-6 months they should consider upgrading to an even more in-depth system to show the veteran where they are in the process exactly without any assuming involved, the veterans next actions/steps to be done exactly, and a ballpark/estimated completion date would go a long way in improving the attitude of veterans towards the VA claims process. I believe it would eliminate some if not all of the uncertainty around the length of time the claim will be, and the feeling that the claim is not being handled or being given the attention it deserves, both would considerably reduce the amount of phone calls received daily pertaining to claims and status. 🇺🇸FYea more"
    },
    {
      "user": "mjgshshejn",
      "date": "11/11/2021",
      "title": "Really helpful",
      "review": "As someone who frequently uses the VA website for disability claims and healthcare, this is a huge timesaver. I read in another review that there might soon be notifications of medical appointment changes. This would be huge since I’m usually not told when an appointment changes or gets cancelled. The only improvement I would like to see is an ability to refresh the status of a disability claim. For instance it is 4:30 in the afternoon now but it is showing my most recent status from when I checked it at 10pm yesterday. It seems you can only check it once per 24 hours with the app. This is fine most of the time but when they are getting close to publishing a final decision, I’d like to refresh more often. As it stands, this is now pushing me back to the website daily. more"
    },
    {
      "user": "Dorkfacekilla",
      "date": "07/13/2024",
      "title": "Conveniently annoying",
      "review": "Logging in and out of this app is very inefficient. I have Face ID setting turned on, yet every time I log in, there are probably six or seven screens to navigate through just to get in, including “waiting to redirect” and needing to text authentication codes every time. And when you log out, there are 4 pages and prompts to get through just to leave. The messaging system needs some work too. It only shows a portion of sent messages, and when you click the down arrow to expand the window, it still won’t show you the full message. And for writing new messages, the main message box is irritating at best. Accidentally touching outside of the box makes the text go gray, and the screen jump up and down. The cursor is like a sick joke being played on me, and most of the “continue” buttons need to be pressed at least two or three times to activate. I downloaded the app because it’s supposed to be simpler than using the website, but that doesn’t seem to be the reality. And considering that a lot of us veterans are suffering from PTSD and high anxiety, I would hope that the developers could create an app that doesn’t give me a near panic attack every time I need to use it. Do better, please. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "23.2 MB",
  "category": "Medical",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English"
}