{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Dexcom G7 4+",
  "subtitle": "Continuous Glucose Monitoring",
  "seller": "Dexcom",
  "stars": "2.5",
  "rating": "1.7K Ratings",
  "price": "Free",
  "appDescription": "The Dexcom G7 Continuous Glucose Monitoring (CGM) System includes a wearable sensor and provides real-time glucose readings and alerts Know your glucose number and where it’s heading with the Dexcom G7 Continuous Glucose Monitoring (CGM) System. Only use this app if you have the Dexcom G7 CGM System.* Before you start making treatment decisions with Dexcom G7, work with your healthcare professional to learn how. The Dexcom G7 Continuous Glucose Monitoring (CGM) System supports more empowered and integrated diabetes management. Its low-profile, wearable sensor provides real-time glucose data to a user’s compatible display device, no fingersticks required.† Dexcom G7 also offers customizable alerts that can help warn of high or low glucose levels, as well as remote monitoring and reporting options that help keep users connected to their loved ones and care teams anytime, anywhere. *To view a list of compatible devices, visit dexcom.com/compatibility. †If your glucose alerts and readings from Dexcom G7 do not match symptoms or expectations, use a blood glucose meter to make diabetes treatment decisions. In addition to the accurate performance provided by the Dexcom Sensor, you’ll receive other valuable features: • Share your glucose data with up to 10 followers who can monitor your glucose data and trends on their compatible smart device with the Dexcom Follow app. Share and Follow functions require an internet connection • Connect G7 Sensor directly to your Apple Watch, giving you the freedom and convenience of real-time glucose readings on your wrist even when you’re not near your phone** • Digital Health app integrations allow you to share your glucose data with third-party health apps and lifestyle devices • Now you can see your health and activity data from connected apps and devices on your G7 trend graph • Add a shortcut so you can ask Siri to read your current glucose value, using a custom phrase • Dexcom Clarity summary insights are integrated into the G7 app, so that you can see both real-time and retrospective glucose insights from the same app Apple Watch: • View your glucose information, trend graph, and alerts right from your wrist with the Dexcom G7 Apple Watch app. Watches require compatible smart device to use app. G7 app features and partner integrations may differ by region. Refer to your user guide for more information. **Compatible smartphone is required to pair a new Dexcom G7 sensor with a compatible Apple Watch. Dexcom G7 users must continuously have their smartphone within 20 feet / 6 meters to utilize the Share/Follow features. Apple Watch is not capable of Share/Follow. more",
  "reviews": [
    {
      "user": "xItzJustAlex",
      "date": "05/28/2024",
      "title": "Dexcom G7 app needs improvement\n\n    Developer Response",
      "review": "The Dexcom G7 app currently lacks quite a few options and features. Here’s a list of items the Developers should work on: Add 200 mg/dL graph height option. Additionally, this could be added to the “…” above the chart for quicker customization. Add 8 hour option to Glucose trend graph. Plot blood glucose fingerpick readings on Glucose trend chart to be able to easily compare with CGM readings. Add “DarkMode” option for easier readability, especially at night. Add ability to describe or select from drop down menu the Activity; walk, run, swim, bicycle, treadmill, etc. Add ability to select from drop down menu the Meal type; breakfast, lunch, dinner, snack. Add ability to input Medication that isn’t in the search. Insulin Dose Log under Glucose tab should show up to 10 glucose readings instead of 3-4. Historical information under History tab should show more data without needing to download Clarity app. Additionally, filter options for blood glucose, insulin, medication, meal, activity, and note would be nice. Add a better way to report app bugs, provide feedback, etc. under Profile > Support > Feedback. Move Sensor information under Connections tab to Glucose tab and all the rest under Connections tab to Profile tab. Connections tab should be replaced with something more functional like medication, insulin and activity reminders. more Hello. We would like to follow up with you. If you would like a member of our team to reach out, please submit a request through our Self-Service Patient Support Portal located at https://www.dexcom.com/priority-support. Thank you. more"
    },
    {
      "user": "GaXIMUS",
      "date": "02/02/2024",
      "title": "Cannot dismiss alerts from watch\n\n    Developer Response",
      "review": "This app is almost good. It’s missing two features that are standard in every other app in the AppStore. And with those features it would be 4 stars. 1. Most important. Be able to dismiss alerts from the Apple Watch. I get alert, dismiss the alert of the watch, but a minute later it alerts again. Making me have to open the app on my phone to dismiss the alert. If I’m in a meeting or somewhere important I can’t be pulling out my phone or having Loud critical alerts going off every couple of minutes for something I’ve taken care of. An even better feature would be to let me get a 1 minute quiet notification on my watch that I could clear before even setting off a critical alert. But as the way it is now, I’m going to have to turn off critical alert notifications, which is not a good thing. 2. This doesn’t seem like a big one, but it is. Dark mode. It exists on Dexcom Follow app, so I know there Devs know how to do it, and they should be using shared libraries, so why am I blinding my self at night to check my Blood Sugars? A device and technology so advanced it can tell me my blood sugar every 5 minutes just by looking at a screen, when just 20 years ago we were peeing on sticks, and not long before that peeing on the ground and watching for ants. But yet my retinas burn when I check my blood sugar. And my I get just as embarrassed as everyone stares at me thinking I didn’t mute my phone for the meeting. Please fix this. more Thank you. We appreciate your review. We will pass your feedback along to our Product team for consideration in future updates. If you would like a member of our team to reach out, please submit a request through our Self-Service Patient Support Portal located at https://www.dexcom.com/priority-support more"
    },
    {
      "user": "Eric536C75747A",
      "date": "09/20/2024",
      "title": "Useful but frustrating\n\n    Developer Response",
      "review": "The app itself is works well for me and I like the features it does have. My issues with it are the features it lacks, starting with dark mode. Why, after all these years, is there no support for dark mode?! When I wake up in the middle of the night to deal with an alert it makes it that much harder to see, process, and understand what the app is trying to tell me when I'm being blinded by the glaring brightness of this solid white screen. I already set my screen brightness at its lowest level at night and it's still not enough. I don't have this issue with the Tandem t:connect app when I need to use my pump, because they actually implemented a dark mode. My next issue is with the watch app and how few watch faces the G7 complication even supports. I just updated my watch to watchOS 11 and the photo watch face, which I had previously been using the G7 complication with just fine, no longer shows the G7 as an option. Why????? Why does there seem to be so little support for developing this app? Why does it take so long to get anything updated in this app or to add any features? If the issue isn't Dexcom and instead it's healthcare regulations that are slowing everything down, why can't Dexcom be more transparent and open about it? more Thank you. We appreciate your review. We will pass your feedback along to our Product team for consideration in future updates. If you would like a member of our team to reach out, please submit a request through our Self-Service Patient Support Portal located at https://www.dexcom.com/priority-support more"
    }
  ],
  "compatibility": [
    "iPhone",
    "Apple Watch"
  ],
  "size": "397.5 MB",
  "category": "Medical",
  "ageRating": "4+",
  "languages": "English, Arabic, Czech, Danish, Dutch, Finnish, French, German, Hebrew, Italian, Japanese, Korean, Norwegian Bokmål, Polish, Portuguese, Slovak, Slovenian, Spanish, Swedish, Turkish"
}