{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "OctaApp – Donate Blood Plasma 4+",
  "subtitle": "Plasma donations made easy!",
  "seller": "Octapharma Plasma Inc.",
  "stars": "3.0",
  "rating": "513 Ratings",
  "price": "Free",
  "appDescription": "When you download the OctaApp, it makes donating plasma, saving lives, and earning money faster and easier! Octapharma Plasma collects, tests, and supplies plasma used in making life-saving medicines for patients in your community and around the world. Features: Location · Find plasma donation centers near you Next Donation · View your next eligible date to donate plasma OctaPass · Complete the health questionnaire via the app and skip the kiosk! Loyalty Program · Check your plasma donation status levels and redeem points earned! Refer-a-friend · Quickly and easily refer your friends and family for added bonuses Earnings · Learn how much you will earn with each plasma donation Card Balance · Check your debit card balance and payment history Updates & Promotions · Learn about company updates and upcoming promotions With more than 150 plasma donation centers and 3,500 employees across the U.S., our donors are our most valued customers. Your donations make saving and improving lives possible every day! Family-owned since being established in 1983, Octapharma has imagined a healthier, better world, believing that together we can invest to make a difference in people’s lives. As a global healthcare company with products available in 118 countries, it has maintained this commitment reaching hundreds of thousands of patients every year. Focused on 3 therapeutic areas - hematology, immunotherapy and critical care - Octapharma produces medicines based on human proteins sourced from our own plasma donation centers. Octapharma continues its mission to help even more people in need through the strength and resilience of its employees, and the dedication and commitment of its exceptional donors. To learn more about Octapharma Plasma and the benefits of donating, visit www.octapharmaplasma.com. more",
  "reviews": [
    {
      "user": "LindaLee Deer",
      "date": "12/03/2023",
      "title": "App not working properly",
      "review": "I don’t understand why the app logs you out. Normally, when this happens I find a way to log back in. However, this weekend I could not log back in due to forgetting password. But when I asked to reset password, I never received an email or text to reset password. So I had to do questionnaire in clinic. This takes longer and the staff didn’t know how to help me with the app not working correctly. There should be tech support to help with app issues! When the app works, it is great and easy to use. more"
    },
    {
      "user": "They Do Not Pay Out",
      "date": "12/20/2022",
      "title": "*** THEY DONT MAKE FULL PAYMENTS ***",
      "review": "When I did my 1st 2 donations, they both showed that I got a hundred dollars, but as soo as I used the card for the 1st time “ less than 5 dollars” and once for 15, all of a sudden I had 8 dollars left! On my second donation i used for 4 dollars and second for 35 and now I have a 60 dollar charge! The system is soo sketched out! I’m missing over $140+ and from the octapharma to their card partners, they just send you in circles! No one is trying to fix it and the phone number you get always drop the call when you select to talk to a representative! They are literally lying about the five in take in the entire process and this makes people not want to come back! I would recommend doing business somewhere else! They are not paying correctly and not fixing accounts! more"
    },
    {
      "user": "Shadow 24/7",
      "date": "03/02/2023",
      "title": "Not counting my previous donations.",
      "review": "Only got 50 points for downloading the app but none for my donations I’ve made before hand that are on record on this very app. Feels like a dirty move. Why show my donations and show that they were all worth 100 each and yet none of them are actually being counted? I’ve donated for 2.5 years straight and that’s not including the 3 half years of donating I did before then. Am I really being forced to start from the very beginning? I don’t expect all my donations before the app was created to be counted. That or maybe I get like 10 points for each of the donations I made before downloading the app. But nothing at all is ridiculous. Especially with others complaining that y’all are moving the goal post while not moving them at all. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Apple Vision"
  ],
  "size": "29.1 MB",
  "category": "Medical",
  "ageRating": "4+",
  "languages": "English"
}