{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "EchoGuide 12+",
  "subtitle": "",
  "seller": "American Society of Echocardiography",
  "stars": "4.7",
  "rating": "37 Ratings",
  "price": "Free",
  "appDescription": "ASE’s EchoGuide provides access to over 50 calculators, algorithms, and charts. EchoGuide was developed based on key ASE guidelines for use by healthcare professionals providing cardiac care. One special feature in the app is that users have the ability to select their favorite interactive tools for easy access. Topics include: • Left Ventricle • Left Ventricle Mass • Left Ventricular Diastolic Function • Right Ventricle • Left Atrium • Right Atrium Dimensions & Volumes • Aorta • Aortic Regurgitation • Aortic Stenosis • Mitral Regurgitation • Mitral Stenosis • Tricuspid Regurgitation • Tricuspid Stenosis • Pulmonic Regurgitation • Pulmonic Stenosis • Prosthetic Aortic Valve Function • Prosthetic Mitral Valve Function • Prosthetic Tricuspid Valve Function • Prosthetic Pulmonic Valve Function • Prosthetic Valve Regurgitation EchoGuide is intended for educational/informational use only. EchoGuide is not intended for use in the diagnosis of disease or other conditions, or in the cure, mitigation, treatment, or prevention of disease by aiding clinical decision-making. Please send feedback through the App information page and feel free to leave a review and rating in the App Store. more",
  "reviews": [
    {
      "user": "JPANAHI",
      "date": "11/14/2022",
      "title": "New ASE App, Easy to Use and Accurate",
      "review": "Official Beta tester for this Amazing App that is ASE approved and built. As a user of previous ASE App and tester for this one I highly recommend it! It is simplified to allow for quick calculations allowing for more in-depth learning if desired thorough drop down links. As an ACS with FASE recognition this App is helpful not only for the students I mentor but career sonographers. Drop downs are linked to current ASE papers that can be easier updated in our ever changing field. Rest assured this will be a great App for years to come and will be updated continuously. Get it Now! Happy scanning. more"
    },
    {
      "user": "Faloye, MD",
      "date": "11/14/2022",
      "title": "Quick calculator",
      "review": "Quick calculator! I don’t have to scroll through tables and texts to find the correct answer. Love it!"
    },
    {
      "user": "#JADEL",
      "date": "11/15/2022",
      "title": "Love it!",
      "review": "I use this everyday to streamline my practice by including ASE guideline-based values, calcs, and algorithms at my fingertips. My Sonographers get immediate feedback; my fellows build their knowledge base; my patients get expert care! Thanks ASE! more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "89.6 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "Spanish"
}