{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Ro 17+",
  "subtitle": "Your healthcare, simplified.",
  "seller": "Roman",
  "stars": "4.8",
  "rating": "3.5K Ratings",
  "price": "Free",
  "appDescription": "Welcome to Ro—healthcare designed to help you feel and be your best. Through Ro you can connect with Ro-affiliated US-licensed healthcare professionals, 100% online. Get world-class treatments and products for sexual health, fertility, skincare, weight management, and more. The Ro app puts you in control of your healthcare discreetly and conveniently–whether you’re seeking treatment for erectile dysfunction or hair loss, weight loss or acne, or another health goal that will help you live a more fulfilled life. Download the app today and discover all Ro has to offer to improve your overall health and wellbeing. - Reliable, secure, and discreet care—all in one place. - High quality customer care, 24 hours a day. - Curated content and support through your care journey. - Easy access to our entire collection of over-the-counter offerings for everything from daily supplements to hair care products—and much more. - Real-time order tracking, from the pharmacy to your home. - Regular treatment updates: From notifications when your order ships to when you receive a message from your Ro-affiliated provider. more",
  "reviews": [
    {
      "user": "leo88p2",
      "date": "06/27/2023",
      "title": "App needs work\n\n    Developer Response",
      "review": "There’s no habit tracker in the app like some of their competitors have, the order history in the app is not kept up to date. Message alerts don’t appear in the app, for many things the website had better information. “Your curriculum” (info and tips about whatever it is you’re using Ro for) is not in the app that I’ve found, however it’s on the main page on the website. Like others have mentioned, typing messages in the app is weird and doesn’t automatically give a space like typing in anything else with an iPhone. There’s no place in the app to go and review data you’ve entered (sort of goes along with my first point of no habit trackers). My overall experience outside of the app has been fine, but the app could definitely use some work. more Hi leo88p2, thanks for sharing this feedback. We are working on some improvements to the app to include more capabilities like updated order history and educational content & tips. Stay tuned! And please don't hesitate to share more - feedback like yours is instrumental in helping us improve the program and app experience. more"
    },
    {
      "user": "Merrr.H",
      "date": "05/04/2023",
      "title": "Terrible customer service\n\n    Developer Response",
      "review": "I started the Ro body program over a month ago. The process took a long time to get started but they did warn me about that so I understood. But now I am on my 5th week and my insurance plan changed so I warned them multiple times via the chat, email AND the phone. Every single person I've talked to is on a completely different page. I finally ended up calling and the woman was like \"oh it looks like your insurance update was never properly communicated\"......after I sent it multiple times and told them multiple times.....now, they keep telling me \"they're looking for a different pharmacy with the medication in stock\" I keep telling them that I'm pretty sure they need to restart the authorization process since I got new insurance and NO ONE is listening. It's almost like I'm talking to a computer. Every single person I've talked to has said something completely different. I'm unsure when/if I'll ever get the medication again and now since they won't listen to me, it will be a lot farther out than I had anticipated and I'll have to start completely over on the dosage. Also, they claim they get back to you within 24-48 hours and shut off their phones so you can only email or chat and then they ignore you. I have NO idea when my issue will ever get resolved and honestly it's VERY frustrating. more Hi Merrr.H, I am really sorry to hear about the experience you've had on the Body Program, and I would love to help you resolve this issue. Please submit a request through the Mobile App that you need help with your account, address it to Alejandro (Sr Director, Member Experience), and say you're following up on your App Store review. He will follow up with you within a few hours. more"
    },
    {
      "user": "Jelarso09",
      "date": "04/24/2024",
      "title": "We’re great for setup but have gone downhill fast.\n\n    Developer Response",
      "review": "I was so excited when I found out about Ro and the weight loss program they have. They made it easy to get PAs and get my initial medication arranged. It all pretty much went down hill from there. The app is suuuuper clunky. It asks you to log doses and do checkins on your Home Screen only to give you errors that it’s “too early” since your last shot to do them- well then don’t prompt me to. It also doesn’t let you change any of the information you’ve entered, so for one of my weight logs I hit an 8 instead of a 7 for a number and wouldn’t let me change it, so it looks like I randomly gained 10 lbs one week. They are SLOW to respond to messages and when they do they are so clearly a canned message response it’s infuriating. It misses half of what you asked about or includes multiple things you didn’t ask about at all. For $145/month, not including the medication, I expect a lot better. Would recommend Zepbound in a heartbeat, but safe yourself some frustration and get it somewhere else. more Hi there- I'm so sorry to hear this was your experience with us. We appreciate your feedback and will share this with the team so we can improve our app and communication. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "Apple Vision"
  ],
  "size": "197.5 MB",
  "category": "Medical",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English"
}