{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Owlet Dream 4+",
  "subtitle": "Better Sleep for Families",
  "seller": "Owlet Baby Care, Inc.",
  "stars": "4.3",
  "rating": "11.7K Ratings",
  "price": "Free",
  "appDescription": "Owlet: Your Trusted Partner in Infant Care At Owlet, our commitment is to provide parents and caregivers with the tools they need for peace of mind. The Owlet Dream App, with its integration of the FDA-cleared Dream Sock® and new features, is a testament to that promise. We're continuously working to enhance your experience and support the health and safety of your precious little one. Compatible Products: Owlet FDA-Cleared Dream Sock® Owlet Cam® Owlet Cam® 2 Owlet Dream Duo (Dream Sock + Cam 1) Owlet Dream Duo 2 (Dream Sock + Cam 2) Disclaimer: Owlet products offer a connected nursery experience designed to learn from the data collected to help you understand. They are not intended to diagnose, treat or cure any disease or other conditions, including but not limited to Sudden Infant Death Syndrome (SIDS). Medical decisions should never be made using Owlet data. Owlet products do not replace the care and oversight you provide as a caregiver. The medical hardware paired with the Dream app has obtained the following regulatory clearances: FDA clearance, UKCA Marking, and CE Marking. These clearances extend to regions that recognize and accept these certifications. Are you a fan of Owlet? Please leave a review in the App Store! --- Owlet Insights Insights includes deeper views into Dream Sock data, trends and insights. Insights is a software subscription services to be used with connected hardware, Dream Sock. Payment will be charged to your Apple ID account at the confirmation of purchase. The subscription automatically renews unless it is canceled at least 24 hours before the end of the current period. Your account will be charged for renewal within 24 hours prior to the end of the current period. You can manage and cancel your subscriptions by going to your App Store account settings after purchase. Cancellation of the current active subscription period is not allowed. Length of Subscription: Monthly $5.99 or Annual $54.99 options Terms of Use (EULA): https://owletcare.com/pages/terms-and-conditions Privacy Policy: https://owletcare.com/pages/privacy more",
  "reviews": [
    {
      "user": "Queenly23",
      "date": "09/09/2023",
      "title": "App needs improvement",
      "review": "I only use the Owlet Dream Sock and although I am pleased with the sock itself and it’s designed purpose of helping keep my mind at ease while my baby sleeps, I am not impressed with the app itself. It takes several “refreshes” and even closing and re-opening the app in order to see the current sleep state. I wish the app would provide some sort of chart that shows awake, light and deep sleep patterns. My Apple Watch tells me more about my sleep patterns than the Owlet does for my baby. Lastly there should be some sort of turn off or check-in button when it’s having “difficulty getting readings”. There will be times where I’m holding my baby, I know he’s fine and even though I dismiss the notification the base will still continue to sound and it’s frustrating. Also I had to move the base to his actual changing table because otherwise when I take it off the base as I’m getting him ready for bed the sock will start alarming if I don’t put it on asap. I’ll snooze the base and it will literally go off in what feels like another minute. There could maybe be some sort of, ready to start tracking sleep button. Overall, the sock does it’s job of keeping track of my baby’s heart rate, oxygen level and sleep status but doesn’t do much more than that. You’d think for $300 the app would be better. more"
    },
    {
      "user": "ErinRJ94",
      "date": "08/17/2024",
      "title": "Sock itself is great, App is worthless\n\n    Developer Response",
      "review": "This app needs serious improvement. It claims to “clinacally proven, medical grade accuracy” which is true, as long as you can get the app to stay open long enough to load the levels. The app is constantly quitting while in the middle of “loading” my babies vitals and sleep state. It takes 10 or so minutes to update the current sleep state. And often times, I click on my babies profile to see the sleep state and it shows there is no sock connected, causing me to reset everything at 1:00, 2:00, 3:00 in the morning. The range from sock to base is not designed for bigger houses. When we bring our babies from their room to the living room, the base will beep at you constantly because of connectivity issues. And our living room is the same distance as their room. Even if you turn the base off completly, it seems to still beep after a few minutes of getting readings. And when it is beeping at you, trying to open the app takes even longer so I’m sitting there overstimulated with a screaming baby and a phone & base that won’t stop beeping because the app takes FOREVER to load. I love that this is designed to alert me and to keep my baby safe and I will say it has helped me get better sleep since my twins were born. But we spent almost $700 on these two owlet socks. For that money, this app should be working way better than what it is. Do better, Owlet. Do way way better. more Hello from the Engineering team at Owlet. We're very sorry to hear you're having trouble. We would like to help you figure this out. Can you please email us at ios_app_reviews@owletcare.com so we can assist? more"
    },
    {
      "user": "MJ_PTA",
      "date": "12/28/2023",
      "title": "App need work",
      "review": "The app is the worst. The price is not worth it, I wish I had done my research before purchasing it. I will say the sock is a great idea giving your baby's heart rate and oxygen level, however, it causes more anxiety when not working and how poorly supported it is by the app. The way it works in regards to the charging station, the location of where it needs to be, and troubleshooting any connection issue is the most annoying and inconvenient. The sock needs to be in the charging station when not in use or else you set off the alerts, and that is also where the alerts noise comes in as well as the app, so you can't have it near a sleeping baby and there is no off button on it (there is snooze) or else levels are not monitored and the app reflects as base station off, in other words not reading levels. We have it outside of the nursery and have to run back and forth when putting it on baby. Just another step in our bed/nap time routine at this point. I continue to use it because when it works it's awesome and I love to see how his hr/O2 fluctuates between sleep cycles, just frustrated with the poor connectivity to the app and the troubleshooting anxiety that one has to go through to get back online/refreshing app especially at 3 am when you are already sleep deprived. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch"
  ],
  "size": "199.7 MB",
  "category": "Lifestyle",
  "ageRating": "4+",
  "languages": "English, Bulgarian, Czech, Danish, Dutch, Finnish, French, German, Greek, Hungarian, Icelandic, Italian, Japanese, Korean, Norwegian Bokmål, Polish, Portuguese, Romanian, Simplified Chinese, Slovak, Spanish, Swedish, Turkish"
}