{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Grifols Plasma Donor Hub 4+",
  "subtitle": "Donate Plasma. Impact Lives.",
  "seller": "GRIFOLS SA",
  "stars": "4.7",
  "rating": "11.5K Ratings",
  "price": "Free",
  "appDescription": "Your Plasma Donation experience just got smoother! Grifols DonorHubTM is your go-to place for all your plasma donor needs. —————————————————————————————————————————— Use Grifols DonorHub™ to: • Check your donation and compensation history - Details of your most recent donation are available in Grifols DonorHub™ 24 hours after your visit. • Stay up-to-date on all things Grifols Plasma- Enable push notifications to never miss an update. • Receive tips to help prepare for your next plasma donation. • Learn what happens to your plasma after your donation. • Schedule your donation appointments. • Refer a Friend: Spread the Word & Earn Rewards: Easily refer friends and family to become plasma donors. • Ask the Chatbot any question you have —————————————————————————————————————————— Tips for a Better Donation Experience 7. Drink at least 12-to-24 ounces of water or a sports drink 30-to-60 minutes before your donation. Proper hydration helps ensure the procedure is well-tolerated and recovery is quicker. 8. Limit caffeinated beverages and milk on the day of your donation, as they reduce iron absorption and can elevate your pulse. 9. Avoid alcohol the day before and the day of your donation to prevent dehydration. 10. Avoid foods high in saturated fats and cholesterol the night before your donation, as they can make the donation process longer. 11. Get a good night’s rest before your donation to aid in quicker recovery. 12. Discontinue and avoid all tobacco products before donating, as they may increase your blood pressure and heart rate. —————————————————————————————————————————— Getting started is easy: If you're already registered in Grifols DonorHub™: Just download the app and log in! The Grifols DonorHub™ app has all the features found in the web version. If you're not registered yet: Download the Grifols DonorHub™ app. Register for Grifols DonorHub™: Enter your registration number, name, date of birth, mobile phone number, email address, and choose a password. Don’t forget to turn on notifications for Grifols DonorHub™! —————————————————————————————————————————— Stay connected with us: • Visit our website: https://www.grifolsplasma.com/en/donor-hub • Follow us on Facebook: https://www.facebook.com/grifolsplasma1940 • Follow us on Instagram: https://www.instagram.com/grifolsplasma_us/?locale=fr • Join our WhatsApp channel: https://www.whatsapp.com/channel/0029VacoAHFHltYELrquem3R more",
  "reviews": [
    {
      "user": "Mickey 7777777",
      "date": "12/27/2023",
      "title": "Best appointment app",
      "review": "I really thought it was going to be a hassle to make appointments or to reschedule and make donating More limited but that is not the case at all you can cancel same day no penalty, reschedule same day if needed , this appointment system might be a bit tricky for the older generation of people that really don’t like to use phones or tablets /computers most of those people can get younger family members to help out , and honestly it seems this system is just to help donors to get the screening done faster and the initial check in faster so that the facility won’t be swamped beyond capacity at higher volume Times ,the app helps people know when to come and not to forget their days by checking online honestly my family was fine with the old way but over all this is a better way of doing it for the majority of people, I mean coming in at 9 am and not knowing if you can get to donate and waiting until 3 pm was no fun I am sure for anyone, this takes all the guess work and added time out of it because sadly while this part-Time job is paid for the time you spend they don’t pay hourly it is a salary based Job so yes this app does really help everyone invest as little of their time as needed to get the job done and back on their way to living their lives !!!! A++++ more"
    },
    {
      "user": "Rob the Donator",
      "date": "02/05/2024",
      "title": "App appointment doesn’t equate to actual donation time",
      "review": "As much as I appreciate the effort & the idea of booking an appointment ahead of time via the app, the issue is that 90% of the time when I booked a donation day & time when I arrive at the site, I’m typically not donating for another 30+ minutes. I think this is due because the site is under staffed; especially for the folks doing the screening process. The app itself seems pretty straightforward and easy to use, but my bigger point is that booking an appointment doesn’t equate to the relative time for the actual donation itself. more"
    },
    {
      "user": "Zmklpgd",
      "date": "08/10/2024",
      "title": "Whats the deal",
      "review": "Was good , the facility and donations, staff here are great. However, since the August update. I have not been able to access my account at all. Can’t make an appointment. Can’t cancel an appointment. Can’t login. System does not recognize me. My local keeps telling to reset my password. Though I have told them on three occasions its not. I have changed my password three times in the last three weeks, including this week. I change the password and I get logged in once. Limited functionality, the i try to log in again and it doesn't recognize me. i don’t know what i’m suppose do. They never answer the phone, like ever! So Thats not a viable option. And i’m sure not going to keep doing what i have been doing doing. Drive down, no appointment till the following day. Drive home, go back the next day. There goes the little compensation we get. I’m sure this week it, will the same. Change you password. Hey how bout this. How bout I find another place to donate. Then i can you should answer your phones once in awhile!! Made an appointment for today via in person. Needed to cancel couldn’t cancel. No app and no answer!! Now i’ll get Email Saying sorry we missed you. Did you know you can download our app to make and cancel appointment. Yeah right!! Just absurd!!!!! more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Apple Vision"
  ],
  "size": "42.2 MB",
  "category": "Medical",
  "ageRating": "4+",
  "languages": "English"
}