{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Pawp: 24/7 Vet & Pet Care 12+",
  "subtitle": "Live vet support by text/video",
  "seller": "Pawp, Inc.",
  "stars": "4.8",
  "rating": "5.8K Ratings",
  "price": "Free",
  "appDescription": "As featured in Forbes, NBC, Money, People, Insider, and Variety, Pawp is a modern vet clinic that puts an expert in your back pocket so you’re never alone when it comes to your pet’s health. Pawp’s pet care membership provides dogs, cats, and their parents unlimited access to a team of veterinary doctors and nurses who are available 24/7 via video and text. Pawp’s care team uses empathy and expertise to provide a personalized care experience for dogs and cats whether they’re sick, healthy, or in-between. Ask a vet anything about your pet’s health, nutrition, and behavior and receive real-time advice you can trust. CONNECT WITH A VET 24/7 & TALK TO SOMEONE YOU CAN TRUST Chat with our expert team of veterinary doctors and nurses from the comfort of your home — or anywhere — day or night. Pawp offers on-demand pet advice meaning there’s no weeks-long wait to get an appointment. Get vet help when your pet needs it, don’t wait for office hours. GET UNLIMITED APPOINTMENTS & FOLLOW UP ON YOUR SCHEDULE You can text or video chat with licensed veterinary professionals as many times as you need to. Ask a vet your everyday pet questions as well as seek advice for urgent and emergency issues. Get a second opinion that isn’t the search engine. Ask follow-up questions when they come to your mind. ASK A VET ANYTHING — WHETHER IT’S URGENT OR YOU NEED A GUT CHECK Pawp’s care team is filled with knowledgeable and understanding pet professionals in areas like health (vomiting, diarrhea, injury, infections) as well as nutrition (weight loss, food choice, allergies), and behavior (new puppy and kitten questions, cat hiding, or dog spraying). GET PERSONALIZED & ACTIONABLE PLANS FOR ONGOING CARE We make sure your pet’s care doesn’t stop when their Pawp visit is over. Our care team will make sure you have the tools you need to give your pet the care they deserve. Each visit results in actionable (and achievable) tasks you can complete to make sure your pet’s ongoing health remains a priority. These can include exercise recommendations, vet-approved resources, and relevant products our experts swear by. HOW PAWP WORKS - Download the Pawp vet app - Become a Pawp member - Talk to a vet whenever you need - Get ongoing support, treatments, and advice - Give your pet the quality pet care they deserve Privacy Policy: https://pawp.com/privacy-policy Terms of Service: https://pawp.com/tos more",
  "reviews": [
    {
      "user": "A.Bids",
      "date": "11/10/2023",
      "title": "This is honestly such a great app\n\n    Developer Response",
      "review": "Honestly I’m so so happy I found out about this app. I was researching pet insurances that will cover preexisting conditions and it basically doesn’t exist. Pawp does!!! They have an emergency fund that will cover a good chunk of the vet bill for my special needs dog if he needs to be hospitalized again. Each hospitalization costs around $5,000 and he’s already had 4. We were stressing about how we could possibly do it again if he needs it but Pawp has come to the rescue. We have our emergency fund if we ever need it! ALSO the 24/7 vet care is amazing. I’ve used it a few times. I had to use it today. Two of my five dogs got into a scuffle and one came out of it with a gash on her head. I sent a picture to a veterinarian in Pawp and they helped me come up with a home treatment plan and saved me tons of money and stress by not having to go to emergency for a tiny little head wound. They gave me peace of mind and a plan of action and I feel confident that everything is going to be okay. Every time I’ve needed help they’ve been there and provided great assistance. I HIGHLY recommend this service. Especially if you’re like me and use all 6 of those slots. My dogs get wild and I’m so glad to have vet care at my hands without spending hundreds to have an in office assessment unless it’s really needed. This app is a game changer and I’m so so so glad we have it. more Thank you for taking the time to leave a review. We appreciate your kind words! If you ever need us, you can reach our Support Team at support@pawp.com, or you can reach our veterinary professionals 24/7 via the Pawp app! more"
    },
    {
      "user": "brookedear623",
      "date": "12/14/2022",
      "title": "Worth it in 1 visit",
      "review": "TLDR: Worry warts: if you’re on the fence, get the app. This app will save your heart from so much worry and give you your peace of mind back!! This app is worth the annual fee in just one care visit—and I felt that way even before having my first one-on-one chat with the doctor. If you’ve ever been up all night with a sick pup who can’t tell you what’s wrong—especially if you don’t have a lot of extra income—you probably know how it feels to be in the anxiety spiral of “is this an emergency or not??” You don’t want to pay the cost of ER if it’s just your own dramatics (my dog can look at me wrong and I’ll get worried he’s sick), you are not interested in an appointment for 2 weeks later at a regular vet (“what if they’re dead by then?!?!! Isn’t there anything tomorrow!!?”) , and the internet doesn’t ease any anxiety. Pawp just eliminated all of those stresses for me. Just the click through question and answer process made me feel better and empowered me with information. I talked to Dr. Ana afterwards just for more clarification and she gave me detailed instructions on how to help and monitor my pup. And the emergency fund buy-in also is incredible peace of mind for us worry warts. I’d rate this higher if I could. Thank you Pawp!!!!!!!!! more"
    },
    {
      "user": "SJen01",
      "date": "04/08/2024",
      "title": "Worth every penny!\n\n    Developer Response",
      "review": "This app has saved me hundreds of dollars! I use it all the time for questions I have that I don’t want to go to the vet and spend $100 per visit or when I have a serious issue with my dog that I need immediate help and not sure what to do! It’s like having a vet live with you 24/7! You get to send them pictures of the issue, and have a licensed vet explain what is happening and what to do next! Their vet is able to tell you what over the counter medication to get or do to help your fur baby & provides exact instructions and recommendations! I feel like I’ve been given even better advice and personalized care than most vets I’ve been to. You get to track your past visits and history within the app. You can have multiple dogs/cats for the same price which is amazing! I’m on my second year, I renewed my subscription when I saw how much I used it the first year & did not want to be without this!! The vets have all been so friendly & helpful! I promise, this is the easiest and fastest way to get help for your fur babies!! Don’t be caught off guard in a bad situation and wish you had access to help! This is 24/7 emergency help at your fingertips!! Worth every penny!!! more Thank you for taking the time to leave a review. We appreciate your kind words! If you ever need us, you can reach our Support Team at support@pawp.com, or you can reach our veterinary professionals 24/7 via the Pawp app! more"
    }
  ],
  "compatibility": [
    "iPhone"
  ],
  "size": "159.4 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English"
}