{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Oticon Companion 4+",
  "subtitle": "Hearing aid remote control",
  "seller": "Oticon A/S",
  "stars": "2.3",
  "rating": "932 Ratings",
  "price": "Free",
  "appDescription": "Control your hearing aids discreetly with the touch of a finger This app lets you control your hearing aids from your mobile device. It comes with an app for Apple Watch helping you discreetly change programs and adjust volume (when within Bluetooth range). Just a note: some features may be available depending on your hearing aid model. Check below for details. • Adjust the sound volume for each hearing aid together or separately • Mute surroundings for better focus • Switch between programs set by your hearing care professional • Check battery levels • Use SpeechBooster to reduce background noise and enhance speech (available for all hearing aid models except Oticon Opn™) • Stream calls, music, and podcasts directly to your hearing aids (availability may vary depending on your phone model) • Find your hearing aids if lost (requires location services to always be turned on) • Access app support and troubleshooting solutions • Meet your hearing care professional for an online visit (by appointment) • Adjust streaming sounds with streaming equalizer (available for all hearing aid models except Oticon Opn™ and Oticon Siya) • Adjust sounds around you with sound equalizer (available for Oticon Intent™ and Oticon Real™ models) • Track your progress with HearingFitness™ feature (available for Oticon Intent™ and Oticon Real™ models) • Handle wireless accessories paired with your hearing aids such as TV Adapters, Oticon EduMic or ConnectClip First use: You need to pair your hearing aids with this app to use it to control your hearing aids. App availability: The app is compatible with most hearing aid models. If you have hearing aids from 2016-2018 and haven't updated them yet, a hearing aid update is required for this app to work. We recommend regular hearing aid updates during your routine check-up with your hearing care professional. To check the latest list of compatible devices, please visit: https://www.oticon.com/support/compatibility more",
  "reviews": [
    {
      "user": "horsepasture",
      "date": "08/20/2024",
      "title": "new app\n\n    Developer Response",
      "review": "I also agree that the new Oticon app is not nearly as good as the previous one. With the last one I could actually find my hearing aids and now it just gives me a general vicinity and sometimes it doesn’t say that it has connected to it at all, why can’t something be added to Oticon that would play a loud sound like a Tile does so that you could find your hearing aids. With technology as it is, it should be improving instead of going backwards I am having the same problems as the previous person spoke about, my hearing aids are connecting to random things like sometimes my TV sometimes my phone sometimes my iPad and it’s hard to just it’s going in between devices without asking me. Gotten to the point that I just had to turn off the Bluetooth on all my devices I really wish Oticon would work on this problem as I would like to continue to use this brand of hearing aids. Ashby more Dear horsepasture, we are sorry to hear about the inconvenience. The new app Oticon Companion was released to keep up with the technical requirements from Google and Apple and make sure that our app stays compatible with new Android and iOS phone operating system. Oticon Companion will be receiving new features and updates and we strive to make it as user friendly and stable as possible in future app updates. If you are experiencing connectivity issues with the new app, please check if you still have the old app on your phone, as it might be interfering with Oticon Companion's connectivity. As you mentioned the presence of multiple iOS devices, please refer to the most up to date instructions from Apple on how to manage the connection of Hearing aids with Apple devices and select an Apple device audio output: https://support.apple.com/en-us/HT201466 The following will be especially helpful in handling multiple iOS devices with the same Apple ID connected to one pair of hearing aids: https://support.apple.com/en-us/HT202809. If that does not help to successfully pair the second Apple device, do not hesitate to reach out to appsupport@oticon.com mentioning your review and the dedicated team will be glad to help you. Kind Regards, Oticon more"
    },
    {
      "user": "Winter woollies",
      "date": "05/02/2024",
      "title": "TERRIBLE APP\n\n    Developer Response",
      "review": "Oticon Companion is a TERRIBLE APP. I loved having Oticon On; it was wonderful. Things stayed connected. Never had any issues launching the app or communicating between my Apple Watch and my iPhone and the hearing aids. Was forced to changed to Oticon Companion by the manufacturer. It has sucked ever since. My hearing aids will randomly stop being paired for no apparent reason. The app loads slowly, it takes for every to re-pair. Sometimes the watch won't change the HA settings when I ask it to. I rely on these hearing aids to be able to function in my everyday environment. It got so bad, that a month ago, I actually had my audiologist send my hearing aids in one at time to the manufacturer for repair because it was disconnecting so frequently, I assumed it was a mechanical failure of the HAs themselves. Oticon couldn't find anything wrong, so they ended up replacing both hearing aids (thankfully, it was on their dime- they were ONLY a year old!!) They're disconnecting less frequently now, but they're still disconnecting. And it's FRUSTRATING. Based on this, I can only assume that it's an app issue and, when it comes time to get new hearing aids, I will be looking at other products where the technology integration is more SEAMLESS and BETTER SUPPORTED. VERY DISAPPOINTED. more Hi, thank you for your feedback. I am very sorry to hear that you are having these in-app disconnections. We will be happy to do all we can to help get you a stable connection. Please write us at appsupport@oticon.com and we will be happy to do all we can to troubleshoot this so that you can have a stable connection between your hearing aids and iPhone. A common cause for in-app disconnections can be if the hearing aids are connected to another device, such as an iPad. If this is the case, the way to transfer the connection between devices running iOS 17 is to change the audio input by tapping the airplay symbol in the top right part of the control center (opened by swiping down from the top right corner of your device) and choosing your hearing aids. For devices running iOS 16 or older you can transfer the in-app connection by starting to play any sound from the device you want to use with your hearing aids. Alternatively, it can be necessary in some cases to toggle Bluetooth OFF on the iOS device not used with the hearing aids. Best regards, Oticon more"
    },
    {
      "user": "Head minion",
      "date": "04/09/2024",
      "title": "Community comments\n\n    Developer Response",
      "review": "SO glad to find these comments. I truly thought I was losing my mind. My Previous hearing aids were less than $1000 Resound hearing aids that were very reliable and easily accessible Simple pairing with the iPhone : Take them from the substantial closed charger. Put them in my ears and turn on the phone! These $6,000 Oticons have no relationship, consistent pairing nor clear guidance for operation. The Resound User interface was graphic and animated. These Oticon aids and charger are unwieldy and frequently just turn off after wearing for an hour or two. I’ve had them for 2or3 months, with a lot of visits to the office. The performance is deteriorating and every visit cost (even if my dog HAD NOT eaten them and caused them to require replacement ) I then paid TWO HUNDRED DOLLARS for a heavier charger that closed so that it could sit on my nightstand and not exposed, inviting the puppy to take the devices, being far more interesting than her many objects DESIGNED and abundantly available for chewing. I was originally going to get Resound devices. If I can return these Oticons more Dear user, we would like to investigate in the root cause for the connectivity issues that you are experiencing. Do not hesitate to reach out to the Global App Support team at appsupport@oticon.com. Kind Regards, Oticon more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Apple Watch"
  ],
  "size": "155.5 MB",
  "category": "Medical",
  "ageRating": "4+",
  "languages": "English, Bulgarian, Croatian, Czech, Danish, Dutch, Estonian, Finnish, French, German, Greek, Hungarian, Icelandic, Italian, Japanese, Korean, Latvian, Lithuanian, Norwegian Bokmål, Polish, Portuguese, Romanian, Russian, Simplified Chinese, Slovak, Slovenian, Spanish, Swedish, Traditional Chinese, Turkish, Ukrainian"
}