{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Everlywell 17+",
  "subtitle": "Telehealth, tests, & treatment",
  "seller": "Everly Health, Inc.",
  "stars": "4.9",
  "rating": "7.6K Ratings",
  "price": "Free",
  "appDescription": "Put convenient healthcare in your hands—and in your phone—with the free Everlywell App. At Everlywell, we believe taking action on your health and wellness should be affordable, easy, and keep you feeling good. The free Everlywell App provides a seamless, secure, and simple at-home health care experience— wherever you are. TELEHEALTH WHEN (AND WHERE) YOU NEED IT Sick and tired of being sick and tired? We got you. Get care for your concerns from the comfort of home with our new telehealth offering (cash pay and insurance payment options available). Join appointments, view care plans, and more right from the Everlywell App. Support includes: • View upcoming and completed appointments • Schedule and join appointments • View care plans • Get push notifications about appointments and care plans MORE COLLECTION SUPPORT FOR YOUR EVERLYWELL TESTS We know that collecting your own sample may be a new (and exciting!) experience, but with our network of partner labs processing nearly 900,000 blood collection cards in a given year, the Everlywell App can provide you with our collection expertise along the way. Support includes: • Collection tips with the best times of day to collect your sample • Reminders unique to your test, so you never miss a step or collection window • The use of Everlywell’s Spotwell Technology: For certain tests, you can use the scanner on your phone’s camera to provide you with instant feedback on your blood spot card to guarantee accurate collection • Access to our Customer Care team to have your questions answered With convenient telehealth, a suite of vitamins and supplements, and over 30+ at-home lab tests with physician-reviewed results, your healthier tomorrow can start today. You’ve got this! TELEHEALTH Women's Health Men's Health General Wellness Weight Management STI & STD UTI Thyroid Cold & Flu COVID-19 TESTS NUTRITIONAL AND DIGESTIVE HEALTH Food Allergy Test Food Sensitivity Test Food Sensitivity Comprehensive Test Celiac Disease Screening Test Metabolism Test Vitamin D & Inflammation Test Vitamin D Test WOMEN’S HEALTH Women’s Health Test Perimenopause Test Postmenopause Test Ovarian Reserve Test Women’s Fertility Test Female HPV Test MEN’S HEALTH Testosterone Test Men’s Health Test SEXUAL HEALTH STD Test for both Men and Women Chlamydia & Gonorrhea Test Syphilis Test Trichomoniasis Test HIV Test GENERAL WELLNESS Thyroid Test Sleep & Stress Test Indoor & Outdoor Allergy Test Cholesterol & Lipids Test HbA1c Test Heart Health Test FIT Colon Cancer Screening Test Sleep & Stress Test Heavy Metals Test Lyme Disease Test Hepatitis C Test B Vitamins Test At-home COVID Tests VITAMIN ESSENTIALS Vitamin D3 Supplements Omega-3 Fish Oil Supplements Vitamin B12 Supplements Vitamin B6 Supplements STAY CONNECTED Website: everlywell.com Instagram and TikTok: @everlywell \"...an amazing tool to learn a bit more about your insides\" - Marie Claire \"Everlywell is your one stop shop for all your at home testing needs\" - Rolling Stone Disclaimers: Everlywell offers health and wellness solutions including laboratory testing for wellness monitoring, informational and educational use. With the exception of certain diagnostic test panels, the tests we offer access to are not intended to diagnose or treat disease. None of our tests are intended to be a substitute for seeking professional medical advice, help, diagnosis, or treatment. For regulatory reasons, our tests are not available in NY with the exception of COVID-19. Everlywell does not provide professional medical advice. Rather, the Everlywell platform can be used to connect with an independent healthcare provider who can assess your condition. All prescription medications require a consultation with an independent healthcare provider. Prescriptions can be filled by a pharmacy of your choice. Additional terms and conditions apply. more",
  "reviews": [
    {
      "user": "Everlywell Thyroid Test",
      "date": "04/14/2023",
      "title": "Everly well Thyroid Test like MAGIC!\n\n    Developer Response",
      "review": "I’m a busy mom, lots of little ones and too much on my plate. I’ve put off getting my thyroid levels checked for way too long and Im very thankful my medical provider due to a construction issue with their normal on-site lab facilities recommended using the at-home test kit instead of going to a traditional lab location across town. I’ll never have an excuse to delay getting testing done! Kit was so well put together and simple! It came complete with all needed supplies and thanks to the super easy to use video-instructions,with their helpful App even my nine year old was able to walk me through the steps and she loved being able to help! The coolest part was the “check my sample” step which used a photo to check that my sample was done correctly which eliminated all stress. I was very thankful for that step to make sure that it’s done correctly. Coolest test ever! Thank you Everlywell- I will definitely be utilizing more of your other test kits and will be telling friends and family to find your kits too! Thank you for making the obstacle of lab testing super accessible, affordable (same price as a traditional lab copay for me) and such a streamlined process! Loved it! more Thank you so much for the lovely review! 💚 Would you be open to sharing more about your story? If so, please email us at stories@everlywell.com. We'd love to hear from you! more"
    },
    {
      "user": "Amanda Future RN",
      "date": "10/17/2022",
      "title": "Very impressed!\n\n    Developer Response",
      "review": "This was by far the smoothest process, thank you so much! Loving this modern, tech savvy method and it’s beautiful design. This is a perfect way to avoid having to wait and wait and wait for an appointment to see a local doctor. This put the control in the clients hands and was so comfortable to do at home ♥️ If Everlywell is looking for a Travel RN BSN please email me as I would love to partner and help grow this company! more Thanks so much for the feedback! You can find our current job openings at https://www.everlyhealth.com/careers/ more"
    },
    {
      "user": "BeachBound13",
      "date": "11/26/2023",
      "title": "Worthless\n\n    Developer Response",
      "review": "This app functions well, but too bad it is for a worthless product. It does not provide numbers, just a positive (or negative) response. The “support” they offer is a call center rep telling you that the results are positive and go to the doctor. I didn’t ask for a definitive diagnosis, but selling this as offering support is deceptive marketing, if not outright lying. You can talk to a “provider” but it is just a mid-level who cannot diagnose. I can read “positive” and “talk to a doctor” without a call center rep or paying a midlevel to read it to me. What is the point of a test not providing numbers and ranges?! Are they just randomly throwing out positives and negatives in results?! Further, my doctor (actual DO who uses a reputable lab) repeated the testing and my results were NOT positive, not even close to positive. In fact, not only was I NOT positive on the one thing they said I was, I WAS positive on the thing they said I was not! Total joke and waste of money. Very deceptive marketing. Other reputable labs will do many of these same tests for cash pay and actually provide numbers and resources to understand numbers. What a joke. more Hi! We take this feedback seriously, and would love to dig into this further. Please reach out to our team directly at contact@everlywell.com. Thanks! more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch",
    "Apple Vision"
  ],
  "size": "50.4 MB",
  "category": "Health & Fitness",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information\n                Infrequent/Mild Alcohol, Tobacco, or Drug Use or References\n                Unrestricted Web Access",
  "languages": "English"
}