{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Hers: Women’s Healthcare 12+",
  "subtitle": "Hair care, mental health",
  "seller": "Hims & Hers",
  "stars": "4.6",
  "rating": "4.7K Ratings",
  "price": "Free",
  "appDescription": "Hers: Your one-stop for women’s healthcare and self-care telemedicine. Get access to best-in-class treatments and support for: Hair Growth: Say hello to thicker, fuller hair with proven prescription ingredients for hair growth, custom treatments prescribed by licensed healthcare providers, and top-of-the-line hair care products. Mental Health: Get the mental health support you need for anxiety relief, stress relief, and dealing with depression through 100% online telemedicine consultations and medication management. Weight Loss: Prescription weight loss that puts you first. A weight loss plan through Hers is personalized to fit your lifestyle, eating pattern, health history, and goals to help you lose weight and feel like yourself. Skincare: For stubborn acne, minimizing fine lines and wrinkles, or just upgrading your skincare regimen. With the app you can enjoy the benefits of telemedicine from anywhere. Get questions answered quickly (responses typically within 24 hours), manage your medications, access exclusive health and wellness content, and more. Feel great through the power of better health, with Hers. Please note: Content in the Hers app is for informational purposes only and does not constitute medical advice. Consult with a healthcare provider for any questions about your treatment, medical condition, or need for medical advice. more",
  "reviews": [
    {
      "user": "Cheybug93",
      "date": "12/09/2023",
      "title": "It works great for me but….\n\n    Developer Response",
      "review": "If you’re already familiar with the drug they’re prescribing then this service is great. I moved away from my hometown and my psychiatrist couldn’t prescribe my meds if I lived in a different state than where she is licensed. So it was very convenient for me to hop on HERS and get a prescription very quickly without all the bells and whistles as when I went the traditional route, it took almost 2 months for my doctor to diagnose me and write a prescription. With that being said, after 2 months, I was very informed about the drug I was being prescribed and was confident that it would work because my doctor took the time to get to know me and listen to what I needed. So I’m not sure how this App can just issue psychiatric medication to ppl who’ve never been assessed by a professional in depth and may have no experience with these types of drugs. In a nutshell, it was great for me because I know what I’m getting into and pretty much just needed a refill but to someone who’s completely new to medication, it runs the risk of being a little sketchy. more Hey, We appreciate you sharing your experience and providing us with feedback! Your input is greatly valued here at Hims & Hers. We are always here to help if you need us. The Hims & Hers Team more"
    },
    {
      "user": "monkeydluffy1113",
      "date": "07/02/2024",
      "title": "Great Concept but not for people who are struggling financially with a family to take care of\n\n    Developer Response",
      "review": "After inputting all the needed information to receive help for hair loss, I was directed to a page where I had to input my credit card information. While I expected their services to be a paying service I thought they would have the opportunity for people to receive services through their health insurance. This wasn’t an option so I had to decline the service in general. Not everyone can afford $35 - $175 a month. I guess I had this assumption because I was a proud customer of online birth control for years and I received those services with my health insurance and NOT with monthly payments on a credit card or Apple Pay account. By not having an option for people to pay with health care insurance it excludes many people who need help health wise yet can’t obtain it due to their finances. It’s an endless cycle where only the “well off” can afford decent health care services (medicine, counseling, therapy, etc.) Thank you for reading. I will recommend this service to others because I can recognize the amazing potential within it but people should know ahead of time that Hers/Hims do not accept health insurance. more We appreciate you sharing your experience and providing us with feedback! Your input is greatly valued here at Hims & Hers, and we're always here for you whenever you may need us. more"
    },
    {
      "user": "steffffaaaanieee",
      "date": "09/21/2024",
      "title": "Predatory. Disappointed.",
      "review": "**DO NOT USE THIS APP IF YOU HAVE AN EATING DISORDER.** I’ve been using Hers for a year or so for Anxiety meds at first, and then Birth Control. I agree with every single review about only using this app if you already are prescribed the medication and are looking for an easy refill option or a cheaper alternative. About a month ago or so, they started pushing notifications, pop ups, recommendations etc for GLP-1 injections. Not only does this seem very odd, since injections don’t really seem like a “just for anyone” type of solution, but on a personal note, in both of my provider questionnaires I filled out, I was very transparent about my ongoing struggles with an eating disorder. At this point, to be pushed Ozempic, is SO inconsiderate and dangerous for those that aren’t doing well in their own recovery journeys. Not only should Ozempic quit being pushed for weight loss, but to blindly push this towards a client base that overwhelmingly struggles with many kinds of disorders comes off as incredibly predatory. To have the kind of money this business has, and not be able to turn off or hide “weight loss drugs” from their clients seems like a massive oversight. If they care AT ALL about the people they’re providing care towards, they will remove these annoying notifications and DO BETTER in actually taking care of people. Gross. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch"
  ],
  "size": "87.4 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English"
}