{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "OnSkin - AI Product Scanner 4+",
  "subtitle": "Cosmetic Ingredient Checker",
  "seller": "AIBY",
  "stars": "4.7",
  "rating": "18.2K Ratings",
  "price": "Free",
  "appDescription": "OnSkin is your trusted navigator through cosmetic shelves and skincare ingredient lists. Are you sure that the \"miracle\" cream you slather on your body every day is safe for your skin? Do you really know what ingredients your favorite foundation contains? The OnSkin app will set your mind at ease by telling you precisely what you’re putting on your skin and whether it's safe for you. COSMETIC SAFETY SCANNER With OnSkin, you have a seasoned digital cosmetologist by your side. Choose from three ways to get a product’s safety profile—take a photo of it, scan its barcode, or look up its name on the app. OnSkin will see past the glitz and glamor and decipher the Latin names on the label in a clear way, flagging any potentially harmful components. Plus, the app recommends cleaner alternatives to help you look and feel healthier inside and out. SCIENCE IS OUR INFLUENCER The OnSkin product ratings are 100% unbiased—we don’t partner with any brands. Our in-house team of biologists and physicians have used the latest scientific research on toxicology and dermatology to assess over 15,000 cosmetic ingredients. Using an AI calculating algorithm and human curation, we rate products promptly while preserving the quality of manual analysis. PERSONALIZED SKINCARE TIPS Just complete a short survey about your skin to get essential care steps and active ingredients to look for when hunting for new products, all tuned to your unique skin and curated by our skin experts. These may be a great kickoff for starting a substantial skincare routine or double-checking your existing one. SKIN MATCH Finding suitable products for your skin (especially if it’s acne-prone and sensitive) can be quite a puzzle, but with OnSkin, you’ll always know if a product is a perfect match, a potential match, or not a match for you. Based on the info you input about your skin type and skincare goals, we check how well a product is tailored to your skin needs, so you can invest in effective formulas without having to experiment with your face. PRODUCT REVIEWS Viral products seem tempting to give a shot, but how do you check whether it's all just hype before you rush to Sephora? Every week, you’ll see compilations of the top 10 most buzzy products from various categories, from washes to serums. For each, you’ll learn about the powerful and questionable ingredients and their effects, all explained in simple terms. Plus, our skin experts will weigh in on whether it's good value for money! You get to see the real face of raved-about skincare and pick items based on their effects, not just their popularity. POPULAR SCANS See what products are trending on the app and discover new faves! GUESS THE SCORE Test your cosmetic intuition with this quick, fun daily game. Is a product’s safety score above or below 50? Pick it right and get a chance to win Premium and scan products without limits! AI SKIN HELPER Need specific advice on your skin type or want to learn more about that latest beauty trend? Type in your own query or choose from the most popular ones and get a professional consultation from the AI Skin Helper in a matter of seconds. HAIR LAB With Hair Lab, you quickly get a cosmetologist-approved analysis of any hair product and see if its components are likely to suit your hair needs. Use Hair Lab to build your locks’ dream routine and enjoy having a good hair day every day! ON-DEMAND ANALYSIS OF BEAUTY PRODUCTS If you want to check a product that's not yet on OnSkin, add it to our database—you'll see its safety score in just a few hours. PREMIUM SUBSCRIPTION • You can subscribe to get unlimited access to certain app features. • Subscriptions are billed automatically at the rate depending on the selected subscription plan. By using the app, you are agreeing to our Privacy Policy and Terms https://aiby.mobi/cosmetic/terms https://aiby.mobi/cosmetic/privacy more",
  "reviews": [
    {
      "user": "CAITLIN-smith",
      "date": "07/27/2024",
      "title": "Overall okay",
      "review": "Hi guys, I downloaded this app wanting to know what all my skincare and makeup have in it. It is overall a good app but I do have some suggestions. First, I wish it was free. I scanned like 10 things then it said I have to pay, I don’t know about y'all, but I was really looking forward to finally finding a free beauty scanning app. I was so tired of looking it up on google and not finding anything so I downloaded this. I only rated it 5 stars so everyone can see this. I would have rated it three. Like I was saying, it is a great app but I had to delete it because I didn’t really want to pay to keep my skin safe. I have really bad acne and loved the quizzes and stuff to find out what helps me but I hate that I have to pay to do it. I overall love this app and would download it again if it was like 100% free. This was probably the best one I have tried but again, IS NOT FREE! Wish I could actually find one that is free or if this one was free I would love it more than I already do, I hope On Skin reads this comment and if you do On Skin please please please comment on it. That you for your time everyone. more"
    },
    {
      "user": "jdavis222",
      "date": "05/18/2024",
      "title": "Best app I ever downloaded, BUT..",
      "review": "I love this app. I downloaded it randomly for… SOME reason idk- but it actually helped me out a lot. I’ve tested this on my very tiny skincare collection (if you can even call it that?) which consists of a moisturizer and a really good face wash, and it told me multiple good things and 1-2 bad things. I ended up doing some research on these ingredients, and most of it happened to be true. But then I deleted it because I didn’t need it anymore… Until I met a really good hair care friend who used a similar looking app. Then I thought to write this review. (Ah yes, my ADHD brain…) And I read a review or two, but there were multiple I didn’t read except the first couple sentences. 2/3 of them said that it gave them different answers each time they scanned and told them their products (which they described as amazing) were making their skin dry. So now I am questioning… Anyways, this really helped me, but I have a feeling that since everyone’s skin type is different, everyone’s skin reacted different to it, making the app ‘untrustworthy’. So, in conclusion, this app is fine, but because it doesn’t review your skin in person (or even a simple questionnaire), it’s not as accurate as a real dermatologist. more"
    },
    {
      "user": "Makayla Bobala",
      "date": "02/17/2024",
      "title": "super helpful :)",
      "review": "It’s a nice explanation of products, and i love the skin analysis. even if a product is 49% or lower in safety, it offers a complete definition of each questionable product. Also it can still be a good match for your skin type regardless. I feel like a lot of the negative reviews don’t understand that part. For example- The cetaphil healthy radiance serum is a 49% safety but a good match for my skin. i use this product often and i love it, but reading the ingredient definitions just made me aware of any risks. I haven’t had issues with the serum- but that doesn’t mean it won’t harm someone else’s skin. I imagine this helps with finding out what ingredients someone is more sensitive/ allergic to. Also, there is a free version! i have used plenty of scans with no bumps in the road so far. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "Apple Vision"
  ],
  "size": "70.5 MB",
  "category": "Health & Fitness",
  "ageRating": "4+",
  "languages": "English, Portuguese, Spanish"
}