{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "My Highmark App 12+",
  "subtitle": "Manage your health & benefits",
  "seller": "Highmark Inc",
  "stars": "3.7",
  "rating": "1K Ratings",
  "price": "Free",
  "appDescription": "Easily manage your health - and health coverage. All in My Highmark. Simplify your benefits Easily check your health plan benefits and see what’s covered, all in one place. Get expert care when you need it Whenever you need support, find all your virtual care programs and services together in one place. Personalize your app experience Build your Health Profile to get curated recommendations for the goals that matter most to you. Get new recommendations every day Check your Journey daily to see a new mix of activities, content, and support personalized just for you. Connect Devices Hook up Apple Health and your connected wearables so that you can automatically track your progress, sync health info, and get extra motivation to hit your goals. The App is intended for Highmark’s Blue Shield members in 21 counties in central Pennsylvania and 13 counties in northeastern New York, and Highmark’s Blue Cross Blue Shield members in 29 counties of western Pennsylvania, 13 counties of northeastern Pennsylvania, the state of Delaware, the state of West Virginia plus Washington County, Ohio and 8 counties in western New York. All references to “Highmark” are references to Highmark Inc., and/or to one or more of its affiliated Blue companies, which are independent licensees of the Blue Cross Blue Shield Association. more",
  "reviews": [
    {
      "user": "Fvddrgj",
      "date": "07/23/2024",
      "title": "Flawed\n\n    Developer Response",
      "review": "The app and customer service is flawed. The written responses in the app are so poorly written that I hope it’s AI. Using the app for the support function is basically pointless and a major time waster. Customer service is lacking. I could hear kids in the background during the entire call, which made it hard to hear. Along with that, the call was of little help. I was able to figure out the information I needed on my own later on. The app is functional, but there is room for improvement. more We are truly sorry you are not having a positive experience using our app. Any additional information would be greatly appreciated. Please contact our customer service team at the number on the back of your ID card should you wish to provide additional details. Thank you. more"
    },
    {
      "user": "uber unhappy customer",
      "date": "12/04/2023",
      "title": "Codes make no sense to actual humans\n\n    Developer Response",
      "review": "This app effectively shows me gibberish, with ‘explanations’ that simply repeat the gibberish. Worthless app; leaves my uninformed after wasting my time to sign up, get in, and peruse the available text. This simply reflects related worthless paper invoices. Bad info is bad info - whether you make it available digitally or hard copy. When billing a patient, the descriptions should be written in a way a non-medical human (e.g., the people you are demanding payment from) can recognize what medical service they need to pay for, so they can agree with confidence that they did receive that service and so are ok paying for it. My invoices are effectively gibberish. And when a patient - me - is confronted with literally dozens of documents from multiple providers for one single health event and being asked to pay thousands of dollars cumulatively across them, it should be unacceptable to all billers that I can’t understand what I’m being asked to pay for. I’d rate this a zero if I could. I came here hoping for help to understand the vast wad of medical invoices I have on my desk and it completely wasted my time. Plus I can’t pay here - would make much more sense to show an understandable invoice with a button giving me the immediate opportunity to pay it. more We are so sorry you have had such a difficult time and truly appreciate you writing us a review. We are actively working to improve the EOB and claims experience. I know how overwhelming this can be and we would love to assist. Please call the number on the back of your member ID card and one of our member service representatives will be able to look into this further for you. more"
    },
    {
      "user": "ALS789156",
      "date": "08/02/2024",
      "title": "This newest app is very frustrating\n\n    Developer Response",
      "review": "I really liked the app before the change to this newest version. It constantly says my biometrics have expired and logging back in every time has shown to be a big pain. I don’t understand why this is happening and keep thinking it’s just a flaw in the system that will be fixed soon but it’s been going on for literally months now. Even when I do get logged in, It’s difficult for me to see the amount my family has paid toward our family deductible and switching from one screen to another, for example requesting a new card because my son lost his is also not an easy task. I consider myself pretty tech savvy so I feel very sorry for anyone that normally struggles with apps and navigating sites on the web. more We are sorry for the issues you have faced and are working to update the ease of usability within the app. Our biometric data expires after 90 days currently in an effort to ensure your data stays secure. If you are experiencing issues where your biometric data has expired in less than 90 days please contact our customer service team at the number on the back of your ID card. Thank you. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch",
    "Apple Vision"
  ],
  "size": "194.1 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English"
}