{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "MyMercy+ 12+",
  "subtitle": "",
  "seller": "Mercy Health",
  "stars": "2.7",
  "rating": "54 Ratings",
  "price": "Free",
  "appDescription": "Manage all your health care with one app. Upgraded features make it easier to schedule visits, search health info and connect your entire family’s care. • Find doctors, schedule or reschedule appointments • Review visit summaries, test results, medications and more • Securely communicate with your care team • Review and pay bills • Complete digital and virtual care visits, all from your phone • Manage your family’s health care from one place more",
  "reviews": [
    {
      "user": "kh883",
      "date": "10/15/2024",
      "title": "I don’t see the difference",
      "review": "I don’t get the point of the new app. It’s basically the same as the old one and it keeps crashing. Why is mercy so obsessed with changing everything."
    },
    {
      "user": "Anonymous Mark",
      "date": "10/10/2024",
      "title": "Adds Nothing But More Marketing",
      "review": "After several years MyMercy perfected itself so it was beneficial to the patient. However, the new + version adds nothing but ways for Mercy to promote itself. More irritating to me is I can no longer use my Windows desktop to review test results, etc; in a full page readily formatable and printable format. We appreciate mobile aps as much as the next guy but there is still no substitute for a desktop computer. Please add a Windows/MAC version so your vision impaired patients are not tied to a handheld device. more"
    },
    {
      "user": "T6739h",
      "date": "10/16/2024",
      "title": "Why login so many times?",
      "review": "Every time I click on something, it takes me to the web screen and I have to put my password in. For every single thing I click on in the app. Results - enter password again. Messages - enter password again. Medication - enter password again. It’s easier to login to the website. At least I stay logged in and can access everything without logging in 10 times! more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch",
    "Apple Vision"
  ],
  "size": "184.6 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English, Spanish"
}