{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "epocrates 12+",
  "subtitle": "Drug/Disease Clinical Support",
  "seller": "Epocrates",
  "stars": "4.5",
  "rating": "6.7K Ratings",
  "price": "Free",
  "appDescription": "Save time in the prescribing moment • Rx and OTC monographs: pharmacology, prescribing and safety information, adult and pediatric dosing, adverse reactions, contraindications, black box warnings, pregnancy and lactation considerations, and more • Drug interaction checker: prevent harmful interactions between up to 30 brand, generic, OTC, or alternative drugs at a time • Pill identifier: drug guide organized by shape, color, imprint code, etc. • 600+ dosing calculators, medical equations, and tools • Formularies: drug coverage information for 6,600+ U.S. insurance plans, by state • Customizable home screen with drag-and-drop simplicity Additional features in Epocrates Plus, now just $16.99/month! • Alternative medicine monographs: dosage, interactions, etc. • Peer-reviewed disease content from the BMJ • Labs, ICD-10 codes, and more medical content Since 1998, Epocrates has helped more than one million clinicians prescribe with confidence, save time, and stay focused on the patient. Rated the #1 medical app 10 years in a row by Decision Resource Group’s “Taking the Pulse.” Payment will be charged to iTunes Account at confirmation of purchase. Account will be charged for renewal within 24-hours prior to the end of the current period. Subscriptions will automatically renew unless canceled within 24-hours before the end of the current period. Manage your subscriptions in Account Settings after purchase. Introductory pricing or discounts, if available, will only apply for the initial introductory period of the subscription. For more information, see our Terms of Service https://www.epocrates.com/termsOfUse.do and Privacy Policy http://www.epocrates.com/privacy. more",
  "reviews": [
    {
      "user": "Mrsboze",
      "date": "06/22/2018",
      "title": "Love Epocrates App",
      "review": "Epocrates is my go to App because it is clear and concise and to the point and I can find what I need quickly. I also have another App that is very thorough and shows you studies etc... but personally when I’m taking care of patients I don’t have time to read a study- I need clear, simple and quick answers and that is what Epocrates offers. I’ve used it since NP school and haven’t found anything else that I like better. I’ve worked in the primary care/urgent care setting. The only thing that I would want that Epocrates doesn’t offer (I don’t believe) is A little more info on IV drugs for instance “this should be a slow push over 2 minutes”... obviously we don’t do that in an outpatient setting but when I worked in the hospital those extra tips would have been helpful- I would feel like Epocrates truly had it all of they added that! more"
    },
    {
      "user": "pilldox",
      "date": "03/12/2021",
      "title": "Totally useless to professionals!\n\n    Developer Response",
      "review": "I try to refrain from leaving negative reviews but this is the second time I've been left \"stuck\" without an answer to a question relying on Epocrates' mobile app. I am a paying customer and I feel that the same quality that goes into your online version should be integrated into your useless mobile app. As a pharmacist I sometimes have questions about dosage forms, medication strengths, formulation types, etc etc. Case in point, today I needed to quickly determine which form of olopatidine is designed for once daily dosing v. twice daily dosing. Simple stuff. I type in Pataday. The mobile app shows \"Pataday\". I click on it just to be fed to a blank page that says \"now OTC\"!? Great, where's the other information. So I search generic name where it has so truncated the information that you can't really use it as needed. For example, it lists generic name then both strengths of olopatidine but doesn't differentiate which correlates to the brand, and in this case, drug strength you're looking for. It may sound trivial but this happens often using their mobile site. And don't get me started on finding pK info and any meaningful pregnancy and lactation information on the web app. I really think that for paying users you should create a web version of the online Epocrates platform. I found that very useful in pharmacy school, on rotations, etc. I need that as a mobile friendly version! more Thank you for your feedback! We're very sorry for the trouble you've experienced! We aim to provide the very best user experience possible and have been working diligently to improve services. We hope you will consider checking our latest updates and will email support@epocrates.com if you continue to experience any issues! more"
    },
    {
      "user": "Flight \"Surgeon\"",
      "date": "01/28/2024",
      "title": "Indispensable…but the “News” is not.",
      "review": "I love this app. Love love love it. The Highlights and Basics, Tests, DDx, and Tx tabs under the Quick Reference sections of specific diseases—along with a pharmaceutical dictionary—are indispensable. I truly feel this app makes daily clinical practice easier, smoother, and safer for patients and providers. The ONLY gripe I have about this app is that the News pops up throughout the day, prompting me to click on Headlines before I search for what I need to know, and this is on the PAID version. You are supposed to be able to search for what you need to know from this obligatory News screen. And that would be fine. If it worked. But 9/10 it doesn’t, you can’t, and the app crashes/stalls. I’ve emailed twice about this through the app and received personalized replies, but I could tell they were meaningless…and the issue still hasn’t been resolved. The app is otherwise perfect and if it were a matter of resolving this “issue”/improving the functionality of the app or risk losing the functionality currently available, I would not risk it. That’s how much I value this app. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "Apple Vision"
  ],
  "size": "197.1 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information\n                Infrequent/Mild Mature/Suggestive Themes",
  "languages": "English"
}