{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Pregnancy & Baby Tracker - WTE 12+",
  "subtitle": "Track Due Date & Growth Guide",
  "seller": "Everyday Health, Inc.",
  "stars": "4.9",
  "rating": "340.5K Ratings",
  "price": "Free",
  "appDescription": "Start tracking your baby's growth today with the pregnancy and baby app chosen by more than 15 million parents. What to Expect, the world’s best-known, most trusted pregnancy and parenting brand, offers an all-in-one pregnancy and baby tracker app with thousands of medically accurate articles to help you navigate pregnancy and parenthood. Find guides for each step of your journey, from starting a family and pregnancy through the baby and toddler years. During Pregnancy * Due Date Calculator that reveals your due date based on last period, IVF transfer, conception, and ultrasound plus offers fun facts about your baby * Week-by-week pregnancy tracker with info about baby development and pregnancy symptoms * Themed baby size comparisons and visual countdown for each week of pregnancy * Helpful daily tips tailored to where you are in your pregnancy * Keep track of symptoms, pregnancy weight, kick counts and memories with our My Journal tool * Expert-reviewed articles on mom’s pregnancy symptoms and health * Videos showing baby development in utero during each week of pregnancy * Registry Builder to help you with your baby registry throughout your pregnancy * Pregnancy Weight Gain Calculator to see how your pregnancy weight is tracking * Detailed pregnancy and baby product reviews and expert buying guides After Baby’s Arrival * Baby Tracker that lets you time and track baby’s feedings, log pump sessions and diaper changes, record tummy time, and more * Pregnancy month-by-month and milestone tracker for each step of your baby’s life, from the newborn to the toddler stage * Daily tips customized by baby’s age and stage, your postpartum recovery, and your parenting journey * Record your postpartum symptoms, medications and memories * Videos and expert articles about sleep schedules, feeding tips, milestones, and baby’s growth and week by week development * Medically reviewed articles and info about baby’s health, doctor’s appointments and vaccines * Connections in Community groups related to your baby’s birth month, health conditions, parenting styles and more When Starting a Family * Ovulation Calculator that pinpoints your most fertile days based on last period and cycle * Pregnancy Due Date Calculator, which helps you figure out baby’s potential due date when you’re TTC * Ovulation tracker and early pregnancy signs, plus keep a journal of your feelings when you’re trying to get pregnant * Expert advice and articles to help you understand your cycle, signs of ovulation and pregnancy, fertility issues, adoption and surrogacy, and more * Supportive Community groups devoted to preparing for pregnancy and fertility treatments About Us All content on the What to Expect app is accurate, up-to-date and regularly reviewed by the What to Expect Medical Review Board and other pregnancy, baby and parenting health experts. It’s in line with the latest evidence-based medical information and accepted health guidelines, including the What to Expect books by Heidi Murkoff. The medical guidelines and recommendations on the What to Expect app come from highly respected expert organizations including the American College of Obstetricians and Gynecologists (ACOG), the American Academy of Pediatrics (AAP), and the Centers for Disease Control and Prevention (CDC), as well as from peer-reviewed medical journals and other reputable sources. For more about What to Expect's medical review and editorial policy, visit: https://www.whattoexpect.com/medical-review/ Do not sell my info: https://dsar.whattoexpect.com/ Use our pregnancy tracker app to help with happy, healthy pregnancy & baby! Let’s connect: * Instagram: @whattoexpect * Twitter: @WhatToExpect * Facebook: facebook.com/whattoexpect * Pinterest: pinterest.com/whattoexpect * TikTok: @whattoexpect more",
  "reviews": [
    {
      "user": "lowkeykenz",
      "date": "03/27/2024",
      "title": "New parents check this app out!\n\n    Developer Response",
      "review": "I don’t usually write reviews but I felt like during the time of finding out you or your partner is pregnant there’s a lot of searching for the right apps, people, or products you should use and so I wanted to make it a little easier for expecting parents to see someone who cares about what they are going through and hopefully you won’t have to continue app searching after my review. I am expecting a baby girl and I am 5 months along. I have used this app since the beginning of my pregnancy and since then have tried a few other apps just making sure i’m using the one I enjoy the most. What to Expect has lots of awesome features hence why I love it. It has an option to show you how much your belly will grow along with your baby size week by week. If i have any upcoming events happening I love to see what to expect when the date comes along! I also really enjoy the fact there are multiple short videos every week for you to watch about what your baby will be developing in the womb week by week. Something else I really like about this app is it has a community area where you can join groups that fit you and you can ask whatever questions you would like or you can read over already asked questions or give advice of your own. It’s a great place for you to feel better when weird side effects come along. Definitely try out this app! more Lowkeykenz, it is not every day that we receive feedback as detailed and thoughtful as yours. But trust us when we say that it does not go unnoticed. Your comment has given us valuable insight into the What to Expect Community. Thank you for taking the time to share your thoughts with us. more"
    },
    {
      "user": "Ashley_Beerse",
      "date": "09/04/2022",
      "title": "Best Pregnancy App\n\n    Developer Response",
      "review": "This is my first pregnancy, but I’ve tried almost every other app and most of them are just weird, don’t track properly or you have to pay, this app is completely free and there’s a huge community of people and several different groups customized to age, gender of baby, gestational age, anxiety, even moms who have already had their kids that still talk and need advice from each other. The baby tracking is great and you can chose what little fruit or prop represents your baby for the week. There’s so many tools that help you track so many things and even has little articles about almost everything. This app helps you learn so much if you want to as well, and like I said it’s all free, there’s even weekly videos you can watch on how your baby is developing, and how it tracks the development is insanely accurate, and because there’s such a big community there’s people that are going through what your going through and so much more, and if you end up making a post, you’re definitely guaranteed to always get a response from atleast a few people. I love this app so much and and thinking about even keeping it after my pregnancy to join groups with moms after pregnancy. If you’re looking for a baby app this one really is the way to go! more Ashley, it is not every day that we receive feedback as detailed and thoughtful as yours. But trust us when we say that it does not go unnoticed. Your comment has given us valuable insight into the What to Expect Community. Thank you for taking the time to share your thoughts with us. Congratulations on your pregnancy! The team here at What to Expect is so excited to be a part of such a special milestone in your life. We wish you and your baby good health! more"
    },
    {
      "user": "Amber B3.",
      "date": "08/04/2021",
      "title": "Love this app !\n\n    Developer Response",
      "review": "I’ve been using this app since I first found out I was pregnant. I love being able to know how big she is, what’s going on with her growth & inside the womb & what’s going on with my growing bump as well! My favorite part of the app would definitely be the community tab - if I have a question about anything, I can always make a post with my concern or can find other past posts that were regarding the same issue i’m having. Sometimes during pregnancy, you definitely can feel alone, & I feel like the community tab definitely helps those feelings subside when you see just how many other women are going through exactly what you are. Especially when you join a topic for your due date month! I’ve met so many different girls who are due either on the same day, or same week as I am & it makes me happy to know that I’m not the only one experiencing this or that. Definitely would recommend this app to anyone who is expecting, even the S/O or a family member can join the app to see your progress too! (A plus is that you can continue to use the app even after your baby is born, the community topics extend far past postpartum too!). more We're so glad to hear that you're enjoying the What to Expect app. We appreciate you taking the time to share your valuable thoughts and insight regarding the community. Please send additional feedback to support@whattoexpect.com or by clicking on the feedback link within the app as your feedback is helpful when making updates to the app. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "Apple Watch"
  ],
  "size": "113.8 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Sexual Content and Nudity\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English"
}