{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Glucose Buddy Diabetes Tracker 4+",
  "subtitle": "Blood Sugar, Carb, A1C Manager",
  "seller": "Azumio Inc.",
  "stars": "4.8",
  "rating": "24K Ratings",
  "price": "Free",
  "appDescription": "RANKED #1 DIABETES APP FOR OVER 10 YEARS. - Track blood sugar, medication, A1C - Log weight - Track carb intake through our food database Ranked #1 Diabetes iPhone Application by Manny Hernandez, Founder of TuDiabetes.com As seen on American Diabetes Association's Forecast Magazine, NYTimes, Wired Magazine, DiabetesMine.com, MedGadget.com, Mendosa.com, Diabetes Health Magazine, JDRF Newsletters and MobiHealthNews. FEATURES: - Easily log blood glucose, medication, meals, in one entry - Track trends in your blood sugar, insulin, weight, A1C, and more! - Comprehensive 12-Week Diabetes Education Plan featuring 5-minute lessons perfect for learning on the go - Meal IQ will help you make better food choices and better understand how your food impacts your blood sugar - Add notes to your entries for future reference - See changes in your blood sugar and carb intake on an hourly basis - Log your meals using our extensive food database - Automatically track your steps, walks, and other cardio activities - Export your data into printable PDF reports and CSV files you can take to your healthcare provider - Supports glucose units mg/dL and mmol/L - Integrates with Dexcom (Devices & Apps -> Dexcom) - Integrates with Apple Health App (Devices & Apps -> Apple Health Data) Unlock additional features by subscribing to Premium! Features include: - Automatic A1C calculator so you always know your long term management - Custom tags to make logging easier for you - Entry filter for better insights into your blood sugar - Advanced graphs so you can easily identify trends in your glucose and medicine intake - Report date range flexibility - No ad experience - Complimentary premium access to top health and fitness apps such as Fitness Buddy for gym and home workouts, Calorie Mama for automatic calorie counting, and so much more! Medical disclaimer: The content found within the Glucose Buddy app is provided for informational purposes only and is not intended as a medical device, or as a substitute for the medical advice of a trained physician. We offer auto-renewable subscriptions with the following specifications: - Subscriptions are for a 1 month or 12 month duration - Subscriptions are $14.99 USD for 1 month or $39.99 USD for 1 year - Payment will be charged to your iTunes account at confirmation of purchase - Account will be charged for renewal within 24-hours prior to the end of the current period. Subscription will auto-renew for the same price charged at start of subscription - Subscription automatically renews unless auto-renew is turned off at least 24 hours before the end of the current period - Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase - No cancellation of the current subscription is allowed during active subscription period - Any unused portion of a free trial period, if offered, will be forfeited when the user purchased a subcription to that publication - Our privacy policy and terms of use: https://www.azumio.com/page/privacypolicy Medical disclaimer: The content found within the Glucose Buddy app is provided for informational purposes only and is not intended as a medical device, or as a substitute for the medical advice of a trained physician. Note: Continued use of GPS running in the background can dramatically decrease battery life. The Glucose Buddy app integrates with the Agamatrix Jazz Wireless 2. This medical device has regulatory clearance in the US only. Privacy policy and terms of use: https://www.azumio.com/page/privacypolicy more",
  "reviews": [
    {
      "user": "MeganMMac87",
      "date": "03/14/2018",
      "title": "Love this app!",
      "review": "I never gave a crap about my diabetes until I lost both of my parents at the age of 51. They both were diabetic and although that wasn’t necessarily the cause of their death as my dad had cancer and my mom had an upper GI bleed along with other issues it certainly did not help. My A1C was out of control at 10.2! Here I was downing mountain dews and never checking my sugar eating whatever I wanted. I gave up sodas, and fast food but finally have started checking my sugar as well. My endocrinologist has requested that I check my sugar randomly throughout the day and keep a record... well it has finally happened because of this app! 💕 more"
    },
    {
      "user": "GregMatthews",
      "date": "12/26/2018",
      "title": "Ads make it worthless",
      "review": "The app has a lot of decent features. The interface is cluttered to the point it’s hard to use and hard to find things. The reporting aspect of the app is poorly done, and that’s the most important part. In the free version, the ads after a day become so obnoxious that it’s fundamentally unusable. Full screen ads with the volume forced to 100% that offends everyone in the room. If you purchase this app you are funding a company that cares about monetizing the app far more than providing a good user experience. A premium subscription is VERY expensive, and honestly provides only a few real benefits, outside of removing the ads. I will look at EVERY alternative in the App Store before I feed this marketing tactic. There is a “plus” version with a one time app purchase that likely removes some ads, but there is no clear statement of any difference so the only way to know is to buy it and find out. If you read enough review responses, you will learn if you buy that version you simply get another nagging form of encouragement to buy the expensive subscription. What this app provides is worth no where close to what the premium version provides. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch",
    "Apple Vision"
  ],
  "size": "199.8 MB",
  "category": "Medical",
  "ageRating": "4+",
  "languages": "English, Arabic, Catalan, Czech, Danish, Dutch, Finnish, French, German, Greek, Hebrew, Hungarian, Indonesian, Italian, Japanese, Korean, Malay, Norwegian Bokmål, Polish, Portuguese, Romanian, Russian, Simplified Chinese, Slovak, Spanish, Swedish, Thai, Traditional Chinese, Turkish, Ukrainian, Vietnamese"
}