{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Pedi STAT 17+",
  "subtitle": "",
  "seller": "James M Kempema MD PA",
  "stars": "4.5",
  "rating": "60 Ratings",
  "price": "$5.99",
  "appDescription": "Pedi-STAT is a rapid reference for RNs, paramedics, physicians and other healthcare professionals caring for pediatric patients in the emergency or critical care environment. ************************************ Reviews ************************************ Among \"The Best Drug Reference Apps for Emergency Physicians\" - Emergency Physicians Monthly 5 STARS - \"Simple interface provides rapid access to critical data needed when managing a critically ill pediatric patient\" 5 Stars - \"Very useful for treating kids in high pressure situations with precision.\" ***************************** Pedi-STAT features include: - Rapid results for airway interventions including endotracheal tube sizes, depth, intubation medication dosages, ventilator settings, and sedation - Cardiac resuscitation data including weight specific dosages for resuscitation medications, cardioversion, and defibrillation - Access to age and weight specific pediatric equipment including foley catheters, airway management, chest and NG tubes, peripheral and central line sizes, and more - Seizure medication dosages - Management of hypoglycemia including age specific dextrose concentrations - Reference of age specific normal vital signs - Procedural sedation dosages including single dose meds and infusions, as well as reversal agents - Calculated pain management medications - Medical management of allergic reactions and anaphylaxis Users can quickly access critical information accurately, without having to rely on memory or cumbersome textbooks. With just a few taps, users have access to all the necessary data to care for a pediatric patient in the emergent setting, including weight-based and age specific medication dosages and equipment sizes. Since many of the patients present with minimal known information, all the results can be calculated rapidly with only a known age, date-of-birth, weight, length, or height. Simply enter the known variable and the data is instantly calculated. Developed by an Emergency Physician, this app minimizes the risk of medical errors allowing the provider to spend more time caring for the patient, and less time looking up and calculating doses. It is a critical companion for any physician, nurse, paramedic, or medical trainee involved in the care of critically ill pediatric patients. more",
  "reviews": [
    {
      "user": "DavieMustard",
      "date": "10/14/2020",
      "title": "Best paeds quick reference\n\n    Developer Response",
      "review": "I’m an EM doc, have tried all the various paeds quick reference apps, for my purposes, i find this one easiest to use and most comprehensive for most “real world” applications. Many others are organized by cards for the patient weight with all i fo in one place. This is more what i was looking for, a weight-based reference that is organised by the symptom i am treating, helpful for everyday things like antipyretics and antiemetics, which i (fortunately) use more frequently in my practice than resuscitation medications in paeds (although these are also available and easy to reference in the app as well) more Thank you for your review of Pedi STAT. We are constantly working to make this the most trusted, reliable resource for pediatric emergency medicine; whether you are a physician, nurse, PA, or prehospital provider. Please let us know if you have further suggestions for improvements - we have a number of enhancements currently in development for the app that will make it even more worthwhile and a valuable resource in minimizing medical errors. more"
    },
    {
      "user": "EJ PGY1",
      "date": "10/27/2021",
      "title": "Excellent Peds Resource",
      "review": "This is a must have app for any provider (physician, nurse, tech) who works in a pediatric setting. It’s very user friendly, quick to access and manipulate to find what you need, and accurate to patient care. If you’re looking for an app that will help guide your care and answer quick questions regarding dosages or weight/age-based management, this is the app for you. 100% worth the purchase & download! more"
    },
    {
      "user": "QuintessentialSoftBoy",
      "date": "04/06/2021",
      "title": "Great App for Emergency Medicine",
      "review": "I always get stuck on Pediatric dosing when I’m working through pediatric Simulation cases. I used this app on my friend’s phone and was pleasantly surprised at how quick, simple, and easy it is to use. I can confidently say that this app was the easiest to use when compared to competitors that I’ve also tried in other pediatric cases. I’m very excited to now have this app and continue using it as I continue growing in my career! more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "46.2 MB",
  "category": "Medical",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English"
}