{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "VisualDx 17+",
  "subtitle": "Medical images & differentials",
  "seller": "Logical Images",
  "stars": "4.5",
  "rating": "180 Ratings",
  "price": "Free",
  "appDescription": "VisualDx is a visual reference tool for medical professionals that aids therapeutic decisions and improves patient safety. Improve patient engagement and satisfaction when you use VisualDx in the exam room and beyond. VisualDx is a visual reference tool for medical professionals that leverages AI technology and a comprehensive image atlas to improve medical decision-making worldwide. With VisualDx, clinicians can: • Build custom differentials across dermatology, internal medicine, pediatrics, and more while considering patient findings such as history, recent travel, and allergies. • Engage with patients by sharing pictures of skin that reflect their disease presentation because VisualDx has been building the most diverse set of images, including dark skin dermatology, for more than 20 years. • Improve diagnostic accuracy and reduce implicit bias by accessing data-driven differentials. • Access therapy and best test options from our handbook-length summaries of more than 3,200 diagnoses across all medicine. • Quickly recognize infectious diseases and travel-related illnesses with our public health resources. • Earn 0.5 AMA PRA Category 1 Credits™ for internet point of care activity with every search. See why this award-winning clinical decision support system is being used in more than 2,300 hospitals, clinics, and medical schools by physicians, nurses, students, PAs, NPs, and other healthcare professionals worldwide. VisualDx requires a subscription. Terms of Use: http://www.visualdx.com/legal/acceptable-use-policy-notice Privacy Policy: http://www.visualdx.com/legal/privacy-policy/ more",
  "reviews": [
    {
      "user": "derm_md",
      "date": "08/15/2018",
      "title": "Best clinical app for dermatology",
      "review": "I have been a user of this app for >3 years from dermatology residency to clinical practice as a board-certified dermatologist. Very easy to navigate and nearly comprehensive listing of dermatological disease. Whether you are using it as a learning tool (med student, resident) or clinical assistant (ED, IM, dermatology, etc.) it is a “must have” if you encounter cutaneous disease in practice. I use the app multiple times a day and use it to assist with diagnosis, differentials, quick treatment guide, and most importantly as an education tool for the patient. I often will pull up a known diagnosis and show the patient similar photos to their condition from the expansive photo bank to help support a diagnosis. Furthermore, i frequently print out patient handouts for patients so that they have a reliable and physician-vetted document to help answer any questions that remain after our patient encounter. All in all, this is the single best and most used app I use in clinical practice as a dermatologist. Very useful for med students to experienced physicians and I highly recommend. more"
    },
    {
      "user": "5MSwa",
      "date": "07/29/2021",
      "title": "Use every day, easy CME",
      "review": "VisualDx was recommended to me by multiple colleagues. I am a new PA and have found this app to be very helpful. Many pictures, descriptions of conditions, differentials, best tests, tx options. The important things you need to know are there. Also, when looking up conditions, you are accumulating CME for every search. Love the app. Wish they had a better setup for their quizzes for dermatology, as they just have a photo, and is sometimes hard to see what body area you are even looking at. 5/5 more"
    },
    {
      "user": "Mckenna141",
      "date": "07/28/2021",
      "title": "Best app for a derm resident",
      "review": "I used this app daily in my derm residency. It was incredibly helpful to put in a morphology and build a differential diagnosis in my head and then see what else I should be thinking about or consider based on the app findings. There are tons of Kodachromes, clinical pearls, treatment guidelines, and even dermpath images at the tip of your fingers. I recommend VisualDx to everyone. I was lucky enough to have my residency buy the subscription, check with your program and if they don’t have it - con them into it lol more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad"
  ],
  "size": "178.6 MB",
  "category": "Medical",
  "ageRating": "17+\n                Unrestricted Web Access\n                Frequent/Intense Sexual Content or Nudity\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English, French, German, Japanese, Portuguese, Simplified Chinese, Spanish"
}