{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "CVS Caremark 4+",
  "subtitle": "Convenient prescription refill",
  "seller": "CVS Caremark",
  "stars": "4.4",
  "rating": "46.7K Ratings",
  "price": "Free",
  "appDescription": "The CVS/caremark™ app lets you refill mail service prescriptions, track order status, view prescription history and more. You must have CVS/caremark prescription benefits to use the app: If you’re not sure, check your health insurance plan information to confirm. Features include: • Refill mail service prescriptions without registering or signing in (Easy Refill) • Submit new mail order prescription • See number of refills due and orders in progress without signing in • Check order status • Renew or request new mail service prescriptions • Check drug costs and coverage • View prescription history • Find a pharmacy in your network • View your member ID Card (if provided by plan design) • Add your member ID Card to your Apple Wallet (if provided by plan design) • Identify unknown pills • Check for potential drug interactions • Update account information; shipping and billing information, manage family access, and reset password • Touch ID sign in for easy access to your account and key app features If you already use Caremark.com, your existing username and password will also work on the app. If not, you can register directly on the app and use your new username and password on the website. ** We're here to help you get the prescriptions you need when you need them. If you like this service, please take a moment to review our app.** more",
  "reviews": [
    {
      "user": "Hillside Redbeard",
      "date": "07/18/2019",
      "title": "Accessibility",
      "review": "This is the provider I am forced to use so I do what I can. There are no CVS pharmacies within reasonable driving distance so I am stuck with the online site. It is difficult to manage the auto refill and auto renew features. It seems like they MAKE it hard so they can send medications that you don’t need any more, at that point, they can FORCE YOU to pay for it since they say they can’t accept returns. I feel 3 stars is very generous. I wouldn’t doubt there customer base would shrink by a lot if employers offered choices of prescription plans. CVS needs better clarity for their web site and phone apps. AND THEY NEED TO ALLOW US TO GO TO A LOCAL PHARMACY FOR MAINTENANCE MEDS WHEN THEY DON’T HAVE A STORE LOCALLY. more"
    },
    {
      "user": "Cablough",
      "date": "06/02/2024",
      "title": "Worst App",
      "review": "This really is the worst app. If you don’t have high blood pressure before using it you definitely will after. But don’t get excited- they won’t let you refill your BP meds- because of course they know better than your Dr. there is nothing simple about this app. Tell it to use facial recognition- go ahead. But it will still ask for a password that it will refuse to recognize. Want to refill a prescription? Nope! Not gonna do that even though it was last refilled 3 months ago. I am convinced they make it impossible to use so that you need more meds that the app will refuse to give you even though a medical professional prescribed them. I really really hate this app and I am forced to use it because of course. Insurance. For meds that aren’t even addictive like for BP or cholesterol. This app will completely ruin a perfectly good evening. This app will tell you to renew a med and you’ll do it then it will chastise you and say it’s too soon. This app makes you think hmmm I’d rather die than try to use it to refill a prescription. more"
    },
    {
      "user": "otherusernameistaken",
      "date": "02/29/2020",
      "title": "Incompetent people and technology",
      "review": "I was mistakenly told to download this by a customer service rep. To speak to a person is nearly IMPOSSIBLE. The representative that I called to help me troubleshoot says their system shuts down 5 times a day. It took 20 minutes for him to tell me to just call my insurance. His supervisor couldn’t even help. I insisted there was some confusion and I may not be in the right department. He said CVS could not help, call my insurance. These people are horrible, I can not imagine an elderly person dealing with them😢. He laughed and said he couldn’t help and said I live in a “Coronavirus Area” ??? California ???The app constantly froze and he said I didn’t exist in the entire CVS system(actually a ten year member). People please be careful with your loved ones. He asked for a lot of personal information only to say to call someone else. The app didn’t help and just shut down when it experienced an error, in addition to taking multiple minutes to load. They clearly don’t have the infrastructure or training in this department or app. 100% DO NOT RECOMMEND. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "Apple Vision"
  ],
  "size": "73.7 MB",
  "category": "Medical",
  "ageRating": "4+",
  "languages": "English"
}