{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Zocdoc - Find and book doctors 12+",
  "subtitle": "Top-rated, in-network care",
  "seller": "Zocdoc Inc",
  "stars": "4.8",
  "rating": "65.8K Ratings",
  "price": "Free",
  "appDescription": "Zocdoc is the leading healthcare marketplace that makes it easy for patients to find and book the right doctors for them. Each month, millions of people use Zocdoc to search for in-network care and instantly book appointments online. Patients typically see a doctor within 24 to 72 hours of booking. Download the free Zocdoc app to find and book a doctor today. WHAT TYPE OF CARE IS AVAILABLE ON ZOCDOC Zocdoc aims to help every patient find and book every type of care. There are nearly 100,000 providers across more than 250 specialities available on Zocdoc— primary care physicians, dentists, eye doctors, OB-GYNs, therapists, dermatologists, and more. This also includes urgent care, imaging services, and 24/7 on-demand virtual care. Providers on Zocdoc offer virtual and in-person visits, and they accept +18,000 different insurance plans, making it easy to find in-network care. WHY DO PATIENTS LOVE ZOCDOC - With the Zocdoc app, patients can easily find and book the right care: - Search by insurance and location to find nearby in-network providers - Add your location to find doctors near you - Filter by speciality, procedure, availability, distance, gender, and more - Read verified reviews from other patients - See doctors’ real-time appointment availability - Instantly book in-person or telehealth appointments online - Get fast access to care, typically within 24 - 72 hours - Receive personalized appointment reminders - Fill out your intake forms digitally, ahead of your visit HOW DOES ZOCDOC WORK Search and compare the right doctors by what matters Search by speciality or symptom along with location, availability, and insurance to see providers who are in-network. Research and compare providers by reviewing their profiles, which include professional statements, education background, photos, and verified reviews and ratings from other patients. Instantly book any type of care View providers’ real-time appointment availability, select a convenient time, and click to instantly book an appointment, 24/7. Prepare for the appointment Save time by filling out intake forms and insurance information on Zocdoc ahead of the visit. Stay on top of care Keep track of upcoming visits with appointment reminders and personalized recommendations for preventative care. View your care team and easily rebook. more",
  "reviews": [
    {
      "user": "JLavin4",
      "date": "02/14/2020",
      "title": "Amazingly Easy",
      "review": "Absolutely wonderful having this app! I love that I can chose ANY doctor that I want, just based off of their availability. There is absolutely nothing worse than having to Google “doctors near me” and having to call each individual one to find out who can or has time to see you immediately! Oh, and if you don’t make an appointment with each one at the very moment, by the time you call back bc you wasted all that time calling every single doctor, just to realize that one was the soonest appointment and doctor available even though they are booked 3 weeks out at the moment, then by the time you call back to schedule that appointment, it’s already been taken!!! So now you have to wait 4 weeks to be seen! So, basically, like I’ve said, this is an absolutely great app for SO many reason other than just what I’ve mentioned. I recommend this app to everyone I know for it’s easy convenience! Also nice that I don’t have to deal with calling and as soon as someone answers the phone, I’m not being thrown on hold before I’m even given the chance to answer them back as to if, “it’s okay to hold!” So take it from me, this is a MUST HAVE app!!! more"
    },
    {
      "user": "mkhuramc",
      "date": "11/29/2023",
      "title": "Shady",
      "review": "For starters, the site is not as easy to navigate as they make it look on TV. Secondly, they just give you a list of all providers for the particular issue you’re looking for without telling you whether or not they’re in your insurance plan so you have to go through each doctors profile one at a time to see if they’re in network for your insurance. Then once I finally found a doctor and booked an appointment, THEN they informed me that the doctor has to be in the same state as you regardless of the fact that it’s a video visit. So why was the list showing me doctors for all 50 states in the country when I had already put in my address?!!!! So I had to cancel the appointment with that doctor and then find a doctor that was both in my insurance and in the state of Connecticut from this big long list of providers from all insurance plans all over the country I finally found a doctor and booked an appointment. A few hours before the appointment, his billing department calls me looking for “more information”, but my phone showed that their phone number is located out of Texas!! What kind of doctor operates in Connecticut and has a billing department in Texas?! At this point, I was beginning to doubt the safety of this site when it comes to my personal information and I already gave them copies of my insurance card!!!!! I am seriously concerned now about being a victim of identity theft, and having someone else get medical treatment using my insurance card. more"
    },
    {
      "user": "mbazel",
      "date": "07/22/2022",
      "title": "It’s not what it promises to be.\n\n    Developer Response",
      "review": "Zocdoc has changed dramatically. The service used to charge doctors a flat fee to be on provider list. Patients who needed to see a doctor could always find someone and pay a reasonable fee if no insurance and expect to use most insurances including Medi-Cal and HMO. If they wanted to schedule with same doctor for follow up, this option was always available. Since June of 2022, the billing structure has changed. The doctor has to pay $40 for each patient who books online, whether the patient is seen or not. This, of course, became a much more expensive proposition for the doctor and he has option to cap his monthly expense, which makes him unavailable to receive any future referrals after he reaches the cap. The new billing structure placed a huge barrier to patient-doctor interaction on Zocdoc. Firstly, the doctor can’t afford to accept Medi-Cal or HMO patients anymore. Secondly, to cover increased expenses, the doctor must increase his charges for patients coming from zocdoc. Thirdly, the moment the doctor reaches his cap he becomes unavailable to more patients on zocdoc. Therefore, the choice of doctors, obviously, diminishes drastically. My advice, find a different service to look for doctors, just do a simple Google search. Zocdoc isn’t worth it. Developer responded with a lame robotic answer, not covering a single issue raised by my review, just call us if you have questions…yeah right. more Thanks so much for providing us with your feedback. Zocdoc is a paid marketing platform for providers, and our pricing was determined by a valuation study conducted by a reputable third party for the types of services Zocdoc is providing to them. Providers also have multiple options to ensure that their information and availability are correct, as well as ways to make this platform as beneficial as possible for them. However, Zocdoc remains a free booking service for our patients! Please give us a call at (855) 962-3621 if you'd like to discuss this any further. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "146.6 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English"
}