{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Doximity 17+",
  "subtitle": "Secure Calling & Medical News",
  "seller": "Doximity",
  "stars": "4.8",
  "rating": "173.1K Ratings",
  "price": "Free",
  "appDescription": "Doximity helps over 2 million healthcare professionals take the friction out of everyday challenges that are unique to clinicians. The tools you already use, conveniently in one place and designed to make your life a little bit easier. \"This should be on every physician’s phone.” AppStore Review “A useful tool when you’re on call” -iMedicalApps One-Click Patient Video Calls Dialer Video is the simplest, secure telemedicine solution available for you and your patients. You start a call and your patient receives a text to join. It’s that easy. Call Patients Without Using *67 \"Love that dialer. Great to be able to call patients on a weekend without inducing avoidance by being anonymous or giving my personal cell number\" - App Store Review Send Faxes Without a Fax Machine “So nice to have a secure fax for medical records and labs. I love getting results on the go and being able to respond in real time to information .” - App Store Review Get Your News in One Place “Concise articles. Quick to read and relevant. Haven’t noticed any editorializing, which I greatly appreciate. Just the facts, ma’am.” - App Store Review Search and Find Any Other Physician in the Country “This Is an app I use regularly. It has allowed me to keep better contact with my colleagues and former medical school friends.” - App Store Review Features: - The social newsfeed for medicine - Keep up with the latest clinical news in your specialty - Call patients without using *67 - Integrates with Epic Haiku and Amion Scheduling Apps - Search the largest directory of U.S. clinicians - Find clinicians based on specialty, location and clinical interests - Send HIPAA secure faxes from anywhere - Sign, date and annotate documents - Let clinicians know what you do best with your digital CV - Quickly look up office info for any other physicians, NP, PA or pharmacist - Reconnect with former medical school classmates, co-residents, co-fellows or colleagues more",
  "reviews": [
    {
      "user": "Ckuttner",
      "date": "09/13/2021",
      "title": "Wonderful app",
      "review": "Update: Doximity has begun charging for Dialer calls of >40 minutes, so I have started paying for the service. I am still really happy with it. <Disclaimer: I was invited to participate in the IPO and bought some stock. That has appreciated nicely.> ——————- I am very much a fan of Doximity. I was originally mildly interested in it for connecting with old classmates, and somewhat interested in the news. But now, particularly since I’m practicing from home and exclusively online, I use it daily. I understand it is HIPAA-compliant: 1) I use Dialer to call patients. I use my own cell phone, but Dialer disguises my phone number, using my office number as the Caller ID. 2) I use another service sometimes, but many of my patient visits are using Dialer. I can place only an audio call, or can send a link to my patient’s cell phone. They click on it and we have a video call. The quality of the connection is overall good, of course often limited by the cell signal my patient is experiencing. 3) I can send and receive faxes. Just yesterday, I had to complete an FMLA form. I scanned it, saved the images, and securely faxed the images. It was quick and easy. And this is FREE!! I imagine Doximity is using and selling my data somehow, but I really have no complaint. more"
    },
    {
      "user": "EndoDocNYC",
      "date": "12/03/2019",
      "title": "Don't Stop Feeling Like A Doctor!",
      "review": "Similarly to what a colleague wrote, I'm no longer in practice. I now work for the State, which can entail being at up to 5 different locations in the course of a work week. \"Retirement\" from practice should not have to mean feeling that you've lost the \"privileges\" of being part of so noble a profession. And, let's face it, after nearly 35 years of getting the VIP treatment, it's hard to let go of that. Doximity's e-fax capability helps you maintain that status and professional independence. It's nice to have your office (\"private practice\") in your pocket. Recently I had to see three specialists and it involved a lot of imaging and labwork. To have virtually immediate access upon request or getting CC'd to your private, secure and virtual \"office\" is truly a luxury. While e-faxing has existed for years, using it in the Doximity context / community also helps keep me linked professionally. With regard to the quality of the articles and subject matter, I can definitely use an easy read from time to time. Grateful for the excellent job you're doing! more"
    },
    {
      "user": "Tom Hybridoc",
      "date": "10/08/2024",
      "title": "A game changer!",
      "review": "I am medical director and a volunteer with a Michigan charitable care clinic providing free medical care to area residents without health insurance. Doximity Dialer was a game changer for us during the pandemic. We were able to maintain continuity with with our patients via virtual visits. Even now, in the Covid 19 endemic phase it’s extremely helpful. Most of our patients are working poor and depend on our services to keep going. Doximity is an important part of that care. I especially appreciate how Doximity continues to innovate and seek new solutions to the challenges that medical professionals face. The AI powered ask a question and letter writing functionality is amazing and quite helpful. The ability to network with other professionals builds collegiality. The news articles provide important info you don’t easily find elsewhere in your news feed. You make this challenging job easier. Thanks for all you do, and keep up the great work! more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad"
  ],
  "size": "241.5 MB",
  "category": "Medical",
  "ageRating": "17+\n                Infrequent/Mild Alcohol, Tobacco, or Drug Use or References\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English"
}