{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "mySymptoms Food Diary 17+",
  "subtitle": "IBS Food & Symptom Tracker",
  "seller": "SkyGazer Labs Ltd",
  "stars": "4.6",
  "rating": "3.7K Ratings",
  "price": "Free",
  "appDescription": "Explore the connection between your diet and health with mySymptoms. Easily track your meals, symptoms, and share detailed journals with your clinicians. Our sophisticated analysis uncovers patterns and relationships between your dietary habits and symptoms, empowering you with the insights needed to manage and improve your digestive health and well-being. Featured in ‘The Best Gut Health Apps’ by Healthline. Join over 700,000 people who use mySymptoms for their IBS, IBD, low FODMAP diet, migraines, eczema, and more. mySymptoms is a flexible food and symptom journal providing an easy way to track food, bowel health, stress, sleep, mood, periods, medications and symptoms. “This app is simply the best in terms of keeping track of your foods and symptoms. In addition to medication and exercise. It is helping me a lot to keep a journal to track my SIBO and IBS.” [mySymptoms customer] DIARY / JOURNAL • Food & health tracking: Log all aspects of your health, including food, drink, medication, stress, exercise, and environmental factors. • Food database: Search or scan barcodes to access our extensive database of foods. • Symptom tracking: Log symptom intensity, duration, and additional notes. • Wellness Metrics: Log your energy, sleep quality, and bowel movements (using Bristol scale) • Customization: Add your own drinks, foods, meals, medications, exercises, and symptoms. INSIGHTS & ANALYSIS • Correlation analysis: Explore how different foods affect your symptoms, helping you identify potential triggers and patterns. • Detailed reports: Featuring specific metrics, histograms, and trend charts that visually illustrate trends over time. • Event review: A detailed list of instances where specific foods or symptoms occurred. SHARING & REPORTS • Share with your clinician: Securely share your diary with your clinician through our dedicated Clinic web app. • Family access: Share access on multiple devices using the same account. • Data export: Export your food diary for review or sharing with health professionals in PDF or CSV formats. PRIVACY & SECURITY • Privacy first: Your account starts with an anonymous username ensuring confidentiality. Your name and email are only required if you choose to share your diary with a clinician. • Robust security: Your data is fully encrypted both during transmission and while stored in the cloud. • Control your data: We never share or sell your personal data. You may choose to participate in optional studies that help advance health research. • HIPAA & GDPR compliant: Share your diary with clinicians confidently, knowing our app meets HIPAA & GDPR (Health Data) standards for protecting sensitive patient information. mySymptoms is used by individuals managing conditions such as: • IBS (Irritable Bowel Syndrome) • IBD (Inflammatory Bowel Disease) • Food intolerance and sensitivities such as dairy, gluten, lactose • Acid reflux • Crohn’s disease • Celiac disease • SIBO (Small Intestinal Bacterial Overgrowth) • Ulcerative colitis • Migraines & cluster headaches • Eczema • Bloating, heartburn, and many other digestive conditions Try mySymptoms and start your journey to improved digestive health and well-being today! SUBSCRIPTION INFO mySymptoms provides a subscription service with a free trial. Cancel anytime during the trial without fees. After the trial, you’re billed monthly, semi-annually, or annually based on your plan. Manage or cancel your subscription anytime through your App Store subscriptions. Ensure changes are made 24 hours before renewal to prevent charges. TERMS & CONDITIONS Terms of Use: https://www.mysymptoms.net/terms Privacy policy: https://www.mysymptoms.net/privacy MEDICAL DISCLAIMER mySymptoms, a wellness tool, tracks diet and health patterns to support, not replace, healthcare relationships; not for medical diagnosis. more",
  "reviews": [
    {
      "user": "Beth in Louisville, KY",
      "date": "03/28/2022",
      "title": "Very useful & gets easier to use over time",
      "review": "I have been using this ap for nearly a week after my gastroenterologist suggested I keep a food and symptom diary. I don’t want to have to do this but if I am going to invest the time, I want to have useful data. This ap allows a lot of individualization, both of data type as well as granularity. It is taking a little longer to figure out how to optimally use than a less customizable ap but I greatly appreciate having this flexibility. So, e.g., if I want to list only 2 items for a day, such as “coffee” and “heartburn” I could do that. Or if I want to list detailed ingredients and quantities and exact times with free text comments in multiple categories, I can also do that. If over time I realize I need to go more or less granular or add or subtract a category, I can do that. After using for a few days, the selectable entries became much quicker as the ap defaults to listing prior entries as available selections for subsequent days. If you are like me, you are taking some of the same meds and supplements and eating many of the same foods each day. I don’t have enough data yet for extensive analysis yet but look forward to exploring these features more as well. There is a wealth of information available here, so far it has been well worth the time I have invested. more"
    },
    {
      "user": "kelbell23",
      "date": "11/12/2017",
      "title": "So impressed\n\n    Developer Response",
      "review": "This is the first time I’ve EVER reviewed an app, because it’s the first time I’ve ever been so impressed! The functionality is amazing— so much more than you’d expect for an inexpensive little app. The ability to toggle on/off certain configurations / ways the algorithm works / analysis period to find top suspects— is evidence of the care and pride into this app. I could not believe when I went on vacation, the times of each entry changed for that day, so I didn’t have to do any more work (ie, pretending to be on a different timezone that day) so my “X hours after” ingestion values weren’t wrecked— it just worked, without any human adjustment needed! Clearly someone has thought long and hard about every scenario, and taken steps to address it in the app. I think the ability to either create a new recipe or replace all previous instances of the recipe with your new entry is essential, and without it, I doubt the results would ever be accurate. Basically I’m blown away by this app!!!! I should note that I find technology intuitive in general. If you want a more beginner’s app, and you’re willing to trade functionality for ease of learning the app, maybe you’d want to choose a different one. Personally I’m so glad I didn’t. This app rocks!!! more Thanks for your review - it's great to hear you think mySymptoms rocks! :-) If there's anything we can improve, general feedback, or questions, please drop us an email by going to More > Suggest an improvement. Kind regards, mySymptoms team. more"
    },
    {
      "user": "morenliorest",
      "date": "11/23/2020",
      "title": "Most excellent tool to manage my symptoms!",
      "review": "i downloaded a week ago, after 3 successive disappointing experiences with similar apps. when trying to register initially last Sunday, i did not notice the password requirements, and failed numerous times. I asked by email for help, which was immediately answered on the first hour on Monday! amazing customer service and follow up care , exceptional company!! All being wonderful, i started using it, and here’s the real amazement:- it’s probably the most comprehensive, smart, beautifully designed and well-thought app out there. Being a systems analyst myself, i naturally tried to test/challenge/trick and find the problems or things lacking with the app...:). WOW AND BRAVO guys, superb achievement, you need to be proud of your work, it tremendously helps people like me with real bad lifelong symptoms of a disease that must be controlled by using such a tool that keeps track of everything so perfectly. Best thing about it is it’s simplicity and ease to amend, correct, add data backdated, improve our records, and even add new items that currently do not exist in the database. Thank you developers, great job!! more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "Mac"
  ],
  "size": "37.2 MB",
  "category": "Health & Fitness",
  "ageRating": "17+",
  "languages": "English"
}