{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Leafly: Find Weed Near You 17+",
  "subtitle": "Weed delivery, pickup, & more",
  "seller": "Leafly",
  "stars": "4.8",
  "rating": "271.2K Ratings",
  "price": "Free",
  "appDescription": "Leafly is the world's #1 cannabis resource and weed app. Use Leafly to find dispensaries near you, review strains, or order weed delivery. Millions of people use Leafly's award-winning weed finder app to discover cannabis that's right for them based on reported effects, feelings, and reviews of thousands of marijuana strains. Find nearby legal weed for your medical or recreational needs with our dispensary finder. Leafly App Features: - Discover your ideal strains, tinctures, topicals, concentrates, or pot edibles based on thousands of user-submitted reviews. - Browse strains by desired effects, aromas, flavors, recommended lists, and availability at nearby dispensaries or retail stores. - Use our dispensary finder to find weed delivery services and pickup options in your area. Locate a doctor, clinic, THC or CBD products, or leave a review. - Browse menus, view weed deals and specials and read the latest user reviews. - Receive daily notifications from your favorite medical marijuana dispensaries, retail stores, or weed delivery services. - Read the latest news and lifestyle information with Leafly News and Learn, where we bring you Cannabis 101 resources, the latest medical studies, legalization updates, and other compelling cannabis content. - Watch videos to learn how to use, grow, cook, and create with marijuana. No matter your preference, the Leafly app will help you choose the right type of weed for you. Whether you're a medical marijuana patient or a recreational cannabis user, you'll love the Leafly app! more",
  "reviews": [
    {
      "user": "kanentoews",
      "date": "02/24/2022",
      "title": "I need the best weed and here’s why:",
      "review": "I have been struggling with epilepsy and a bipolar disorder my entire ie due to a dr mishandling forceps when I was a born and no one believes that smoking weed for 37 years has helped. Now this is a new century and things need to change because weed keeps my head in line and it’s way over priced for being a plant. Never once have I gotten sick or have of because of marijuana and now with it becoming legal I need exotic strains because pills kill hand herb heals and social security income isn’t enough money for something that helps me such a great deal and with it being a plant the prices are refocus in Chicago and I’m going to the drs office to have my dr fill out the information I need to help me get my card because, I don’t understand how to do it on my own. I started smoking weed at the age of 6 and I’ll be 44 in April. It’s been a long time to wait for legalization, that’s for sure. I’ve known this has helped me, even as a kid because I’ve tried almost everything else out there. I’ve just been waiting a long time for this but, I knew it would happen eventually. more"
    },
    {
      "user": "nenadiaz8",
      "date": "10/22/2019",
      "title": "Love love love",
      "review": "I just started smoking this year and this app is like my bible for searching strains. I love the new update but have one complaint- I miss when you’d see the info on a strain, and it would show where it was nearby. They have seemed to remove this and it was a big plus for me when looking for strains. Now I search the strains and get all the info I need, but where I could get it close to me. I don’t know if they’re thinking about adding this back, but you really should!! It was such a help, like no idea how much.. because now I have to go into all the nearby dispensaries on the app and manually search for the strain and well let’s be honest.. I’m high most of the time and don’t have the time or am In the right state of mind to be able to do this. Other than that, I’m in love with everything that was done. I guess it was time for a makeover and y’all seemed to outdo yourselves. 5 stars for you! Being that this is the first review I’ve ever written in how many years?! Wow, I hope you guys actually read this!! That says a lot! more"
    },
    {
      "user": "BigDabbyStrain",
      "date": "03/09/2018",
      "title": "Where are my pics?",
      "review": "Ok so I have really enjoyed becoming a part of this community-not too many complaints but where do my pics go, they aren’t attached to my reviews and it seems once they are uploaded they are not even able to be found again...have written two emails but just get generic responses, I even offered a reason once but was still vaguely talked into a circle and left more confused than before I had written the email... this would be the only reason I didn’t give this app 5 stars...I feel that, especially when using concentrate, a pic to accompany the review is extremely important for verification and what not...clarity, color, consistency, and all the other understanding you can gain from just looking at an extract’s visible characteristics....If nothing changes then I still love the app and give it a solid 4.7 with the only discrepancy I have being the fact that my pics aren’t connected to my reviews or me at all for that matter...just curious so let me know if you have any suggestions to remedy my situation-thank you for your professional attention regarding this matter... more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Apple Vision"
  ],
  "size": "90 MB",
  "category": "Medical",
  "ageRating": "17+\n                Unrestricted Web Access\n                Infrequent/Mild Medical/Treatment Information\n                Frequent/Intense Alcohol, Tobacco, or Drug Use or References",
  "languages": "English"
}