{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "RxLocal 12+",
  "subtitle": "",
  "seller": "PioneerRx, LLC",
  "stars": "1.9",
  "rating": "1.5K Ratings",
  "price": "Free",
  "appDescription": "Manage your medication and save time by downloading our easy-to-use app. Need to manage your family's medication? We've got you covered there too; just add them to our app to save even more time. Order refills, view medication profiles, view our contact options, and don't miss a dose by setting medication reminders directly in our app.",
  "reviews": [
    {
      "user": "Groomdogger",
      "date": "09/17/2024",
      "title": "It could be a great app",
      "review": "When I first downloaded this app 8 months ago it was great. I could easily request refills for any family member (including our pets) and I especially liked having a summary of what was ready at the pharmacy so I could double check that when I was picking up. This summer that summary disappeared. I had to manually open each individual family member’s name to see if any of their prescriptions were ready for pickup. Between the people and the pets there are 5 to manually look through. In the past few weeks there was a notice that all users must change their password. Okay. I did. Got in and used it as usual. The next time - all users must changed their password. I did again. Used the app. Then next time and every time following - every user must change their password. I’ve changed it 4 times and still getting that message. I gave up on it. Thankfully my pharmacy has a texting number so I can just text them when I need a refill. This app is useless! more"
    },
    {
      "user": "guz42",
      "date": "10/30/2022",
      "title": "Helping independent pharmacies compete",
      "review": "Love the concept, it basically seems to do what I need. And I’m so happy my local independent pharmacy has this tool to add some of the convenience of the big corporations. I love my local pharmacy. I get fantastic, caring service from professionals who know my family’s medications and who will advise me directly about important side effects or drug interactions instead of making it my job to read the dense info included. But it feels like an early version of the app. I would like to support the developers with useful feedback without trashing the app in a review. Please allow in app feedback and a feedback channel on the website. Also, better documentation on the website would help. My husband is having trouble creating an account. He entered his correct information but was told it doesn’t match what the pharmacy has on file, which cannot be true. Also I’m trying to add family members. It asks for their Rx number. What is that? How do I discover or obtain one for them? Maybe explain more fully how to do something like that on the website. All you do there is step through the really obvious path as set forth in the app. So, I’d say communication with the developers and ways to get questions answered in more detail would be the first major change to make. more"
    },
    {
      "user": "KSH2488",
      "date": "10/02/2024",
      "title": "You stink",
      "review": "I have tried a better way to contact you, but when I went to a place that should be there for help or complaints it just took me to your page on the app. That is no help so you’re getting my frustration in a Review. For over a month now I have not been able to use your app. I have deleted it reloaded it. I have had to pick a new password three times Maybe four and nothing helps all our information. Is there when I finally do get signed in but I’m getting no text messages from my Pharmacy and none from you guys and it’s just all very frustrating. My pharmacy is a private pharmacy not a big store one and I will let them know. I’m still having troubles with you guys. Any help? When you go to the App Store on my iPhone, there are two different apps with the same names. The newest one with the latest update and still can’t get signed in even though I created a new. Password. And I have searched and looked for a way to contact you but cannot find a way to message you or call you. I did just get a new iPhone 16 so that is why I was going to upload a new app because even iPhone 13, your app did not work I hope our pharmacy is not paying for you guys because not getting the service they should more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch"
  ],
  "size": "133.9 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": ""
}