{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Express Scripts 4+",
  "subtitle": "",
  "seller": "Express Scripts",
  "stars": "4.8",
  "rating": "317.3K Ratings",
  "price": "Free",
  "appDescription": "Managing your medicine is easier when our app does it for you. The newly designed Express Scripts app lets you easily and quickly find everything you need for your medicine. It’s like having a knowledgeable pharmacist in your pocket. Find a preferred pharmacy, refill your prescription and check your order status—anytime, anywhere. Whatever you’re looking for, find it faster on the Express Scripts mobile app. • Order refills for you or your family • Track orders • Start automatic refills • Access ID card You must have an Express Scripts prescription benefit plan through your health insurance or plan sponsor to use this app. This app and/or some if the features described may not be available for all plans or benefit types. more",
  "reviews": [
    {
      "user": "steve fournier",
      "date": "01/30/2024",
      "title": "customer",
      "review": "The app is extremely misleading. It leads you to believe you have a refill when you don’t. If you order a refill, and didn’t have one available then your doctor is contacted. I don’t want my doctor contacted unless I authorize it. Furthermore, many medication’s are available generically and can be billed to a good RX or other coupon at the walk-in drugstore for less than insurance price or cash price. Express scripts is very greedy and they won’t honor these coupons. furthermore, they try to charge astronomical prices, calling certain medication’s specialty, when, in fact, they have many off label use and can be purchased for as little as $20 cash. Once your prescription is sent to Xpress scripts and not fillable thru insurance or their own incompetence or otherwise laziness, it’s impossible to get it back out of there easily. the only thing this service is good for is filling prescriptions that you have a refill on that are cheap, covered by insurance and need to be refilled regularly. The app needs many improvements. they should have to return to the customer a printed copy of every electronic prescription that they mishandle and do not fill in the manner requested by me, the customer. generics, utilize, or a 50-50 chance. You either get a quality one that is made in the USA, or end up with a very inexpensive generic, made outside of the USA. I haven’t tried to order a specific generic company, because I don’t want to be on hold for that long. more"
    },
    {
      "user": "KaddyDrafter",
      "date": "06/11/2018",
      "title": "Ok but not great.",
      "review": "The app is good, and it is easy to order scripts. Cons: Changing an alert is next to impossible. Removing a medication is not possible as far as I can see. The virtual pharmacy ID card is not printable and does not contain all of the information the hard copy card has. (I have ordered a hard copy about 25 times, and have yet to receive a hard copy) There is not a section for drugs you may be allergic to. If you are looking to see your claims and history, or medicine history; you are out of luck. The search thinking wheel spins forever and almost always times out giving the message “9999: We are sorry, we are unable to complete your transaction at this time. Please try again later.”. Should you actually reach your history of any kind, forget actually printing it out. Pricing a medication by history is a long shot Only about 10 current medications show up and only about half of those are actually current up to date medications that you are taking. You better be an ace speller. If you misspell any drugs when searching within the app, the search is not smart and will not recognize even a close misspelled medication. In the world of apps, this one needs some work. more"
    },
    {
      "user": "RemmyMa",
      "date": "03/02/2020",
      "title": "Health Care Plan 5 stars, App could be better",
      "review": "The reason for only 4 stars are that #1 the app offers to keep track of how much medicine you have, however you have to input when you refill a medicine, rather then them update it automatically. #2 the app is slow to sync when a prescription is processed/shipped/delivered and I mean sometimes by three days #3 This may be more of a ‘plan’ issue “con” then ‘app’ but if you refill a prescription and it’s too early to fill (you have the option of as early as a month-online to refill) rather then the day it is dispensed, you will be billed the day you refill online. #4 their is an option to send a secure message to the RX company through the app. But you must log into the app continually to check to see if it was responded to, rather then being alerted through an email, letting you know that it’s been replied to. #5 Twice I’ve had issues logging in. Sometimes it’s after an update, or when your fingerprint doesn’t register but password does. The support center actually recommends that you delete their app, then reinstall. This is under FAQ in the support Center online. Again, these are just small grievances of the APP, nothing that reflects on the overall plan itself. I simply wanted to layout why I only gave the app 4 stars. On a side note: I save an enormous amount of money by using their mail-order service. I think overall they are an excellent plan D for Medicare patients. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "Mac",
    "Apple Vision"
  ],
  "size": "46.6 MB",
  "category": "Medical",
  "ageRating": "4+",
  "languages": "English, Spanish"
}