{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "MicroGuide 17+",
  "subtitle": "Guidelines App",
  "seller": "Horizon Strategic Partners Ltd",
  "stars": "4.8",
  "rating": "146 Ratings",
  "price": "Free",
  "appDescription": "MicroGuide provides medical organisations, hospitals, Health Boards and NHS Trusts with the ability to collaboratively create, edit, and publish their own local guidance and policies. With guidance downloaded directly to your device, there is no need to worry about internet connectivity in your hospital or organisation. You will always have access to the content you need locally. All content updates are automatic. Once a new version of a guide has been published it is automatically downloaded in the background to your device. Medical calculators and algorithms can be included, allowing you to easily view and inspect calculations in real time. With instant full search capability across entire guide sets, on average guidance is accessed on the App every 8 seconds. The updated MicroGuide app contains the following; - Social login to allow users to carry over their guidelines and policies between devices - An updated layout - Improved search function - Tools section to easily access drugs lists and calculators - Faster downloads and less storage space used - Multiple guideline and policy sets more",
  "reviews": [
    {
      "user": "phjefry",
      "date": "06/27/2019",
      "title": "One of the best Microguide application",
      "review": "Recommend at highest level for medical, nurse, pharmacist, & other health care providers."
    },
    {
      "user": "Jdfnp",
      "date": "08/09/2011",
      "title": "Not impressed",
      "review": "Not impressed. Very limited info and poorly designed."
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "157.9 MB",
  "category": "Medical",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information",
  "languages": ""
}