{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "AllergyEats 4+",
  "subtitle": "Food Allergy Restaurant Guide",
  "seller": "Sirved Mobile Solutions Inc.",
  "stars": "4.5",
  "rating": "500 Ratings",
  "price": "Free",
  "appDescription": "Trusted by food-allergic diners since 2010, AllergyEats is the leading guide to allergy-friendly restaurants in the U.S. Free and easy-to-use, AllergyEats provides valuable peer-based ratings reflecting how well (or poorly) restaurants accommodate food-allergic guests. This sharing of real experiences from other food-allergic diners allows you to quickly and easily find restaurants that have been the most willing and best able to properly address the unique needs of food-allergic guests. • Discover allergy-friendly restaurants at home, on vacation or on the road - anywhere in the U.S. • Customize your search results for major allergens and dietary restrictions • View AllergyEats’ proprietary “allergy-friendliness” restaurant ratings • Read restaurant reviews from other food-allergic diners • Access the menus of over 400,000 restaurants, as well as the allergy menus for some as well • Find places to dine in Disney World parks and hotels on AllergyEats Disney World • Use AllergyEats NYC or AllergyEats DC to locate restaurants near popular landmarks in those cities (with more to come) • Make reservations at over 20,000 U.S. restaurants via one-click OpenTable links • Earn recognition points for rating, sharing, and adding comments Find. Rate. Share. We Are All In This Together! ***Love our free app? Please take a moment to review it in this app store! *** Don’t like it? Contact us at contact@allergyeats.com. *Please note that AllergyEats is a guide, not a guarantee. Restaurant ratings are based on the opinions of food-allergic diners, not allergy experts. Always carry emergency medication and discuss your allergies with restaurant staff in advance. Please see the Dining Tips on the AllergyEats app for more detailed advice. more",
  "reviews": [
    {
      "user": "Goldcakes",
      "date": "07/07/2024",
      "title": "Great app, just needs more of us to write reviews!",
      "review": "I like the app very much. Just wish there were more of us using it, and writing reviews of more restaurants. I do find the app useful when I travel to larger cities, where more people have done reviews. I find we constantly have to educate restaurants, but I appreciate restaurants with staff who are cooperative and willing to ask their chefs, look at labels, and learn. more"
    },
    {
      "user": "Idot123",
      "date": "12/10/2020",
      "title": "Could be better\n\n    Developer Response",
      "review": "The last time I used this app was in 2017. I recently read an email telling me to go back on so I did and I remember now why I stopped using it. It just doesn’t inspire me at all and there are no pictures of restaurants. Also, I mainly logged in to write a review for a restaurant that I’ve been visiting for the last few days. It is a new family operation that just opened their doors this year. I can understand how it’s not on here but there’s no way for me to add it. I think if google maps was integrated into the app somehow like I’ve seen some vegan apps do, it would make it a lot easier to search restaurants that are current. I am kind of disappointed I wasn’t able to leave a review for my favorite healthy sandwich shop and keep Allergy Eats going though. I really do hope the app improves one day because I know it can be the best. I’m looking forward to seeing what’s next. more We're sorry that you had a disappointing experience, and we understand. We're constantly looking for critical feedback and trying to improve the best we can. So thank you.With regards to not being able to rate a restaurant not on the site/app, we do have a link to \"Add a Restaurant\" under the \"more\" tab on the app. Frankly, the turnover in restaurants is always quite high, and much more so during the year of COVID. While we are taking steps to improve the accuracy of our listings going into 2021, we still rely on our community to help us in new and closed restaurants. If you click on Add a Restaurant and send the info to us, we will add it almost immediately to our database and then send you a return email letting you know it's ready for your review. I hope you'll take advantage of this. As you know, AllergyEats relies on user reviews - and finding positive reviews on new restaurants, especially during the pandemic, is even more valuable!With respect to other changes, while we believe in continuous improvement - and continue to practice that day-to-day - as you can imagine, we've been impacted by the pandemic quite dramatically, along with restaurants and travel. That said, we've upgraded our menu displays and look forward to more substantial improvements as people become more comfortable dining out again.Thank you again for your feedback and we'd of course love for you to reconsider your review. While the issues you raise of welcomed and valid, we still think the core of what we provide - thanks to you and all raters - is extremely positive for the food allergy community, in order to find allergy-friendly restaurants wherever they travel. more"
    },
    {
      "user": "Tico3169",
      "date": "11/07/2018",
      "title": "A \"must have\" app for anyone who dines out with food allergies",
      "review": "If you dine out with allergies, AllergyEats has to be in your pocket or purse. This is the only comprehensive guide of restaurants rated on the basis of allergy-friendliness. Ratings are based on the reviews from others in the food allergy community, making this like the Yelp or TripAdvisor for food allergies. See the ratings, read the reviews, check menus, save favorites, reserve through OpenTable, touch for directions or a call - the features are spectacular, especially the ones added in this version. The Disney-specific guide is useful and the new NYC guide is soooo useful! Love the blog stories and critical info, and the annual Top 10 list is always great to see. Overall, so valuable. A \"must-have!\" more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "108.2 MB",
  "category": "Food & Drink",
  "ageRating": "4+",
  "languages": "English"
}