{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Blood Pressure Companion 4+",
  "subtitle": "BP Tracker & Heart Rate Logger",
  "seller": "倩 赵",
  "stars": "4.3",
  "rating": "1.3K Ratings",
  "price": "Free",
  "appDescription": "Blood Pressure Companion is a blood pressure, heart rate and weight tracker. Keeping track of blood pressure is a good habit to keep healthy. High blood pressure (HBP) is one of most common and frequently-occurring diseases; heredity, unbalanced diet, fat, lack of exercise, and drink etc may cause high blood pressure. Using Blood Pressure Companion to track your blood pressure, you can monitor your blood pressure closely and visual by words, chart and histogram. When you find it abnormal, you can take quick actions to find the reason and keep it from growing high. Also you can share measurements conveniently with your doctors by this app. Main features: ⁃ Easily add and edit blood pressure, heart rate, weight and test date. ⁃ Add note to the readings. ⁃ Track systolic, diastolic, heart rate and weight by chart. ⁃ Analyze times and percentage of each blood pressure range. ⁃ Calculate Mean Arterial Pressure (MAP) of each reading. ⁃ Create a reminder for measuring BP, doctor visiting or anything else. ⁃ Show MAX, MIN and AVG number of readings by number and histogram. ⁃ Show statistics of measurement by day, week, month or year. ⁃ Create a reminder to measure your blood pressure, doctor visit or others. ⁃ Save snapshots to Photos. ⁃ Export (Email) readings in format of CSV, HTML or PDF. ⁃ Custom date range of readings to be exported. ⁃ Migrate Data to full version. ⁃ Custom your own color range. ⁃ Passcode function to protect your info. ⁃ Supports Touch ID as passcode. ⁃ Support lbs and kgs. ⁃ Clean and humanized interface. ⁃ Supports printing data in app. ⁃ Supports transferring data to Health app. ⁃ Support WiFi backup and restore. ⁃ Supports Dropbox backup and restore. ⁃ Supports 3D Touch function. ⁃ Supports Apple Watch version. If you have any questions or suggestion, please kindly mail to maxwellapp@tom.com. more",
  "reviews": [
    {
      "user": "stcbmhz",
      "date": "10/04/2018",
      "title": "Free Simple program to monitor BP",
      "review": "The free version is great. Allows you to create and print a spreadsheet of readings with 5 or 6 columns of info such as date, pulse, MAP, notes, weight, systolic and diastolic readings. You can write notes for each reading such as: took meds, did not take meds, or a highly stressful day. Can setup to automatically sync info to Health app. The MAP reading is especially helpful in giving an assessment of your arteries blood flow to major organs such as kidneys and brain. I have read that Doctors usually consider anything between 70 and 100 mmHg to be normal. All in all this a free app, which you can upgrade, that gives you basic useful information. more"
    },
    {
      "user": "BTXGal",
      "date": "12/11/2017",
      "title": "Invaluable",
      "review": "App helps me maintain a diary of my BP & MAP (mean arterial pressure) w/ability to make notes on the present variables at the moment from exertion to medications to symptoms like chest pain. It automatically moves a copy of the results to a health app. Also I can look at weekly, monthly & annual trends. Highlighted results when my dbp (diastolic) or sbp (systolic) aren't in target range allows me to see quickly those variations which could signal a need for further attention or evaluation. So easy to add the data. Scroll to numbers rather than type in, weight can be adjusted anytime & notes can be added each reading. (Used to be an app whereby I could hold my iPhone to my chest for BP. Found it reliably close yo a BP machine. I deleted it only bc it wasn’t updated to current iPhone IOS. Miss that portable BP “cuff”.) Glad to use this app. Recommend for those wishing to maintain feedback for themselves OR their doctor bc info can be exported to another source for review. I don’t need that right now but I will have the baseline data when the time comes. Worthwhile! more"
    },
    {
      "user": "OmTattoo",
      "date": "05/04/2019",
      "title": "Simple, easy and exactly what’s needed",
      "review": "I needed something to simply and easily track my BP and weight as directed by my doctor. I bought another app for$5 that had all the bells and whistles, along with a complicated setup and that just wasn’t it. I take my BP three times a day and weight myself in the morning, hit the plus button, adjust the dial to my numbers and hit save. The big bonus is it will email me and my doctor a PDF with easy to understand numbers and a few graphs. This is the free version and not once have I got a pop-up asking I get the full version- if all you need is to track your BP and weight it doesn’t get better than this. With a two minute learning curve! Easy - Simple! And easy five stars- more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Watch",
    "Apple Vision"
  ],
  "size": "42.2 MB",
  "category": "Medical",
  "ageRating": "4+",
  "languages": "English, Arabic, Czech, Dutch, French, German, Hindi, Indonesian, Italian, Japanese, Korean, Malay, Polish, Portuguese, Russian, Simplified Chinese, Spanish, Thai, Traditional Chinese, Turkish"
}