{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "HealthTap Primary Care Doctors 17+",
  "subtitle": "Online Doctor & Primary Care",
  "seller": "HealthTap",
  "stars": "4.7",
  "rating": "4.2K Ratings",
  "price": "Free",
  "appDescription": "HealthTap is a telehealth app where you choose & keep one primary care doctor you love to get ongoing care — affordably with or without great insurance or benefits! Get personalized, quality medical advice without an expensive and inconvenient trip to a doctor’s office. Meet with your favorite new doctor regularly for health checkups, prescriptions, lab tests & results, treatment plans and referrals to specialists. Our amazing doctors seek to build long-term, trusted relationships with their patients to take care of Americans' ongoing health needs. Our top U.S. board-certified doctors are available for virtual visits 7 days per week in all 50 U.S. states. ~~~ SUBSCRIPTION BENEFITS ~~~ Subscribe for $15/month* (billed twelve months at a time) to save hundreds of dollars & countless hours each year with: • Same day or week video appointments with your doctor — $44/visit or less** • Free texting with your doctor for follow-ups and clarifications • Speak with the first available doctor during nights, weekends, holidays, or while traveling out of state for urgent care — $59/visit or less** • Get prescriptions, lab tests ordered, referrals to specialists, and even doctor’s notes for school or work • Save up to 75% on prescriptions with coupons for local pharmacies • Set up profiles for your children at no additional cost We accept hundreds of insurance plans and even HSA/FSA cards. * Subscription may be covered by select insurance plans ** Insurance coverage may reduce your out-of-pocket cost ~~~ AVAILABLE WITHOUT SUBSCRIPTION ~~~ $129 Urgent Care Video Visits — talk with the first available doctor within minutes (7 days per week) over video or text for advice, prescriptions, test orders, and referrals. Just $129 per visit (retail price) or your insurance copay. FREE Educational Doctor Answers — Get educational text answers to your health questions from a network of over 90,000 U.S. doctors across 147 specialties volunteering their time to help millions like you for FREE! Search millions of answers or post your own and get responses from real doctors within hours. ~~~ WHAT WE TREAT ~~~ We can help with a broad range of medical issues, including the following examples: MANAGING YOUR CONDITION High blood pressure, diabetes, asthma, allergies, high cholesterol, arthritis, thyroid disorders WOMEN’S HEALTH UTI, birth control, menopause, period problems, yeast infections, skin and hair care CHILDREN’S HEALTH (ages 2+) Cold & flu symptoms, diarrhea or constipation, skin rashes, allergies MEN’S HEALTH STI symptoms, erection issues, bladder or bowel issues, skin and hair care SENIOR HEALTH (ages 65+) Muscle or joint pain, medication management, preventive health screenings WELLNESS & PREVENTION Weight counseling, skin and hair care, supplements, health screenings, stress reduction SEXUAL HEALTH STI prevention or testing, erectile dysfunction, birth control counseling MENTAL & BEHAVIORAL HEALTH Anxiety, depression, sleep issues, school or work stress, alcohol abuse, smoking cessation …and much more! ~~~ SEE WHAT MEMBERS ARE SAYING ~~~ “Great prices, very friendly doctor, very convenient, and I was able to get a same or next-day appointment and prescriptions that I needed.” – Joe C “Super quick and efficient. Doctor was very personable and made me feel comfortable through the telehealth visit. She explained everything and made sure I understood.” – Katlyn A “When I moved I lost my medical insurance. I found HealthTap and it was a lifesaver. I have told many people about it.” – Steven B “My doctor is extremely accommodating. She has multiple appointment times open throughout the weekend. She is never in a hurry and very thorough. HealthTap is a wonderful service!” – Diana C ~~~ 100% SECURE & CONFIDENTIAL: We take your privacy very seriously. Your visit with the doctor is confidential and HIPAA compliant. QUESTIONS? You’re always welcome to contact us at support@healthtap.com for responsive and helpful support. more",
  "reviews": [
    {
      "user": "brina.124",
      "date": "08/16/2019",
      "title": "Awesome!!!!\n\n    Developer Response",
      "review": "First time using it & I am so glad I tried it. I was skeptical at first & afraid it’d be a waste of money, but it IS real y’all. A bit pricey (not going to be a $20 copay like a regular ol doctor visit) but it is SOOO worth it. Literally you can talk to a doctor either through video chat, phone, or text. I’m very anti social lol so I was so glad to just be able to text back and forth right away. No getting dressed, driving to the doctors office, waiting to be seen, etc. it’s literally right on your phone. For mild illnesses where you pretty much know what’s wrong & what you need but can’t get because it’s prescription only, this is great. I already knew what was going on with me & needed diflucan because OTC treatments don’t work for me. Told the doc my symptoms, he asked some questions, etc. and within about 5 minutes he sent a script over for diflucan to the pharmacy that I use & boom I picked it up an hour later. Love it. So much better than waiting a week just to get an appointment for my doctor, dragging myself there when I’m already miserable from whatever I got going on, & then waiting to be seen. more Hi there brina.124! Thank you for taking the time to leave us a review, we really appreciate it. We're so happy to hear that you found connecting with a doctor through HealthTap both convenient and enjoyable. We're so glad you were able to quickly get the care you need! We look forward to continuing to serve all your healthcare needs in the future. Hannah, Community Care Team more"
    },
    {
      "user": "miss flack <3",
      "date": "08/08/2020",
      "title": "I absolutely ADORE this app!\n\n    Developer Response",
      "review": "I don’t write reviews a lot, so you know it’s serious when i do. I am a HUGE hypochondriac and often have questions about things when it’s really inconvenient or when I don’t have access to a doctor (or sometimes, I just don’t wanna spend the money to go to the doctor if it’s something simple). I really wanted to find an app where I could text a medical professional rather than just be limited to video chat, since sometimes I just have a quick question at an inconvenient time (and google is NOT a good resource. ). I didn’t have high hopes, but tonight I was freaking out about something in the middle of the night and was able to chat with a doctor. Dr. Pavel Conovalciuc was AWESOME at dealing with my paranoia, answered everything quickly and efficiently, and had excellent bedside manner. If you’re a hypochondriac like me and don’t have the time or money to CONSTANTLY go to the doctor for every little thing, this is fantastic. more Hello miss flack 3! We’re happy that you’re enjoying HealthTap! We value member feedback and are grateful that you took the time to share yours. Feel free to visit us on Facebook, Instagram, Twitter, etc. if you’d like to see what we’re up to. Take care! Jakarra and the HealthTap Team more"
    },
    {
      "user": "D. Hill",
      "date": "10/18/2019",
      "title": "Healthtap",
      "review": "As a former user of the service and now coming back to the app I can better recommend Healthtap based on how I think the information is better tailored to help users with their individual lives and the goals they have. This starts with the app as I think the redesign from previous versions is a step up. Just the change of the logo and application color from red to blue brings a more tranquil experience to the user experience. The app is easy to navigate and searching for what you may want is less cumbersome. It is still easy to post a question for a physician to answer in case that is all you are interested in. For those who want more a big addition is the care guides which are guidelines set by a physician to reach a lifestyle goal whether it is to be healthy, get flat abs, care for your child, etc. The guides are easy to follow allowing users to enroll at the tap of a button. The app still makes it easy to centralize all of your health data but for those like myself who prefer to use another platform for this task, such as Apple Health, That data to can be incorporated. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad"
  ],
  "size": "108.8 MB",
  "category": "Medical",
  "ageRating": "17+\n                Infrequent/Mild Sexual Content and Nudity\n                Infrequent/Mild Alcohol, Tobacco, or Drug Use or References\n                Infrequent/Mild Mature/Suggestive Themes\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English, Spanish"
}