{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Symple Symptom Tracker 12+",
  "subtitle": "a BEAUTIFUL health diary!",
  "seller": "Symple Health, Inc.",
  "stars": "4.5",
  "rating": "473 Ratings",
  "price": "Free",
  "appDescription": "Symple® is the easiest way to track how you feel, to monitor your health, and to improve your wellbeing. Designed by both clinicians and regular people, Symple® is an enjoyable way to connect to better health. ______________________________________ \"True to its name, Symple is a simple app with an elegant interface.\" - Men's Health \"The beauty behind Symple is the quick data capture and the ability to track your symptoms in your words, not just by a score.\" - Macworld \"This is so brilliant...This is the kind of data that your doctor can never get from you.\" - Fox and Friends \"If you’re experiencing symptoms but don’t know why, try the Symple solution.\" - Healthline Best Healthy Lifestyle iPhone Apps of 2016, 2017, 2018, 2019 ______________________________________ FREE VERSION: • Track up to 5 symptoms in just seconds per day. • Track up to 5 factors that influence how you feel. • Import steps, sleep, dietary calories & heart rate data from Apple's Health App directly into factors. • Fitness for all! For those on wheels, track wheelchair pushes via Apple Health. • Create custom symptoms & factors or choose from our sample list. • Add one daily photo (or up to 10 with upgrade). • Share an **overview** of your symptom history with your doctor. • Export data to your favorite spreadsheet app. ______________________________________ UPGRADE to SympleComplete for these fine features: 1. enrich your data with time-stamped, daily journal entries 2. track unlimited, custom symptoms 3. track unlimited, custom factors 4. view longer graphing intervals 5. secure your data with passcode protection 6. snap up to 10 photos per day (perfect for recording medications or food intake!) 7. automatically save a backup/restore file to iCloud and never lose your data again. ______________________________________ Like a thermometer in your medicine cabinet, Symple captures important information about your health. There when you need it, and out of the way when you don't, Symple makes remembering and reporting symptoms, well, simple. ______________________________________ FIVE STARS \"This app belongs in a class of a select very few...that are at once well conceived, well crafted and aesthetically beautiful. After 2 years of constant use, through 2 brain operations, it is like an old friend to me.\" FIVE STARS \"My shoulder pain kept coming and going, but I didn't know why. Tracking it with Symple helped me figure it out.\" FIVE STARS \"Remembering what happens between office visits is a breeze. And I love the Doctor's Report. Yay!\" FIVE STARS \"Symple offers my patients a better way to report their symptoms, which lets us be more collaborative. Good work!\" ______________________________________ BUILT WITH BOTH THE PATIENT AND CLINICIAN IN MIND. Please keep sharing feature requests, questions & advice. We can't get better without you. support@sympleapp.com more",
  "reviews": [
    {
      "user": "Luchel17",
      "date": "08/07/2019",
      "title": "Easy to Use\n\n    Developer Response",
      "review": "I have tried a few symptom tracking apps and this is my favorite. The others I didn’t use for long before giving up due to interface issues and/or the program not tracking the information in a way that was useful to me. Th is app allows you to open up the day and quickly record various symptoms and severity level. You can also customize your personal symptom menu by adding /removing symptoms. You can even create your own symptoms if the app doesn’t already have it. I purchased the full version and IMO it has been well worth it. Once you pay, that’s it there are no additional hidden fees like some apps. There is also a physician report that allows you to create a pdf file of your symptoms- you specify the date range to include. It’s been extremely helpful to tracck my symptoms and daily journal entries so when I meet with my doctor I have a solid and detailed record of history to share. more Oh thank you so much for sharing the kind words! I truly appreciate it ☺️🙏🏼 more"
    },
    {
      "user": "Mohawke",
      "date": "01/20/2023",
      "title": "Best pain and mood tracker in the store.",
      "review": "Don’t bother looking elsewhere unless told by your doc. This app allows you to log and even create new pain and mood types, rate those by severity, and keep notes. No cutesy crap, no cartoon animals just a solid tool that you can customize and track mood and pain issues. You could likely use this to track other things. It even pulls data from Health. The only thing that could make it better is if it had a feature to add meds taken that also logs them to Apple Health, or at least pull in meds from Apple Health for the day you log symptoms. Either way, you guys saved me from writing my own app! Although, I’m still considering doing one in Gtk on Linux. Thanks for this! more"
    },
    {
      "user": "Alley660",
      "date": "06/11/2020",
      "title": "Tracks but data without correlation is useless",
      "review": "This app does track symptoms but if you are tracking a lot a symptoms it is pretty much useless. There are no analytics at all aside from the “doctor” report. That report only offers a color coded intensity - does not even include the average number for a more precise information. Also does not provide the most basic of analytics or insights like “on days you woke up without an alarm these symptoms were less”. You can compare symptom by symptom but only two at a time and only one day. Factors is also useless as it does not interact with the symptoms data at all, it might as well be part of the journal. When I messaged to ask about this they stated we don’t get into analyzing because it could be diagnosis. If you don’t offer diagnosis (an actual condition) and slap on the same warning like every other health app does then you aren’t diagnosing anything. It seems like an easy way to not do the work of actually processing the data in a meaningful way. This was a huge disappointment and I regret paying for this app and would like my money back. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "9.3 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English"
}