{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "GoodRx: Prescription Coupons 12+",
  "subtitle": "Medication Tracker & Reminder",
  "seller": "GoodRx",
  "stars": "4.8",
  "rating": "660.1K Ratings",
  "price": "Free",
  "appDescription": "GoodRx is your solution to convenient and affordable medications. Find discounts up to 80% on prescriptions and save money on what matters. The affordable health care and medication app – that’s GoodRx. Save money on meds with a free prescription discount finder and care for yourself without breaking the bank. Our mobile health care platform helps millions of Americans affordably get medicine, prescription drugs, pet meds, senior care and more. Get the best price on meds with medicine discount choices and coupons for seniors. Find prescription savings for medications & drugs with our Rx app for healthy living well under the average medication price. GoodRx is the perfect prescription discount finder for all your meds and health care needs. Discover medicine discount options with GoodRx's digital coupons. GoodRx contains everything from prescription rewards to telehealth services for a complete mobile health tool and Rx savings solutions. GoodRx even includes a drug guide & price tracker to monitor your meds. Save money on the medication app that’s more than a coupon finder. Monitor prescription status with a pill reminder and medicine tracker, check prices, & get convenient prescription savings with mobile coupons. Download GoodRx today to find savings on your medication and become your own health advocate! GoodRx Features: Get Digital Coupons at Over 70,000 Locations - CVS Pharmacy - Walmart Pharmacy - HEB Pharmacy - Walgreens Pharmacy - Rite Aid Pharmacy - Target Pharmacy - Safeway Pharmacy - Vons Pharmacy - Kroger Pharmacy - & more! Medication App With Up To 80% Off Prescription Drugs - Mobile Rx savings solutions: Rx saver, medicine discount & free coupons app - Check Rx pharmacy prices & redeem mobile coupons with a prescription discount finder - Convenient Rx mobile app with prescription savings through free coupons - Coupons for pet meds cover your furry friend - Visit your local pharmacy and use digital coupons easily - A complete mobile health & coupons app with manufacturer discounts, patient assistance programs & more - Save money on medications at your preferred pharmacy & Rx discount location Prescription Reminder & Medication Tracker - Free medication reminder: Refill your prescriptions with pill reminder alerts - Medicine tracker: Manage medications with a drug guide & prescription list - Medication log: Track everything from birth control prescriptions to medications Complete Health Care Tool - Get affordable urgent care with online medical professionals - Find a doctor with no Medicare or insurance needed - Get telehealth support to understand your meds and prescription list - Med delivery & pickup available from anywhere - Medication list with a drug guide to help understand your prescriptions GoodRx Care services include - Urinary Tract Infection (UTI) treatment - Erectile Dysfunction (ED) - Start & refill birth control - Short term medication refill - & more! Prescription Discount App Trusted by Millions - Digital coupons made easy for every mobile health consumer - Our medication coupons app shows which Rx pharmacy has the best price on drugs or even free - Prescription discount finder used by doctors & clinics to help patients save money - Featured by: The New York Times, PBS, ABC News, Forbes, CNN, Good Morning America, The LA Times & more! Upgrade to GoodRx Gold for even more benefits, medication rewards and prescription discount offers. Get exclusive pricing and reliable mobile health care with GoodRx Gold. By downloading GoodRx, you agree to be bound by our Terms Of Use. Read more at http://www.goodrx.com/terms-of-use Please visit https://www.goodrx.com/consumer-health-data-privacy-notice to read our Consumer Health Data Privacy Notice for additional information about our handling of consumer health data. *GoodRx works to make its apps accessible to all, including those with disabilities. If you are having difficulty accessing this application, please call or email us at (855) 268-2822 or ada@goodrx.com so that we can provide you with the services you require through alternative means more",
  "reviews": [
    {
      "user": "antbelicheck",
      "date": "01/23/2021",
      "title": "Good RX is a lifesaver",
      "review": "I am in recovery for a bad opiate problem I had. I have been clean and sober for going on 2 1/2 years I am very proud of myself for that it was extremely difficult. But the only reason I was able to do it is because of the treatment that I received from my doctor. I guess he is a psychiatrist and a treatment specialist. The meds that I have been taking I want gave me the ability to stop relying on the opiates. But my insurance was just recently canceled because I haven’t been able to work due to the coronavirus pandemic and my prescriptions were going to cost me about $350 a month on top of paying for my doctor visit every month I wouldn’t be able to afford that because of this pandemic. Fortunately somebody recommended good RX to me and it saved me $200 on my monthly meds. If it wasn’t for that I am afraid of what would happen to me if I did not have these meds. If it wasn’t for GoodRx I don’t know if I would be able to continue on the path that I am on which is the one I want to stay on if you need some help getting your prescriptions I recommend good RX to you. It is extremely valuable and will save you a lot of money. Good luck to you all and thanks to the makers of good RX if it wasn’t for you I don’t know where I’d be thank you more"
    },
    {
      "user": "Sheila H-R",
      "date": "10/06/2021",
      "title": "Fantastic Savings Program and App!!!",
      "review": "I have been purchasing prescriptions (and some OTC drugs, which require a prescription) through Good Rx Gold and Good Rx Coupons, for about 6 or 7 months. I purchased the “Individual” plan, and I consider it as the best $5.99 per month that I have ever spent. To be clear, I have saved over $1300 in drug costs, since I began my subscription. To say that I am “Blown Away” would be putting it mildly!!! The one drawback is that one may have to use several different pharmacies to purchase his/her medications. This is because the drugs have different costs at different pharmacies. HOWEVER, with the amazing app and by inputting the formulary, one knows the cost of the drug (or an excellent approximation), prior to making the purchase. This may be a little inconvenient for the doctor, because to order a prescription electronically, they would first have to share their purchase plan with the patient (so that the patient can determine where would be the best price). However, I have yet to have a doctor to complain about having to do this, because I think that they know how much savings are realized by their patients. BRAVO, GOOD RX and GOOD RX GOLD!!! more"
    },
    {
      "user": "Full-Time-Travelers",
      "date": "07/12/2021",
      "title": "What a workout to save money\n\n    Developer Response",
      "review": "GoodRx advertises savings on drugs not covered by insurance and their pricing is lower than the cost of the drug to the pharmacy. One has to ask why would a pharmacy sign up to lose money. Big Y Foods pharmacy answer I found out was that they did not sign up with GoodRx. CVS answer was we will not honor the GoodRx price but they referred me to Walgreen who would honor the price but first needed the prescription to verify the price. They tried to have the prescription transferred from a Walmart pharmacy and had a problem but never contacted me. I called and they explained why they did not have the prescription. I told them how to fix the issue and reminded them not to order the prescription until they quoted me a price. I stopped by Walgreen’s pharmacy a few days later and found they ordered me the name brand drug for $1,000. GoodRx quotes Walgreens’ at $177. I declined the name brand drug and they then ordered the generic. While I was there I had the store clerk quickly verify the GoodRx price and he placed the order for the next day. I am puzzled why they couldn’t verify the price of the generic over the phone initially? But perseverance of multiple phone calls, confusion about prescription transfer, filling a prescription incorrectly but the end result was I saved $473. GoodRx is not easy but if you have the time and energy for quite a run around you too can save money with GoodRx. more Hi there, we're sorry to hear about the issue you've experienced at the pharmacy. If have a similar experience in the future, please fill out this secure form if your prescription is on file at the pharmacy so that we can look into this for you immediately: https://bit.ly/3qN92AQ more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad"
  ],
  "size": "120.9 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English"
}