{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Critical- Medical Guide 17+",
  "subtitle": "",
  "seller": "The Barringer Group, LLC",
  "stars": "4.8",
  "rating": "943 Ratings",
  "price": "$14.99",
  "appDescription": "We heard you loud and clear, so we've added a brand new tab called \"Favorites.\" Now there's even more ways for our users to find their favorite screen! Critical is a best-selling critical care reference app out there! It is comprehensive, robust, and sleek—making it the perfect tool for nurses, paramedics, physicians, and other healthcare professionals. With all the fantastic feedback we've gotten, the app keeps getting better and better! Features Include: Images, ultrasound, diagrams, language audio, and interactive videos in high-definition to teach what to look for in real life. Detailed medical guidelines, including: • Ultrasound • Vads • Critical Care & Course of Action • Emergency Medicine • Interactive EKGs • Medical Spanish with Audio • Formulary & Med Interaction • Pediatric Advanced Life Support • Ventilator Management • Special Procedures, such as Ultrasound, CTs and X-rays • Monitoring Information - 12 Lead Electrocardiograms & IABPs • Advanced Cardiac Life Support (ACLS) • Videos & Imagery to Assist in Critical Care, and much more. Many people working in the Critical Care profession, whether you're a physician, nurse, paramedic, EMT, etc., use Critical Medical Guide as their go-to reference. Many aspects of the job are covered in it. So you won't be at a loss if a query arises about how to analyze complex ABGs, correctly without just guessing. You can reference our complex ABG analyzer. Get Critical - A Critical Care, EKG, Drug, ACLS Medical Guide Today! more",
  "reviews": [
    {
      "user": "Sflohre",
      "date": "02/22/2023",
      "title": "Best emergency medicine app on the market\n\n    Developer Response",
      "review": "I’ve had this app for years and use it often. From when I was flying, to my ER and ICU time and now in the cath lab. It’s a straight forward reference that has the info you want and quickly accessible without having to search through the app to find it. Visually it is easy to read and pick out what you need. Absolutely perfect app for emergency and ICU reference. It’s so smooth you can pull it up quickly in real time to if you just want to verify what you’re working on. Thank you so much for making this app and making it the way it should be. Keep up the amazing work. more Thank you for taking the time to write a review about the app! We are thrilled to hear that you have found it helpful throughout your medical career, from your time in the air to your work in the ER, ICU, and cath lab. We designed the app to be a straightforward reference tool, with quick access to the information you need. We understand that time is of the essence in emergency situations, so we're glad to hear that the app is easy to read and visually accessible. Thanks for your kind words and encouragement. We're committed to continuing to make the app the best it can be and to providing you with the information you need to deliver the best care possible. more"
    },
    {
      "user": "MedicRayRay",
      "date": "03/07/2021",
      "title": "Must have tool.\n\n    Developer Response",
      "review": "I’ve been a full-time emt/Paramedic and a busy 911 system since 1995, and this app is one of my most used references in my pocket on duty and off. It always felt like most pocket guides from back in the day were geared more towards nursing and this app has everything an EMT/paramedic can use and reference as well as great nursing references and EMS type references. I would definitely recommend this app to anyone involved and emergency medical services whether you are with the ambulance company, fire department, emergency room, etc... you won’t be disappointed for the purchase. more “We are so grateful for your kind words. Thanks for sharing your review with us and the community.” more"
    },
    {
      "user": "Aircavmedic",
      "date": "07/13/2024",
      "title": "Outstanding\n\n    Developer Response",
      "review": "I just got this. I wish I had access to this when I was working, retired RN( active license) still like many, love to keep current. Having done so much in a long career ( like my wife) I was a Nurse before men were in the field. This has pharmacy information ( was at UConn in pharmacy school) before I dropped my 1-A, with a low draft number. Medic, changed after to Nursing with my wife. This has a wealth of information. OB-GYN( first male RN) early, decelerations) Point is I’ve never seen so much in one spot except PDR, or Taber’s. more Thank you so much for your heartfelt review. We’re genuinely thrilled to hear that you’ve found so much value in our app. Your career journey is truly inspiring, and it’s an honor to know that our app resonates with someone who has contributed so much to healthcare over the years. We’re especially touched by your kind words about the breadth of information we offer. Our team has worked hard to create a comprehensive resource, and it’s fantastic to hear that it stands alongside trusted names like PDR and Taber’s. If there’s anything else you need or any suggestions you have, please don’t hesitate to reach out. We’re always here to support healthcare professionals like you. You’re the ones that make us who we are. Thanks again for your support and encouragement! The Critical Med Team more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "378.4 MB",
  "category": "Medical",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English"
}