{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Pregnancy + | Tracker App 12+",
  "subtitle": "Pregnant? Join over 65m moms!",
  "seller": "Philips Digital UK Limited",
  "stars": "4.8",
  "rating": "65.4K Ratings",
  "price": "Free",
  "appDescription": "Download the world's leading pregnancy tracker app today, for free week-by-week pregnancy information and articles! The Pregnancy+ app features expert advice, daily articles, healthcare tips and interactive 3D models so you can track your baby's development. Our pregnancy app has been downloaded over 65 million times by expecting families. Join our worldwide community today! Baby Development ► Unique, interactive 3D models showing your baby's development ► Baby Size Guide helps you visualize your baby's size in fruits, animals & sweets ► Pregnancy Week-by-Week Guides explain what to expect in each pregnancy week ► Simple & informative Pregnancy Timeline highlighting important milestones Pregnancy Guides & Information ► In-depth Pregnancy Guides covering breastfeeding, exercise, food, twins & more ► Daily Pregnancy Articles, tailored to your pregnancy stage ► 2D & 3D Scans by pregnancy week for you to browse ► Daily Blog Posts with tips, tricks & helpful advice ► Upload photos in My Bump to create a visual pregnancy diary Pregnancy Tools ► Pregnancy Due Date Calculator helps you work out when your bundle will arrive ► Kick Counter tracks your baby's movements & activity ► Pregnancy Weight Log helps you keep an eye on changes in your weight ► Contraction Timer measures contractions throughout your labor Organize & Plan ► Pregnancy Calendar enables you to plan & document your prenatal appointments ► Hospital Bag helps you prepare your hospital visit, for Mother, Birth Partner & Baby ► Birth Plan allows you to customize, organize & export your needs & wishes ► To-Do List & Baby Shopping List for ideas of what you need to do & buy ► Search thousands of Baby Names for inspiration & share your favorites Our EXCLUSIVE 3D Models Enjoy our unique 3D models showing your pregnancy's week-by-week development, from blastocyst to fetus to baby. Our 3D models truly help you to connect with the baby growing inside you. ► Choose from multiple ethnicities ► Zoom in or out & rotate to see the baby's intricate detail ► Watch guided pregnancy week-by-week walk-throughs ► Tap to see baby movements Pregnancy Articles & Guides If you're feeling overwhelmed by all the advice out there, don't worry. Our Pregnancy + tracker app will guide you through your pregnancy, week-by-week, keeping you up to date with your baby's development and helping you stay healthy through pregnancy and beyond. The Pregnancy+ app content is written in-house, with the help of medical experts, lactation consultants, midwives and, of course, parents. Share your journey with friends & family Our pregnancy tracker app can be personalized so your partner, future grandparents or best friend can join in the fun and follow your baby's development in the womb, from bump to birth! Keep everyone up to date with your pregnancy by inviting them to download the app today. Follow us on Social Media Facebook: facebook.com/PregnancyPlusApp Instagram: @PregnancyPlus_App Twitter: @Pregnancy_App Pinterest: pinterest.com/PregnancyPlusApp ◆ Download Pregnancy+ App today ◆ Privacy Policy https://info.philips-digital.com/PrivacyNotice?locale=en&country=US Terms of Use https://info.philips-digital.com/TermsOfUse?locale=en&country=US Pregnancy+ syncs with Apple’s Health App, but cannot read from or write to the Health App Database unless you grant access. This app is not intended for medical use, or to replace the advice of a trained medical doctor. Philips Consumer Lifestyle B.V. disclaims any liability for the decisions you make based on this information, which is provided to you on a general information basis only and not as a substitute for personalized medical advice. If you have any concerns about your pregnancy, consult with your doctor or midwife. The Pregnancy + tracker app wishes you a healthy, full-term pregnancy and a safe delivery. more",
  "reviews": [
    {
      "user": "Alice tendra",
      "date": "11/02/2023",
      "title": "How I got pregnent",
      "review": "This is how I got pregnent btw my name is Alice and I’m about 36 months pregnent any way I was surfing with my friends and I felt nauseous so I told my friends and we went to the concert anti tsunami barrier to I can (clears throat) puke but I never did I asked if I could be pregnent Nevis I am married and we went to get the most accurate pregnancy test there is it was a 2 pack so there’s a backup in case the first one is defective but the plus means it’s a positive pregnancy and minuse means it’s negative pregnancy and I tested (clears throat) u know on the stick like any other and waited and SUPRISingly as my husbands is saying IS WISH CAME TRUE I was pregnent and about 7 weeks later I was showing signs of a developing embryo first of the most noticeable the bump that every pregnent mother has and it turned out IM GONNA HAVE TWINS twin girls and we’re gonna name them Emma and Amy and yeah and this app has been with me ever since I tested positive I keep track on my two little future kids in my belly with this handy dandy app thank u for helping me and my husband get thro this bye😊 oh wait check out my new shop I’m opening and my babies are gonna learn all they need to know about cars and stuff (with Jason as there guide) Jason is my husband the shop it the super shop in oaklahomah on the north end of oaklahomah more"
    },
    {
      "user": "Gabs.Blake",
      "date": "12/24/2023",
      "title": "Absolutely LOVE this app\n\n    Developer Response",
      "review": "I love this app!! It's so helpful and free!! Every week there is an update on what's developing and going on with your baby and their body, what is going on with your body, tips & health advice, several articles and videos you can unlock either buying premium or through watching enough ads to unlock them about pregnancy workouts (midwife advice, classes, etc), pregnancy tools (i.e. size comparison of your baby, bumps pics storage for each month, a place to keep track of appointments, etc) as well as some pregnancy tools you have to unlock through premium via the previously mentioned ways such as: a birth plan, kick counter, contraction counter, hospital bag (each thing coming with a list of suggested items you might not have thought of). LITERALLY THE BEST FREAKING APP for your pregnancy journey, it has been a god sent for me!! more Hi there! Thank you for your kind words and for the 5-star review. We are delighted to hear that you like our app so much. We are working hard to make the best pregnancy App and it's lovely to see that you have enjoyed the Pregnancy+ experience. Wishing you all the best in your pregnancy and parenting journey. more"
    },
    {
      "user": "nayxwasxhere",
      "date": "12/22/2020",
      "title": "I paid for the premium but it’s saying I didn’t.\n\n    Developer Response",
      "review": "So I originally got this app with my 1st pregnancy, but I didn’t pay for the premium because at the time I thought it was bonkers to pay $4.99 for a pregnancy app when all the other pregnancy apps are free. I decided to purchase the app with my current pregnancy back when so found out I was pregnant in August 2020. I KNOW I paid for the app because I would not have been able to use a majority of the features however.... when I decided that I wanted to make a birth plan and use the app to do it, it says I have to purchase the premium for $1.99 which I couldn’t understand because I paid $4.99 for premium. Every once in a while I’ll have apps that do this so I’ll just tap “restore” and it restores my purchase and everything is fine. NOT WITH THIS APP. I tapped “restore” and a message pops up that says “Alert: You have not purchased the app.” YES I HAVE PURCHASED THE APP. This leads me to think that even though you have to pay $4.99 for the premium, there is also an additional $1.99 charge for the premium that they have snuck in making this app actually $6.98. Phillips what are you doing???? more Sorry to hear you are having problems with restoring your purchase. Please select the Feedback button in the More section of the App to reach our customer service team. They can help you get this sorted! We appreciate your patience. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch"
  ],
  "size": "207.9 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Sexual Content and Nudity\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English, Arabic, Czech, Danish, Dutch, Finnish, French, German, Indonesian, Italian, Japanese, Korean, Norwegian Bokmål, Polish, Portuguese, Romanian, Russian, Spanish, Swedish, Turkish"
}