{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Touch Surgery: Surgical Videos 12+",
  "subtitle": "Surgical Training Simulator",
  "seller": "Digital Surgery Ltd",
  "stars": "4.8",
  "rating": "6.6K Ratings",
  "price": "Free",
  "appDescription": "Prepare for surgical cases or learn new procedures & test your knowledge with Touch Surgery anytime, anywhere. Our multi-award winning surgical training platform for doctors and surgeons has been researched by world leading institutions and published in peer reviewed journals. Touch Surgery is integrated into over 100 residency programs in the US and is endorsed by the AO foundation, American Association for Surgery of the Hand (AASH), British Association of Plastic, Reconstructive and Aesthetic Surgeons (BAPRAS) and The Royal College of Surgeons of Edinburgh. FEATURES: - Step by step simulations of surgical procedures - Prepare for procedures anytime, anywhere! - Explore our entire library straight to your smartphone - Experience surgical cases with state-of-the-art 3D graphics - Master new techniques from top physicians - Free to download and use, with over 150 free procedures to choose from. Purchasable procedures are also available WHAT OUR USERS ARE SAYING: “Great app for learning! Easy to use and realistic simulations!” “Brilliant Amazing and informative app. Easy to sign up and get stuck into the modules.” “I really like this app! I like how realistic it is and just how real it is.” “A 5 star rating is not enough” “This app is a life saver!” “is indisputably the BEST app of its kind!!!” WHY DOWNLOAD: This innovative app provides a user-friendly platform that helps medical professionals from all backgrounds train effectively for procedures. The 3D simulations and surgical content have been developed in collaboration with leading surgeons and academic institutions worldwide to ensure the utmost accuracy and validity. The platform is the largest and fastest growing community of surgeons learning and rehearsing operations digitally. The interactive simulations and virtual patients teach specific techniques for all phases of medical and surgical procedures. This practical approach helps improve engagement for a deeper level of understanding, and has been proven to yield better results than more traditional methods. Physicians, nurses and healthcare professionals can train and test their knowledge of surgery with clear and informative content at every step of a procedure. They can master specific exercises or freshen up on their skills before an operation. With the largest database of over 150+ simulations across multiple surgical specialties, including Orthopedics, Ophthalmology, Plastic, Neurosurgery, Oral, Vascular and many more, this mobile app is the most comprehensive tool for medical professionals. Considered as hosting “the best surgical simulations” by TopOrthoApps and “an integral tool for surgeons across the world to learn, and rehearse operations” by MedGadget. Featured in BBC News, TechCrunch, Mashable, T3 Wired, Bloomberg, The Guardian, FT, Breast Cancer Care, Tech City, TecMundo. more",
  "reviews": [
    {
      "user": "P1k4chu12",
      "date": "02/20/2019",
      "title": "Best Surgical Simulation App out there!",
      "review": "I really love this app! I’ve been looking for an app that goes over surgical procedures and lets you do some stuff during the surgery. I specifically like neurosurgery and I’m glad that this app has a lot of procedures for it. There’s so much to choose from such as cardiothoracic and general surgery. What I also like about this app is how realistic the videos are and how there is a learning process and a test to see what you remember as you perform the surgery. I like how it goes over medical terms as you go through the surgical procedures step by step because it broadens your knowledge of Anatomy terms. I’m not a doctor, but this app gave me a better insight of what kind of surgeon I specifically want to be in the future. It made me want to be a neurosurgeon even more! more"
    },
    {
      "user": "Saharah Blueberry",
      "date": "08/11/2022",
      "title": "Love this app so much!",
      "review": "I am in no way a medical professional but I really want to be and this is the perfect app for an aspiring surgeon or med student. Very detailed and descriptive. Things I might suggest for developers would be adding more surgeries to specific specialities because some have very few. As well as possibly adding something like a dictionary for beginners (as things like google are not always reliable). And offline support would also be really handy for me and lots of other people. Overall best surgical app I’ve used. It’s good to strike down boredom with something that’s actually fulfilling. 10/10 would recommend this game!! 👍 more"
    },
    {
      "user": "scoobeyswalrs",
      "date": "11/07/2022",
      "title": "DOWNLOAD THIS!",
      "review": "I am a 3rd year IM resident who loves procedures and crit care. This app is by far the best app I’ve ever come across throughout my education… ever… from undergrad until now. Every time of resident, med student, and fellow could use this app (and attendings needing refreshers). Great for PAs/NPs who do a lot of procedures or ones in school. It has something for every specialty too, step by step, with 3D moving images to facilitate better recall and understanding. I make all my interns download this and watch the video before discussing with them and before letting them do one. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "Apple Vision"
  ],
  "size": "85.3 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Sexual Content and Nudity\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English, Czech, Danish, Dutch, Finnish, French, German, Greek, Italian, Japanese, Polish, Portuguese, Spanish, Swedish, Turkish"
}