{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "1-800 Contacts 12+",
  "subtitle": "World's Largest Contact Store",
  "seller": "1-800 CONTACTS, Inc.",
  "stars": "4.9",
  "rating": "143.2K Ratings",
  "price": "Free",
  "appDescription": "The 1-800 Contacts app is the fastest, easiest, and downright pleasantest (totally a word) way to order contact lenses. WE HAVE ALL THE CONTACTS We have millions of contact lenses in stock and ready to ship. They’re the same contacts your doctor prescribed but they cost less and you don’t have to go into a doctor’s office to buy them. Same Prescription. Better Experience. ™ SUPER SIMPLE ORDERING Ordering for the first time? Enter your prescription information or simply scan the lens box to import your prescription. Done. Ordered with us before? Re-order in three simple taps. (Pssst. Protip: Get faster shipping when you upload a picture of your paper prescription.) RENEW YOUR PRESCRIPTION WITH EXPRESSEXAM™ Tired of paying for an exam every year just to get the same prescription? Want to skip the trip to the doctor’s office? Use our app to take a quick vision exam with ExpressExam. A board-certified eye doctor will issue a new prescription within a couple of hours. FIND THE CONTACTS THAT WORK BEST FOR YOU With ExpressExam you can receive multiple prescriptions so you can find the contacts that work best for your eyes, lifestyle, and budget. Try something new. Returns and exchanges are free – including shipping. DON’T LEAVE MONEY ON THE TABLE We’ve partnered with major vision insurance companies so we can quickly find and apply your benefits when you order from the app. MANAGE YOUR SUBSCRIPTION If you’ve subscribed you can easily manage your orders: snooze, cancel, update a prescription, etc. OUR GAJILLION PERCENT PROMISE (Because “100% satisfaction guaranteed” doesn’t cut it.) • Free shipping and returns? Always. • Tear a lens? We'll replace it for free. • Still have contacts from your old prescription? We'll exchange them for free. • Find a lower price? We’ll beat it. • And the best customer service in the industry… WE’RE AVAILABLE TO HELP 24/7 Call, email, or text us right from the app. You’ll receive a prompt reply from a real, live person with an adorable Utah accent who really wants to help you. (NOTE: You only get the adorable accent if you call). Yup. Downloading the 1-800 Contacts app could be the best choice you make today. PRIVACY In order to provide great features, and to continually make the app better, some privacy-related data may be collected. Specifically, we request your location if you take our ExpressExam (since it’s only available in certain states), or when searching for your doctor. ExpressExam also needs to use your camera and microphone so we can verify you are reading the letters from an eye chart correctly. Any time we need to access this data, we make sure to request your permission first! In addition, you can choose to send us a photo of your prescription as a convenience. If you choose to enter your purchase information, we will save it so that you don’t have to re-enter it again. We also support Apple Pay! We only keep the purchase history of products you buy from us -- we don’t have access to any other purchase information. These features are all optional and you don’t need to give the app access to them if you are not comfortable doing so. We value your privacy. more",
  "reviews": [
    {
      "user": "Xueli88",
      "date": "04/15/2018",
      "title": "Amazing!",
      "review": "I usually call to order my contacts because this company has WONDERFUL customer service agents on the line that you never have to wait longer than 47 seconds to speak to and they are super friendly, answer all of your questions, very knowledgeable and helpful in providing you with the best offer and all available options and never pressure you one way or the other in buying products you’re not interested in (many companies try to upsell and make you feel guilty when you decline the offers), but I decided to order my contacts via the app this time! As predicted, everything on the app is user friendly— you can just take a picture of your prescription, enter your mailing info, and with just one click they’re ready to process your order and ship it out to you! I cannot say enough nice things about this company. My entire family orders contacts from them— very reliable and superb customer service!!! more"
    },
    {
      "user": "Shannon222",
      "date": "01/18/2023",
      "title": "Downhill Fast",
      "review": "Years ago, when a lot of the positive reviews were written, they were great. I always had a high opinion of 1-800-contacts. Today that has all changed. I’m having the hardest time placing an order for contacts. Maybe it’s weird that I have two different prescriptions, one for extended wear clear contacts, and one for prescription colored contacts. They keep putting my order “on hold” and prompting me to take an express exam through then for $20. I don’t need it because my Rx was renewed last week. When I contacted them via text, they quickly assumed I was stupid and ordered the wrong contacts. I told them, no, that I actually had two prescriptions, then they said they had the paper but would verify no matter what ( ok, fine) but it was as if I was lying, even though I literally uploaded the thing three times. Very short w me and canceled the order per my request because I felt like they’d leave it languishing forever. My initial order worked just fine for whatever reason. I wonder if they think I’m lying since I was in a free trial with the colors when I ordered the extended wear. I don’t know. But they definitely treated me like they thought I was dumb. more"
    },
    {
      "user": "ChristmasMorning1",
      "date": "05/19/2019",
      "title": "BEST CUSTOMER SERVICE ANYWHERE!",
      "review": "1800 Contacts went ABOVE & BEYOND to help me when I had a shady eye doctor who would only order ONE type of lenses from ONE company even when I told him the three month lenses he insisted I needed last time didn’t work after 3-4 weeks. Then when 1800 Contacts would try to call to get the prescription so THEY could help me, the Dr’s office would never answer the phone.I had to go to the Dr’s office & demand he give me my prescription. Even though 1800 Contacts doesn’t have samples, your eye dr is supposed to let you try samples until you find the ones that work for you... 1800 Contacts sent me 30 packs of MANY contacts knowing I’d be trying them out & sending the rest back until I found what worked for me. They were so wonderful! They have my ultimate respect and support. They are a fantastic company who really care about their clients. They deserve TEN STARS! more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "Mac",
    "Apple Vision"
  ],
  "size": "66 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English"
}