{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "mySugr - Diabetes Tracker Log 4+",
  "subtitle": "Master Your Blood Sugar Level!",
  "seller": "mySugr GmbH",
  "stars": "4.7",
  "rating": "22.4K Ratings",
  "price": "Free",
  "appDescription": "Get help with managing your diabetes, it's quick and easy! Ranked the Top Diabetes App by Healthline 3 times. Featured in Forbes, TechCrunch, and The Washington Post. Adding the mySugr app to your daily routine with diabetes (Type 1, Type 2, or gestational diabetes) will make your life easier. The mySugr app is your loyal and free diabetes logbook, which keeps your diabetes data under control. With one app you'll have: • Easy and personalized dashboard (diet, meds, carb intake, blood glucose levels and more). • Bolus Calculator with precise insulin dose recommendations (limited to some countries using mySugr PRO). • See clear blood sugar level graphs. • Diabetes Management Indicator (DMI) at a glance, no more surprises. • Daily, weekly, and monthly reports, that you can share directly with your doctor. • Secure data backup (built with regulatory compliance, quality, and safety). 1. APP FEATURES It auto-logs your data plus you can collect your daily therapy info such as meals, your diet and carb intakes. Also, any medications you take, blood glucose levels and insulin levels. 2. INTEGRATIONS • Steps, activity, blood pressure, CGM data, weight, and more. • Apple Health® • Google Fit® • Accu-Chek® Aviva Connect; Accu-Chek® Performa Connect; Accu-Chek® Guide (activate mySugr PRO for no charge! Please see our FAQs on the website for the latest information). 3. PRO FEATURES Take your diabetes therapy to the next level! mySugr PRO can be activated at no charge with some Accu-Chek® devices or with a monthly or yearly paid subscription. • Smart search: build your own searchable database of places, meals, activity, tags, etc. • Bolus Calculator (check available countries): calculate your insulin dose, corrections, and meal shots. • PDF & Excel reports: save or print all your data for you or your doctor. • Blood glucose reminders: you won't forget to check and log. • Meal photos: snap your meals to improve your carb counting. • Basal rates: for pump users. Get it now! A clear logbook to monitor, control and manage your diabetes: all your medical information right on your smartphone and ready to be used! Stay on top of your health, monitor your carbs, manage your medicine intake, get help avoiding hypers/hypos, and be in control of your diabetes therapy every day! SUPPORT: Have a problem, criticism, question, suggestion, or praise? • mysugr.com • support@mysugr.com https://legal.mysugr.com/documents/general_terms_of_service_us/current.html https://legal.mysugr.com/documents/privacy_policy_us/current.html Upgrading to mySugr PRO will charge your store account. Your subscription automatically renews unless canceled at least 24 hours prior to the end of the current period. The cancellation of the current active subscription period is not allowed. Your subscription and auto-renewal options can be managed in your account settings in the store settings after purchase. The mySugr Logbook is used to support the treatment of diabetes, but cannot replace a visit to your doctor/diabetes care team. You still require professional and regular review of your long-term blood sugar values and must continue to independently manage your blood sugar levels. more",
  "reviews": [
    {
      "user": "Watson7777",
      "date": "03/18/2023",
      "title": "Fantastic app-THE ABSOLUTE BEST CHOICE",
      "review": "UPDATE: I just began tracking my weight and exercise. It’s amazing. It’s A MUST HAVE! I was previously using the Accu-check application for several years, even though I had also downloaded this one. My original view of the application, was that it wouldn’t automatically transfer the previous data stored on my device, or from the online database. I had unfortunately missed the sunset deadline to manually make the transition, I had temporarily stopped tracking my sugar, which was a big mistake. By the time I remembered why I keep feeling spacey was probably due to either a sugar high or an excessive low, which was mostly the case. I quickly found out that my favorite app “Accu-Check” was retired and replaced with the “My Sugar” app. I had missed the Free “PRO transfer offer period”, and proceeded to set-up and sink my account and device. I was quickly pleased, after syncing my device, I found that everything stored on my monitor transferred completely. I was so excited. I have since explored the app, and see where I can add additional details about my day, including my current weight, pictures of meals, how I feel and more. This is one of the absolute best Sugar apps on the market, which works with a large variety’s of blood glucose meters! more"
    },
    {
      "user": "BigCrane75",
      "date": "03/20/2023",
      "title": "Great App to gain Perspective",
      "review": "This app is a great tool to gain some great perspective and understanding of life with diabetes. MY LIFE with Diabetes. Being able to see and really analyze what causes the ups and downs in my blood sugar, and really think about what is happening at that moment I’m logging a reading. Im by no means an expert on the subject of how to properly manage this disease. But now I have a much greater understanding of all the conditions, aswell as the actions that can contribute to me feeling great or terrible. I’ve been in denial for some time of what causes the good or bad days. This highly animated app gives a very reasonable and realistic approach to wanting to dig into the data. It’s only as good as what you log. And how honest you can be with yourself, and hold yourself accountable to logging the truth about your day, your activities, stresses, mood, anxiety, and poor food/drink decisions. Something as simple as seeing and comparing how different levels of activity affect your blood sugar is not only good in real time, but also to be able to go back and identify patterns, good, bad, and sometimes the ugly. This app has served me well, and I am grateful for it. Hopefully you will see the positives for yourself as well. Cheers to your good path to better health. more"
    },
    {
      "user": "cyber553",
      "date": "02/15/2020",
      "title": "By far the best glucose level tracking app!\n\n    Developer Response",
      "review": "I used an old app for many years but eventually it became incompatible with latest iOS and I had to change. I tried 6 different apps and this one trounced the competition at the time. That was 3 years ago, and since then, the app has gotten better in many ways. This service and development teams are incredible. Super-responsive, they understand when you have issues and and I’m constantly impressed with how quickly they’re able to implement changes and get them out to their users. One complaint about a recent change: If you have a meter that syncs entries directly with the app, you no longer have the ability to adjust the time of the entry. I liked to do this for times when I end up waiting 15-45 mins after testing to take my pre-meal shot, since getting precise timing of insulin injections is more important than precise timing of BG readings while fasting. Sadly, this is no longer an option and instead the only option is to delete the synced entry and recreate it manually, which is MUCH more painful. I wish they would restore users’ the ability to manage their own data how they see fit. more Hi! Wow, thank you so much for the great review. We are so glad you found us and that you have stayed happy with our products and service. Keep up the great work and we've got your back! more"
    }
  ],
  "compatibility": [
    "iPhone"
  ],
  "size": "250.7 MB",
  "category": "Medical",
  "ageRating": "4+",
  "languages": "English, Arabic, Bulgarian, Czech, Danish, Dutch, Estonian, Finnish, French, German, Greek, Hindi, Italian, Japanese, Latvian, Lithuanian, Norwegian Bokmål, Polish, Portuguese, Romanian, Russian, Slovak, Slovenian, Spanish, Swedish, Thai, Turkish"
}