{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Blood Pressure App SmartBP 12+",
  "subtitle": "BP Health Tracker & Monitor",
  "seller": "Evolve Medical Systems, LLC",
  "stars": "4.5",
  "rating": "41K Ratings",
  "price": "Free",
  "appDescription": "Your heart's essential partner - A simple blood pressure app capable of tracking not only bp, pulse rate, and weight, but also meds & ECG/EKG (Electrocardiogram). SmartBP® is a blood pressure app that enables you to log, monitor, evaluate, and share BP reports using iOS devices and Apple Watch. In addition, SmartBP connects with Apple Health. With your health information at your fingertips, you can now take a more active role in your own health. For those with prehypertension or hypertension, SmartBP can assist in monitoring progress, identifying trends, and managing all your blood pressure and heart measurements, ultimately aiming to enhance your overall heart health and blood pressure. SmartBP is a smarter way to manage your blood pressure measurements and track your progress. Disclaimer: 1) SmartBP al­lows you to record, track and an­a­lyze trends in your blood pres­sure. You can ei­ther man­u­al­ly en­ter your records or use a blood pres­sure mon­i­tor to sync with SmartBP through Apple Health. SmartBP alone does not mea­sure blood pres­sure. You need a sep­a­rate blood pres­sure mon­i­tor to mea­sure blood pres­sure. 2) SmartBP is NOT a substitute for a doctor or professional healthcare or advice. Any health related information provided is for informational purposes only and should not be used to replace the advice of healthcare professionals. 3) SmartBP Cloud Sync is not a replacement for backing up your health data. While we strive for the highest data security, no measures can ensure 100% protection. Regular data backups are the user's responsibility. For information on how to use the app, visit our website * Video: www.smartbp.app * FAQ: www.smartbp.app/faq Features- - Log your systolic, diastolic blood pressure, pulse rate and weight. Body mass index (BMI), pulse pressure (PP) and mean arterial pressure (MAP) is automatically calculated. You can manually enter measurements or seamlessly sync them with a supported Bluetooth BP monitors such as: * A&D * Omron * Beurer * Transtek - Quickly add notes (e.g. before dinner) and measurement information (e.g. sitting, left arm) using tags. - Store and access all your blood pressure measurements anywhere and anytime using Apple HealthKit. Avoid manual data entry and reduce errors by automatically uploading blood pressure measurements to HealthKit by auto-syncing with SmartBP. The following Blood Pressure Monitor Apps can connect to HealthKit (check for compatibility with different models): * A&D * Omron * QardioArm * iHealth * Withings - Share your blood pressure information with your doctor, healthcare provider or family using email, text message (SMS), Apple HealthKit. Create blood pressure reports in PDF format with blood pressure data, charts and stats and share with your doctor or healthcare provider. - View 7, 14, 30 day summary grouped by daily AM/PM averages and tags. Create, share and print summary PDF reports and CSV file. - Print PDF reports or charts directly - Analyze your progress through clear graphs and statistics (including mean and variability). Filter data using tags to assess lifestyle changes or medication effectiveness. Compare tagged graphs side by side and observe systolic vs. diastolic blood pressure correlations. - Sync ECG (Electrocardiogram) records - Back up your health data and access it on all your mobile devices with SmartBP Cloud. This is an optional service. We do not sell your health data. - Sync directly between iPhone and iPad through Bluetooth or WiFi without sharing on the cloud. - Back up blood pressure data by exporting to iTunes, Dropbox, and Drive, or import from CSV files into the app. - Protect your data with TouchID, FaceID or Pin keypad protection - Set reminders for managing your blood pressure - Intuitive color coded data to identify normal, prehypertensive, stage I and II hypertension. These limits can be modified. Categorize your records based on 2017 ACA/AHA, 2023 ESC/ESH or create your own custom categories. - Create multiple user profiles and manage them from a single app/device. - US and international height and weight units supported. more",
  "reviews": [
    {
      "user": "Valasel",
      "date": "04/09/2018",
      "title": "Great tagging feature!!\n\n    Developer Response",
      "review": "It's amazing to me how few BP apps include the ability to track factors that might be contributing to BP problems! The flexibility of the tagging features in this app allows you to tag & track - then graph- whatever you want: stress levels, salty diet, major public events (I noticed my BP spike for days after Las Vegas shooting), specific medications or supplements, caffeine intake, etc. It has helped me learn that for me, salt seems almost irrelevant and stress is about 80% of the problem. I'm now tracking Toprol closely as I think I might be having an uncommon but not unheard of paradoxical reaction, with more Toprol raising my BP. DEVELOPER SUGGESTIONS: ... TAGGING: It would be really helpful if tags could be ordered; if not, it would be helpful if list were at least alphabetized. Also would like to be able to ditch some of the tags provided by app......DEFAULTS: Being able to set defaults for measurement site and measurement location would speed input nicely!......BONUS: The ability to have multiple profiles would be nice. Some of us have non-smartphone-using elderly parents to track! Thanks for a great app!! more Update 8/22/22: Hello there! We have addressed all your requests. Please check it out and let us know what you think! more"
    },
    {
      "user": "Lacemaker 427",
      "date": "04/02/2023",
      "title": "Type is super tiny!\n\n    Developer Response",
      "review": "I tried it, and then deleted it. The letters and numbers are minuscule and impossible for me to see without a magnifying glass. Looking at that big white screen full of blank space, I wonder why they didn’t use the space more intelligently. I am a senior citizen with new glasses last month, but I can’t comfortably read anything on the screen in this app without magnification or massive eyestrain. If the developers intended to make this app only for younger folks with 20/20 vision, fine,…but don’t write off all of the seniors and people with vision challenges who suffer with blood pressure and/or heart rate issues. I’m going back to my iPad Notes app where I can set the text size to a comfortable level, and simply input the readings on the keyboard. I use symbols to allow my doctor to quickly see where the HR was too low (🤍), the systolic or systolic was too low. or both were too low (🔻🔻). I have different symbols for hypertension, and this method has worked well for me. If you upgrade to a variable typeface, I may try again, as the graphing ability is a convenient feature. Even that was so small and faint , so I struggled to see it. Perhaps the developer should hire a vision challenged programmer to point out the sad inadequacies in this app and help to solve them. more Update Apr 13th: Good news. We have made the fonts bigger. Hope this works for you. Please let us know if you have any questions. You should be able to upgrade to version 8.2.1 anytime now on the App Store. Also, would appreciate a response or acknowledgement on email as requested earlier. Update Apr 11th: We have an update planned this week that will increase the font size and hope you will be satisfied with the outcome. Also, as requested earlier, please email us directly as it is hard to troubleshoot here. Update Apr 3, 2023: Can you send us a screenshot of what specific areas are you having difficulty with and we would be more than happy to fix it for you. Our email - support@evolvemedsys.com Also, were you able to resolve the issue of limit classification selection based on your previous message? If you are genuinely interested in resolving these issues, please directly email us and we will get them fixed. It’s very hard for us to narrow down your concerns here. The US default limit classification is according the 2017 AHA/ACC guidelines. But the good news is that we also have a custom limit classification that includes a “low” category. You can set this in the “limit classification” within the more section of the app. Make sure to consult your doctor to review the current 2017 ACC/AHA classification before changing to the custom. If you need help finding it or more info on the guidelines, please let us know - support@evolvemedsys.com more"
    },
    {
      "user": "Moaeb",
      "date": "10/03/2022",
      "title": "Great App\n\n    Developer Response",
      "review": "Great App. I really wish the comments would have a setting to always show as say a box directly under the summary of BP, in the history list. Then you would easily be able to see the notes for what Contributing factors were explained as for possible reasons why the blood pressure may have been a good reading or a high/low reading etc.. I would rather see the notes right there and then having to click and it just individually open up just that particular input history. This would allow you really quickly to you know make a pattern of if taking a certain medication spikes your blood pressure for the afternoon or something you would be able to see it scrolling up and down. more Hello - Thank you so much for the feedback. If I’m understanding correctly, you would like to see the notes under each record. We can certainly do that, but we already show tags in summary. Would you rather see the tags or the notes? Tags are more useful because you can use them to analyze as well. Send us an email on support@evolvemedsys.com and we can learn more about your needs. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Watch",
    "Apple Vision"
  ],
  "size": "337.2 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English, Arabic, Danish, Dutch, Finnish, French, German, Italian, Japanese, Korean, Norwegian Bokmål, Portuguese, Russian, Simplified Chinese, Spanish, Swedish, Traditional Chinese, Vietnamese"
}