{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "ICU Trials by ClinCalc 17+",
  "subtitle": "Summarized landmark ICU trials",
  "seller": "ClinCalc LLC",
  "stars": "4.8",
  "rating": "61 Ratings",
  "price": "$4.99",
  "appDescription": "ICU Trials is a quick pocket reference for both the novice and seasoned critical care clinician. This app does not replace the original manuscript of these landmark critical care trials – instead, it serves as a fast reference and learning tool for some of the most important ICU trials over a wide range of specialties. Each entry contains a short one-liner about the critical care trial and key points, which includes only the most pertinent details, such as inclusion/exclusion criteria, treatment protocols, pertinent endpoints and findings, as well as expert commentary regarding key subgroup analyses or limitations to the trial. Want to send a colleague a citation? Use the \"Share Trial\" button to send a PubMed link and quick summary. Using this feature, it’s incredibly easy to share pivotal critical care trials with students, residents, and other colleagues. The database features 150+ landmark trials related to: ARDS, cardiac arrest, DVT/PE, delirium, glycemic control, heart failure, hemorrhage, meningitis, nephroprotection, nutrition, pneumonia, sedation, seizure, sepsis/shock, spinal cord injury, stroke, and subarachnoid hemorrhage – with more trials and topics to be added on a regular basis! This app is designed and maintained by Sean P. Kane, PharmD, BCPS -- a clinical pharmacist specializing in critical care with a background in information technology and application development. more",
  "reviews": [
    {
      "user": "Chicago62",
      "date": "12/19/2017",
      "title": "Excellent resource",
      "review": "I love this app. I appreciate the fact that you can search by disease. Wish it was updated more often. I recommend it to anyone working g in the ICU space."
    },
    {
      "user": "Govind Panda",
      "date": "09/13/2017",
      "title": "Amazing app for all levels of clinicians",
      "review": "Great app for ICU review, rounds and quick reference. Looking forward to continued updates."
    },
    {
      "user": "Hasshot",
      "date": "11/13/2017",
      "title": "Excellent but need some improvement",
      "review": "Nice application with nice articles. Give you the name the author and the year. Key points are nice but lacking the criticism. Link to the full article. But no possibility to mark so I am using the favourite mark to know what I read in iphone. Again I cant found this mark in the Ipad due to lack of sync facility. I cant read in landscape mode in the Ipad neither the iPhone. I am using this for the ICU care articles and i will keep using. Best in the store. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "4.7 MB",
  "category": "Medical",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English"
}