{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "My Diet Coach - Weight Loss 4+",
  "subtitle": "Food tracker, calorie counter",
  "seller": "Easy Tiger Apps, LLC.",
  "stars": "4.6",
  "rating": "23.8K Ratings",
  "price": "Free",
  "appDescription": "Determined to beat the bulge and get beach-ready? Eager to look better, feel better... and maybe turn a few heads too? Then My Diet Coach will be your new favorite way to make sure the pounds drop off easily—and permanently. Stop leaving your weight loss journey to chance. With My Diet Coach, you’ll keep on top of every calorie with the diary section, while the macro tracker, diets, recipes, and daily recap will make sure you have all the guidance you need to keep you on the right track. This app is for you if you want to: Lose weight Track what you consume Count calories Track macros Turn heads Get your beach body Take charge of how you look *FEATURES* - Daily food diary and macro tracker. The key to the new, healthier you. Break down everything you eat by day, meal, and macronutrients. Swipe through the days and plan future weeks by logging your meals in advance. Receive calorie intake recommendations and track your path towards your target weight. Incorporate calories burned off through exercise, so you always have the full picture of how your workouts affect your progress. - Ketogenic diet...and many more. Keto is just one of the several diets included in My Diet Coach. Want more flexibility? Enter your own custom plan. - Recipes. Get all the good stuff with a pantryfull of delicious recipes to explore, create, and enjoy! - Meal groups. Eat the same items regularly? Group them together into a meal and log them in a flash. MyDietCoach integrates with Health App, allowing users to import body measurements data from Health App to MyDietCoach. ------- SUBSCRIPTION INFO: Subscribe to take advantage of the features described above. • Subscription length: [weekly, monthly, yearly, lifetime subscription] HERE CHOOSE THE RELEVANT SUBSCRIPTION PLAN! • Your payment will be charged to your iTunes Account as soon as you confirm your purchase. • You can manage your subscriptions and turn off auto-renewal from your Account Settings after the purchase. • Your subscription will renew automatically, unless you turn off auto-renew at least 24 hours before the end of the current period. • The cost of renewal will be charged to your account in the 24 hours prior to the end of the current period. • When canceling a subscription, your subscription will stay active until the end of the period. Auto-renewal will be disabled, but the current subscription will not be refunded. • Any unused portion of a free trial period, if offered, will be forfeited when purchasing a subscription. Terms of service: https://bendingspoons.com/tos.html?app=552341639 Privacy policy: https://bendingspoons.com/privacy.html?app=552341639 Have a feature request you would like to see in a future version of the app? Do not hesitate to contact us at mydietcoach@bendingspoons.com more",
  "reviews": [
    {
      "user": "listener5362891",
      "date": "07/20/2018",
      "title": "Keeps me motivated! Only thing that works for me!",
      "review": "I love the rewards. They seem silly for an adult, but I get so bored and these keep it more stimulating. Plus, you get rewarded for healthy habits even if you haven’t lost weight. Entering products/calories is also easy, so I’m more likely to keep up with it. Before I restored, I had an older version of the app that offered the slim down avatar and the weight chart for free - those were both super motivating as well! I’m debating upgrading to pro just so I can get those features back. The quotes and panic button were also super helpful to me in the beginning when I was struggling to break habits and cravings. LOVE it! It’s the only app that works for me because it doesn’t get boring. If anything, more options for clothes (or replacing some of the clothes with more trendy versions) would be my main request. I plateaued and regained weight after a super successful year (now I’m successfully restarting)... part of it was the plateau, but I also think part of it was because I’d chosen all of the clothes/accessories I liked and wanted, so I became disengaged. Awesome for short term/teaching goals, but I would LOVE features to make it an app I can use for years, and something to keep me more engaged after I reach my goals would’ve been awesome to keep me from regaining the 40 lbs I lost using the app. more"
    },
    {
      "user": "Faldie",
      "date": "05/11/2021",
      "title": "Most effective with no diet restrictions",
      "review": "I was not overweight but wanted to loose a little bit of weight to fit better in my clothes. This app helped me lose 30 pounds without having to deprive myself of any specific food group. I entered my present weight, my goal and it calculated the healthy amount of weight for me to lose each week. All I had to do was log in what I had each meal. It gives you an option to take a picture of your meal, in case you don’t have time to log it right away. It has a huge database of foods already stored, so it’s easy to pull that information. It also gives you the macros for each meal or item. For me, it was a huge wake up call. I was completely off in my portions and the app told me the truth about the calories I was consuming. The best is that I can have a piece of cake if I monitor closely what I have the rest of the day. If you’re serious about losing weight and keeping it off (which is the hardest part), this app will be invaluable. Make it a part of your daily routine and in time you’ll do it with your eyes closed. Don’t go for fad diets that deprive you of a whole food group. It’s unsustainable, unhealthy, and ineffective. I give this app five stars. As a bonus, my kids love playing dress up with the doll. Highly recommended! more"
    },
    {
      "user": "HaleySoups",
      "date": "08/01/2017",
      "title": "Get the Pro Version!",
      "review": "I love that this app is so customizable - you can add your own pictures for motivation, make your avatar look like yourself, create unique challenges, and scan the barcodes of food items to instantly upload their nutrition information. I would highly recommend getting the pro version in order to take advantage of all the features. This app also includes a game-like leveling system in which you earn points for sticking with it. I like this system a lot, but there is one thing I would change about it: the fashion items. As you earn points, the game gives you clothing items to put on your avatar, but these clothing items are generated randomly and most of them don't fit the avatar well at all. I'm trying to lose weight - I don't want to plaster my ideal self with ill fitting clothes that make her look bigger than she is! I wish that the fashion items actually fit the avatar, and I wish that I could see a list of items to buy and save up my points to get the things I really want. Sometimes that would be all the motivation I would need to do a few extra squats or drink a little bit more water. Other than that, this app is a wonderful tool that has already helped me lose weight and be more mindful of myself. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "123.6 MB",
  "category": "Health & Fitness",
  "ageRating": "4+",
  "languages": "English, French, German, Italian, Portuguese, Russian, Spanish"
}