{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "First Derm Online Dermatology 12+",
  "subtitle": "Online dermatologist",
  "seller": "iDoc24 Inc",
  "stars": "4.2",
  "rating": "378 Ratings",
  "price": "Free",
  "appDescription": "Get peace of mind within hours from an online dermatologist about that spot or rashDermatology Online: First Derm offers human-centric insights straight from real dermatologists. It's a level of personal touch and expertise that AI Dermatologist tools simply can't replicate.First Derm quickly connects you to a Dermatologist on the go. Address that spot or rash anytime, without the wait or hassle of in-person dermatology appointments.Our board-certified dermatologists on First Derm not only bring years of hands-on experience but have also undergone over 10 years of specialized training at premier medical institutions. Vetted by a senior medical advisory board, they have attended to a wide range of skin issues, from common rashes to serious skin diseases. This ensures that you receive a level of care rooted in deep expertise and rigorous training. Research shows a Dermatologist is still superior to an AI DermatologistHow First Derm WorksSimply take a picture of your skin, fill out the form, and send it to our team of board-certified dermatologists. Your information will always be kept anonymous and secured. A dermatologist will get back to you with -the likely skin condition -instructions on what to do next-over-the-counter medication (if applicable)Your dermatology consultation starts at $34.95 (€25/ £20)Capabilities of Online Dermatologist- Skin & Hair Care: Consultation for all skin types, conditions, and expert advice for maintaining healthy hair- Bug Bite Identifier: Quick insights to distinguish and manage insect bites effectivelyRash Identifier: Pinpoint the cause of rashes and receive guidance on treatment- Skin Cancer Detector: Detect worrisome spots for potential skin cancers- Mole Checker: Evaluation of moles for any signs of abnormality- STD Consultation: Discreet and professional advice on sexually transmitted diseases and conditionsOn average over 70% of cases submitted to First Derm can be treated with over-the-counter medication, potentially saving you an unnecessary visit to the doctor. For more serious cases, our dermatologists may recommend a face-to-face consultation with a local dermatologist, which could potentially fast-track your visit.With over 200,000 successfully reviewed cases, First Derm offers expertise on a range of skin concerns.Skin Conditions & Rashes:AcneEczema (Atopic Dermatitis)Contact DermatitisPsoriasisRosaceaSkin rashDry skin, chapped skinInfections & Bites:Cold Sores (Herpes labialis, typically caused by HSV-1)Bug bites / insect bite-related rashesAthlete's Foot (Tinea pedis)Folliculitis (ingrown hair)Hair & Scalp Concerns:Hair loss, alopeciaDandruff, Seborrheic DermatitisWrinkles and anti-aging skincareSTDs & Related Conditions:Genital herpes (typically caused by HSV-2)Other STD (sexually transmitted disease) / STI (sexually transmitted infection)Serious Skin Conditions:Skin cancer, moles, changing moles, melanoma, actinic keratosisMiscellaneous:ChilblainsLivedo reticularisHives (Urticaria)VasculitisComedonesIntradermal nevusErythemaFirst Derm - Your telehealth partner in dermatology, not only provides online consultations but also features to locate a dermatologist, pediatrician, or pharmacy near you.Plus, with an answer from First Derm, our users see a dermatologist two weeks faster than the US average of 32 days.This dermatology service is globally accessible, with our team offering services in 7 languages and reaching over 160 countries worldwide.Quick Guide to Using First Derm-Download the dermatology app: No account creation required! Your identity remains anonymous-Take two clear photos of the affected area and fill out a short medical intake form-Pay the case fee based on your desired response time. (8, 24, or 48 hours)-Save your unique 8-digit case number and use it to read your resultsDisclaimerInsights from First Derm’s dermatology experts are for informational purposes only, offering peace of mind and next steps. Since you’re anonymous, it's not a diagnosis or treatment plan.",
  "reviews": [
    {
      "user": "Joe S. Moore",
      "date": "04/30/2018",
      "title": "Great\n\n    Developer Response",
      "review": "THANK YOU. I received a response in under two hours stating pityriasis rosea. At work, I was advised to go to an Urgent Care facility where they looked at one little area of my rash for 5 seconds and stated it was definitely fungus and gave me Nystatin as treatment. It didn't seem correct so I got in to see a dermatologist. GUESS WHAT? Immediately the dermatologist stated it was definitely NOT fungus and it was most likely pityriasis rosea. Ha! Thank you!!!! Clearly First Derm is VERY reliable and I received this original response in under two hours and for less money! Definitely remembering this for the future.. Thank you for your account. Happy to help. Skin diseases can be challenging sometimes for non-dermatologists.BestFirst Derm Support"
    },
    {
      "user": "Washin47",
      "date": "12/11/2019",
      "title": "Loved this app\n\n    Developer Response",
      "review": "I had a rough patch of skin that I went to two Doctors to diagnose what is was. This was worrying me so I just was browsing around and found this app searching for something to help. I chose the option to get an answer in 8 hours which was a bit pricier but well worth it to have a response. The Doctor sent a response back to me within two hours. This is such a nice app to have especially when it takes forever to get an appointment to see a dermatologist. Thank you for your quick response and information on how to solve this problem over-the-counter. Very helpful and I would definitely try this again. Thanks Washin47Glad we could help, we are here 24/7CheersMichael"
    },
    {
      "user": "DS10484",
      "date": "10/26/2022",
      "title": "Better than the pediatrician!\n\n    Developer Response",
      "review": "My son developed an odd circular rash last week on his temple. My wife took him to our pediatrician and they told her not to worry about it and that we should consider changes to his diet, which hasn’t changed in the last 6 months and he has had no other issues since. Before seeking a referral to a dermatologist we tried First Derm. The app confirmed that it was in fact a fungal infection that needed a topical ointment. We started treatment a few days ago and it’s already starting to clear up. Thanks for saving us the time, money, and pain of letting this linger!! Thanks DS10484. Glad that we could help and you are seeing progress. We are very good at giving peace of mind.CheersMichael"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "41.9 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English"
}