{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Wellframe 17+",
  "subtitle": "Health Checklist and Messaging",
  "seller": "Wellframe",
  "stars": "4.7",
  "rating": "8.9K Ratings",
  "price": "Free",
  "appDescription": "Wellframe helps you feel in control of your health by connecting you to care right on your iPhone or iPad. You can send a private message at any time to your care team - it's as easy as texting, but more secure. Your care team will create a personal daily checklist for you with helpful articles, videos, and things to do. The more tasks you check off, the more your care team can customize your program for you. Set reminders to help remember your medications and appointments, and track your steps and progress over time. You’ll learn what to expect and feel better supported as you go. Wellframe takes your privacy and security seriously and is fully HIPAA-compliant. Wellframe is always free for users - just sign up with the access code you received from your sponsoring provider or company. Wellframe works with Apple Health for certain care programs, such as those that provide a step count task. Seek a doctor’s advice before making any medical decisions. This app is designed for education and to provide support between provider visits. If you're enrolled in an eligible care program you may connect a glucometer to share readings with your care management team, but should continue to check with your doctor before making any changes to diet, exercise, or treatment plan. more",
  "reviews": [
    {
      "user": "Thomas Klitzke",
      "date": "09/07/2019",
      "title": "My health\n\n    Developer Response",
      "review": "This app has been very helpful in keeping me on a health conscious track along with a diet. It gives meals and recipes with the meals so you can make good health conscious decisions. The app. will provide my health records, physical condition, and medical records to other doctors and physicians as needed, with your consent. This is only outside of the Think Whole Care Service. Inside the Think Whole Care System your records are shared only with licensed staff and doctors. This makes it very easy when going from one doctor to another. You don’t have to fill out a lot of medical information, and medicine list that you have no idea of what you are taken. You see iris all in your phone, medical records, health records, and a list of your current meds. I probably be lost with out it. If I get a new phone I hope that all my records will be transferred to the new phone as the phone company says. more Hi Thomas! Thank you for sharing your review with us and the community. We are thrilled that you've had such a positive experience. Our users experience and satisfaction are top priorities. In the event you do purchase a new phone, the application will remain available be re-downloading and logging in as you would normally. If you need any assistance, please contact us directly at help@wellframe.com. more"
    },
    {
      "user": "DoggyPapa1",
      "date": "05/26/2024",
      "title": "Essential Health Coaching for a Healthier You\n\n    Developer Response",
      "review": "Joining Wellframe, at first, seemed intrusive since I was giving up details on my health. However, after being here several months and having a fantastic health coach check in with me, I have began a safe passage back to a healthier lifestyle. Little did I know this, but it turns out I need a coach to keep me going or at least help me to stay on track. This has been so rewarding that it has honestly saved my life and made me a better person for myself and my family. Hands down, this app is worth the time you will put into it, especially if you are ready to get healthy. more Hello! We’re so happy to hear that you’re finding the communication feature with your Care Manager useful in the app. Thank you for sharing your experience with us! more"
    },
    {
      "user": "Hogrider666",
      "date": "09/06/2019",
      "title": "Worked for a while then stopped. One useful feature\n\n    Developer Response",
      "review": "After working reasonably well, although inflexibly and without much in the way of useful features, the app crapped the bed this morning. It no longer tracks physical activity which is one of my rehab goals, provides perc tube maintenance reminders, or medication reminders. Restarted, reinstalled, logged in and out; the usual fixes, but it’s broken. iOS on my phone is up to date. When it was working, it disappointed because previous days’ activity could not be reviewed, changes in medication reminders would not take effect until the next day, and the whole interface was clunky. Basically it’s free, but you get what you pay for: a simplistic, inflexible, feature-limited app that randomly stops working (what little it did do). It only gets 2 stars because it does provide, in-app, a direct means to connect with my treatment team. Like a hundred other communication apps, but it was integrated and direct. more Hi! We're sorry that you were experiencing some difficulties with the app. We hope that this issue has since been resolved. If you are still experiencing these issues, please contact us directly at help@wellframe.com so that we can assist. It's our customers that allow us to constantly improve our product and the user experience. We really appreciate your feedback. Thank you. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "Apple Vision"
  ],
  "size": "92.6 MB",
  "category": "Medical",
  "ageRating": "17+\n                Infrequent/Mild Alcohol, Tobacco, or Drug Use or References\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English, Haitian, Spanish"
}