{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Monash FODMAP Diet 12+",
  "subtitle": "The Official FODMAP App",
  "seller": "Monash University",
  "stars": "4.2",
  "rating": "1.7K Ratings",
  "price": "$7.99",
  "appDescription": "Researchers at Monash University have developed the low FODMAP diet and a corresponding app to assist in the management of gastrointestinal symptoms associated with irritable bowel syndrome (IBS). The Monash University FODMAP diet works by swapping foods high in fermentable carbohydrates (FODMAPs), with low FODMAP alternatives. Around 75% of people with IBS experience symptom relief on a low FODMAP diet. The app comes directly from the research team at Monash and includes the following: - General information about the FODMAP diet and IBS. - Easy to understand tutorials to guide you through the app and the 3-Step FODMAP diet. - A Food Guide detailing the FODMAP content for hundreds of foods using a simple 'traffic light system'. - A list of branded products that have been certified by Monash as low FODMAP. - A collection of over 70 nutritious, low FODMAP recipes. - Functions that allow you to create your own shopping list and add notes to individual foods - A Diary that enables you to record food eaten, IBS symptoms, bowel habits and stress levels. The Diary will also guide you through step 2 of the diet - FODMAP reintroduction. - The ability to adjust units of measurement (metric or imperial) and activate colour blindness assistance. more",
  "reviews": [
    {
      "user": "Cssymonshoughto",
      "date": "12/05/2020",
      "title": "Some nice features",
      "review": "I was a bit hesitant to spend $8 after seeing some negative reviews, but the positive reviewers seemed to know what they were talking about. So far, I think getting the app was a good choice. The diary is especially nice, allowing you to do quick ratings to track symptoms through the day. The food information is helpful, but I was a bit perplexed at the differences between the FODMAP info on some vegetables, since a good book on FODMAP suggests that (for example) broccoli, green beans, and cabbage should be avoided during elimination, but the app says they are okay. Because Monash has done the testing, though, I assume I have come to the “horse’s mouth,” so to speak. I was hoping for the price that the guide would be a bit more detailed, and I thought some foods (like yellow cooking onions, which are widely available in the US) would be included. But the strength of the app is in the recording features, and it is very cool that you can filter out food chemicals that bother you, and that the app provides a systematic way to track reintroduction, with a bit of guidance about amounts. Overall I think the app will be very useful. more"
    },
    {
      "user": "festatichiama",
      "date": "07/26/2023",
      "title": "no links work, frustrated!\n\n    Developer Response",
      "review": "1 star for attention. not mobile friendly, SUPER frustrating. all thru the app there are links that dont work. HELLO DEVS PLEASE FIX. I wouldn't give feedback this way, but the Feedback link does not work on the app!!! and there is no way to get a hold of them anywhere. Even if you Google this app and go to the webpage, there's no way to communicate with them. This is an extremely easy fix to make the links work. Another example of where they work is they have a certified section where they list food partners, and it is almost impossible to get those links to work. And now I will confess that this is a super useful app. Several times a day I go on here to receive the bad news that I can't eat something or like anything 🤣 if I can make some feature suggestions, it would be great to see the data organized in terms of, what CAN I eat? For instance, I want to see a list of vegetables that I can eat. A lot of or a medium amount of they have enough data to make a slider where you can say vegetable and moderate FODMAP or very low FODMAP. Also, the recipe should be billed out more. There's only a few of them. Thanks for your work, university. LASTLY it is very confusing that on the food index page, the green red orange dots do not consistently go in ascending or descending order, it is different for each item. They should all go in ascending order or they should all go in descending order. That makes this already frustrating situation even more confusing. more Hi there - we're sorry to hear that you are experiencing issues with accessing links on our app! We'd love to get some further information from you about these issues - please contact us at enquiry@monashfodmap.com. We also apologise that you found it hard to reach out to us - our website is a direct way to ensure we receive your questions: www.monashfodmap.com/contact-us/ We appreciate the feedback in regard to organising the data according to what you can eat - we do have the filter function which can alter the traffic lights to reflect your tolerances, but we can investigate other sorting options also. In the past we have limited the number of recipes so the app doesn't take up a huge amount of storage on people's phones, but we hope to add more recipes in the app in the near future. Finally regarding the traffic light order - they have been arranged as such is that it reflects the overall traffic light rating allocated to the food. For example, a food with an overall red rating will start with a red and have serving sizes listed in descending order, and vice versa. We hope this further information helps and we again sincerely appreciate your feedback. We hope to hear from you via email soon. Best wishes more"
    },
    {
      "user": "brittbrittxo",
      "date": "08/15/2019",
      "title": "Simple things overlooked",
      "review": "I will start by saying that this app has helped me tremendously on this hellish diet, but there’s very simple things in the app that were overlooked that could be fixed in a second. Like I’ve noticed multiple recipes don’t have some measurements of ingredients listed which is mind boggling that you forgot simple numbers on things. I’m also highly frustrated not knowing what bread I can and cannot eat since there are a few contradictions in the food search regarding that. And I know you can’t add every food known to man, but knowing I can look up anything would be nice (even if it’s obvious I shouldn’t eat it...ex. marshmellos). Also in the recipes, it would be nice to know how many you can actually eat of the thing...like what is the serving size for each recipe because I had like 3 rice paper wraps and my stomach was in turmoil that night. This diet is already hard and frustrating enough so when I pay $8 to make it easier, I need it to be worth it. I’ll end with saying that overall this app is quite nice and helpful and reduces my anxiety knowing it’s certified but small things that can help and be fixed should be, specially if you’re going to charge me for an app that helps with an only ever temporary diet. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "99.8 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English, French, German, Italian, Spanish"
}