{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Doctor On Demand 17+",
  "subtitle": "Video doctor visits, 24/7",
  "seller": "Doctor On Demand, Inc",
  "stars": "4.9",
  "rating": "109.9K Ratings",
  "price": "Free",
  "appDescription": "Connect face to face with a doctor, psychiatrist or psychologist through video on your iPhone or iPad. Doctor On Demand by Included Health works with or without insurance and is available at reduced rates through many major health plans and large employers. You’ll always see your cost upfront and won’t receive a surprise bill after your visit. Doctor On Demand by Included Health’s providers are licensed, board-certified and US-based. With an average patient rating of 4.9 out of 5 stars, our physicians, psychiatrists, and psychologists have experience across many specialities. From colds to cholesterol, our providers can treat hundreds of issues online through video. Just like an in-person visit, your doctor will take your history and symptoms, perform an exam, and may recommend treatment - including prescriptions and lab work, if needed. Doctors can also access your vitals, such as temperature and blood pressure, through our integration with Apple's HealthKit. If your employer or school requires a doctor's note, one can be provided. Doctor On Demand by Included Health also offers a private space to meet face to face with a psychologist or psychiatrist through video. Choose from a diverse group of therapists and work with them to address what’s important to you from the privacy of home. You can also take a free mental health assessment to find out if you will benefit from talking to us. Our therapy and psychiatry appointments are available in as little as two weeks, much faster than finding a traditional provider. Here are some examples of how we can support your full mind and body health: -Cold & Flu -Urinary Tract Infections -Sinus Infections -Acne, Rashes & Skin Issues -Screenings for High Cholesterol, Diabetes & Thyroid Issues -Headaches & Migraines -Allergies -Depression -Stress & Anxiety -Grief & Loss -Prescription Refills Doctor On Demand by Included Health lets you avoid the hassle, wait and cost of a walk in clinic, urgent care or ER. You can chat virtually through video with a doctor 365 days a year–weekends and holidays included. Below are some frequently asked questions about our app: When are doctors available? Our physicians are available, on call, and standing by 24/7/365, weekends and holidays included. You can see a doctor immediately or schedule a visit at your convenience. If you would like to see a psychologist or psychiatrist, you can schedule an appointment 7 days a week. Is insurance accepted? How much does a visit cost? Our services are available with and without insurance. We also partner with many top employers and health plans to reduce your cost. See exactly what your visit will cost before you connect. Who are the doctors? Doctor On Demand by Included Health's trusted, US-based, board-certified physicians, psychiatrists and licensed psychologists have an average of 15 years experience and come from diverse backgrounds with a variety of specialties. How does it work? Connect face to face with a medical doctor right from your phone in as little as five minutes. Just like an in-person visit, the doctor will take the patient's history and symptoms, and perform an exam. Doctor On Demand by Included Health also offers a private space to meet with a psychologist or psychiatrist through a video visit from the privacy and convenience of home–or anywhere you are. What can you treat? From colds to cholesterol our medical doctors can treat hundreds of issues, including cold & flu, urinary tract infections, allergies, headaches, sprains and skin conditions. They can also order labs and screenings to help with preventative care and help manage chronic care conditions. Doctor On Demand by Included Health’s psychologists and psychiatrists can see you for anxiety, stress, depression, PTSD, trauma and loss, relationships, postpartum and behavioral therapy. This service is available nationwide, in all 50 states and the District of Columbia. more",
  "reviews": [
    {
      "user": "AshNRo",
      "date": "06/14/2021",
      "title": "Convenient & quality care",
      "review": "I started using Dr on Demand because my insurance sent me an email that they covered it and I liked the idea of being able to meet with doctors from my living room. I’m currently working with a psychologist and a psychiatrist and the quality of care is just as good as being in an office except I don’t have to wear pants lol the best part is they are ON TIME. I’ve never had to wait beyond our appointment time to start a session. I did have a connectivity issue once but the customer service team had great service and refunded my copay and didn’t charge my insurance for the visit. I like that I can read a bio about my doctors before I choose to work with them. Some are available the same day and others don’t have appointments available for a few weeks, but I find scheduling options open up a lot more after your initial visit, at least for therapy. Haven’t needed to use it for a medical visit yet but I would totally use this app if I needed an antibiotic or something like that vs having to go into my normal primary care office and waiting an hour or more. The only downfall to this app is that you cannot get in touch with doctors between appointments. I can imagine why that is, but it would be so awesome if it had a messaging or voicemail service, even if they charged per message or had limitations on how often/what you could use it for. more"
    },
    {
      "user": "Naomi Tilley",
      "date": "11/19/2018",
      "title": "Highly Recommend",
      "review": "I don’t often write app reviews but felt compelled to with this. I am an international flight attendant and this app is a game changer for me! If it had not been for Dr on Demand I would have had to find an urgent care center somewhere, wait hours in a room filled with other sick people and would’ve paid far more just to be told what I already intuitively know...that I have a head cold and an ear infection. These factors are what usually kept me from going to urgent care and getting the treatment I probably needed. Can you imagine being in a foreign country, not speaking the language, having to weather snow and ice on foot while you try to make your way to a hospital in a country where you don’t have insurance coverage, alone, only to have to trek back to your hotel and find the nearest pharmacy on the way? It’s a big deterrent. Now, with Dr on Demand, I can do it from the comfort of my hotel room and the app will locate the closest pharmacy. Today, this app and the wonderful doctor kept me from flying with a middle ear infection and risking potentially blowing an ear drum, which would have resulted in permanent hearing loss. I waited less than two minutes and the appointment probably only took five minutes. This is my new, most favorite health app! Everyone should download it and have it ready for when they need it. more"
    },
    {
      "user": "GiselleinSC",
      "date": "02/02/2022",
      "title": "Mostly pros. Minor cons…",
      "review": "This app is great if you can’t find someone in network near you with your insurance, or you don’t have insurance. You don’t have to go anywhere or wait forever for an appointment! You can be seen in under 5 minutes depending on the doctor and what time you need help. You can also see lots of different types of doctors. With that being said, my only cons to this app would be that if you want mental health from a psychiatrist, YOU CANNOT GET CONTROLLED SUBSTANCES FROM THESE DOCTORS!! So if you are on anti anxieties or something for ADHD, for example, they won’t be able to write you an RX. However, any other medication they can and will prescribe. My other only con would be the site/app itself, charging you for your appointment up front. Then if your insurance covers telehealth visits, you either have to wait to be reimbursed or figure out how to you’re getting your money back….it’s just a hassle to have to pay up front every time and then wait a month or longer to see what your insurance is going to do….Otherwise, this is way better than sitting in an office waiting area for however long, or having to take off work during normal 9-5ish hours, since a lot of these tele docs have later hours! This is NOT an ER, or anywhere for emergency care!!! Please don’t think it is!!! If you need stitches, you will need to see someone in person, and ASAP before you bleed out!!! Lol more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad"
  ],
  "size": "341.7 MB",
  "category": "Medical",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English"
}