{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "healow 12+",
  "subtitle": "",
  "seller": "eClinicalWorks LLC",
  "stars": "4.7",
  "rating": "383.5K Ratings",
  "price": "Free",
  "appDescription": "healow™ lets you communicate with your doctor’s office and access up to date medical records. You will be able to access your appointments, lab results, vitals, manage medications and other personal data all within one app. From the healow™ app you can manage multiple accounts and access your and your family’s medical information. Find a doctor and book your appointment - fast, free & easy, at your convenience – morning, noon or late at night! No more waiting on the phone with your doctor's office for an appointment. Find an appointment that works for you and book instantly – on the go! Set your goals and track them easily using trackers. Use our weight management & activity trackers to reach your fitness goals. Track your numbers regularly to watch the trends change and share your progress with your doctor. Stay motivated to make healthy choices. more",
  "reviews": [
    {
      "user": "FL_Quaintrelle",
      "date": "06/18/2022",
      "title": "Super Helpful Health Tracking App :)",
      "review": "I’ve used ‘healow’ for several years now. In that time I’ve had a couple of surgeries, mental health appointments, ER visits, 2 hospital stays, medical appointments, drug & alcohol abuse rehab, prescriptions, annual physicals, etc, etc & being a person with ADHD it helps me tremendously with keeping all my important heath info together, organized, situated, handy, easy to understand & access…ANYWHERE at that! It’s fantastic & has been super helpful in tracking my heath informations making my appointments efficient - I leave feeling heard, confident, knowledgeable - like I got my $ worth. My Dr’s are able to treat me comprehensively because they’re fully informed, & are happy to respectfully hear me out as a patient because they can see I care about my health. It’s a win-win all around. I highly recommend this app. Thank you developers, from the bottom of my heart. I truly love your app. ❤️ more"
    },
    {
      "user": "iCarly2",
      "date": "06/21/2024",
      "title": "Scheduling isn’t great\n\n    Developer Response",
      "review": "There is a new setting where the app does not allow appointments less than one year into the future. My son is 8 months old and needs multiple wellness exams within a year, but I get an error message after entering in all my information and it doesn’t allow me to book, requiring me to call my provider. This app also doesn’t handle rescheduling. To change an appointment I need to call my provider. And even then, I still get app and email reminders of an appointment that has been canceled. It makes me have to double check calendars and send messages to my provider to confirm the correct appointment or ensure one has been canceled. These issues have happened multiple times. I wish the app would remove the canceled appointment and not send reminders. I also would like to book my regular wellness exams through the app without getting errors. The UI for visit summary and the log for immunizations could also use improvement. I’d also appreciate the option to add an attachment to a message. For example, I wasn’t able to share a screenshot of my scheduling error. It would also be nice to select any provider (no preference) and schedule based on date/time available. Currently you have to click through each provider and their availability and cannot browse all doctors based on a date/time. more We're sorry to hear that you've had a negative experience with our product. We value your feedback and will do our best to address your concerns. You can contact our support: help@healow.com more"
    },
    {
      "user": "#afriendlybookworm",
      "date": "01/10/2024",
      "title": "Constant Problems & Awful Support\n\n    Developer Response",
      "review": "If you happen to have one or more healthcare providers who are forcing you to use the Healow app and/or portal for communication with your doctor, lab results, prescription, refills, etc. — good luck! After you synch a more than a couple healthcare practices and patients (your children for example) and user names and passwords, the app can no longer access all of them without glitching or giving you a constant error. You cannot call and speak to a human at customer support. I tried, and they told me they could not help me — that I had to go through the website. So, I spent hours online and emailing with tech support only to not resolve anything and have them make suggestions that were not helpful — something that would’ve been much easier to navigate with an actual conversation. Healow, then closed my case, emailing me telling me they’d resolved my issue (nothing was resolved). My doctor’s office has also tried to troubleshoot unsuccessfully and can’t figure it out. So, communication with this particular practice is a constant problem and source of frustration. This is supposed to make my healthcare more accessible and easier to navigate. If anything, it is the exact opposite. The app works for the first two practices I used Healow for, but every healthcare practice added after that has not worked properly — if at all. more We apologize for any inconvenience our product may have caused you. We take all feedback seriously and will use it to improve our product and better serve our customers in the future. You may reach out to us at help@healow.com more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch",
    "Apple Vision"
  ],
  "size": "130.8 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English, German, Japanese, Polish, Simplified Chinese, Spanish"
}