{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Stilla: Skincare Scanner 4+",
  "subtitle": "Ingredient Checker & Routines",
  "seller": "Foyer Objet Inc.",
  "stars": "4.5",
  "rating": "213 Ratings",
  "price": "Free",
  "appDescription": "Unlock the science behind your beauty routine with Stilla. Scan any product to instantly reveal what's in it, how it might benefit your skin, and any potential irritants. Stilla empowers informed choices, whether you're a skincare beginner or a pro. With Stilla, you can: ▸ Scan barcodes or search our extensive product database to find products that address your specific skin type and concerns. ▸ Discover new favorites and trending ingredients with our curated collections. ▸ Analyze ingredients directly from labels or pasted text. Stilla will break down confusing ingredient lists and explain what each ingredient brings to the overall product formula. ▸ Get personalized recommendations based on your unique goals, and optimize your routine according to your personal goals. ▸ Track problematic ingredients to avoid them (you choose which ones, we don't decide this for you!) ▸ Track expiration dates: Stilla takes into account each product's individual Period-After-Opening. ▸ Create custom routines and follow them with Live Activities. ▸ Sync all your data across devices with iCloud. More ways Stilla helps: • Organize your skincare collection: Bookmark your favorite products and keep track of everything in one place. • Get exclusive insights: See star ingredients and Tracked Ingredient warnings. • Verify marketing claims: Don't take promises at face value, let Stilla do the research. • Siri & Shortcuts: Start routines and access features with voice commands. • Customize your app: Choose an icon that matches your style. Why choose Stilla? › Shop smarter: Scan labels while shopping for beauty products to find the perfect match for your skin. › Revamp your routine: Optimize your current skincare regimen for better results. › Avoid irritants: Identify common allergens and irritants that might cause reactions. › Clean beauty made easy: Track custom ingredients and find products that align with your values. › Stay informed: Be notified of product reformulations and get the latest ingredient info. › Build a dream routine: See how well a new product will fit into your existing routine. › Learn as you go: Discover the science behind popular ingredients and their benefits. Stilla is an independent app created by just two people dedicated to making skincare information transparent and accessible. Our algorithms are not biased towards any brand and rely solely on scientific evidence behind each ingredient. We care about your privacy: we do not use any trackers from Meta, Google, or any other advertising platform. Terms of Service: https://stilla.app/terms Privacy Policy: https://stilla.app/privacy more",
  "reviews": [
    {
      "user": "🐶 puppyrino",
      "date": "03/06/2024",
      "title": "Perfect for skin care\n\n    Developer Response",
      "review": "It is so good all you have to do is answer a a few questions and then it’s all done. also if you want a full report you have to spend a little money but not that much if you don’t want to spend money all you have to do is press the x. it will show up sometimes but it’s not like five minutes later you see it it’s like every so often or just press the lock on full report and boom it pops up. It shows you good products and not as good products what Evers good for your skin it depends some might be a not as good I don’t know. It has a rating thing and you put the barcode under the thing your scanning it with its pretty cool most products are good for me but maybe not for you cause I’m littler probably younger than you so most things are good for me if your like a teenager or an adult this will be perfect for you to keep your skin healthy. There are so many different brands and you can search it and tap it and it will show you how good it is for your skin! more Thank youuuu! ✨🩵 ✨ Reviews like yours are not just super encouraging for us to read, but they also help us to improve Stilla! Lots of love and appreciation 🫶🫶🫶 more"
    },
    {
      "user": "Hey the appo",
      "date": "04/14/2024",
      "title": "Love this app",
      "review": "These products that I have been scanning is telling some true things about them and I love that and now I know some products that I should not get it should stop using and some products that I should keep on using I love this app I read it about a 10 out of 10. It’s amazing I recommend. This is not a paid review. By the way this is just my honest opinion I may be young, but at least my skin will not be bad whenever I’m older more"
    },
    {
      "user": "Good but no robux :(",
      "date": "05/09/2024",
      "title": "Great!\n\n    Developer Response",
      "review": "It really helps! I didn’t know half the products I own had stuff that was bad for my skin- and that it caused my acne outbreaks, but since I’ve started to check my products, it’s really helped! more Thank you so much for your amazing review – we love it! Stilla will only get better, so please stay tuned for updates 🩵 more"
    }
  ],
  "compatibility": [
    "iPhone",
    "Apple Vision"
  ],
  "size": "37.6 MB",
  "category": "Health & Fitness",
  "ageRating": "4+",
  "languages": "English, Arabic, Czech, Danish, Dutch, Finnish, French, German, Greek, Hungarian, Indonesian, Italian, Japanese, Korean, Norwegian Bokmål, Polish, Portuguese, Russian, Simplified Chinese, Spanish, Swedish, Thai, Turkish, Ukrainian, Vietnamese"
}