{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "SCAI Point-of-Care App 17+",
  "subtitle": "",
  "seller": "Society for Cardiovascular Angiography and Interventions Foundation",
  "stars": "5.0",
  "rating": "43 Ratings",
  "price": "Free",
  "appDescription": "The Society of Cardiovascular Angiography and Interventions (SCAI) Point of Care App is your resource in the Cath lab and in the clinic. Use it for quick and easy reference to SCAI clinical documents and interactive tools such as the SCAI cardiogenic shock classification tool, risk calculators, and key treatment algorithms. The app allows users to bookmark important pages, take notes on key information, and share content with colleagues or patients. SCAI develops clinical documents and quality resources on a variety of topics related to interventional cardiology; the app includes more than 20 of society’s most recent guidance documents. Download it today and begin using these tools to improve your patient care. The goal of this new SCAI Point of Care App is to provide evidence-based recommendations and decision support tools consisting of clinical guidelines, calculators, and quality improvement tools. The SCAI Point of Care App is free for use by the entire cardiovascular care team. However, users must have or create a free account with SCAI and create a password. Why? Because the app serves as a gateway for users to connect to valuable content that is otherwise exclusively available to SCAI members. For more information, please contact us at quality@scai.org About SCAI SCAI is the leading nonprofit medical society representing invasive and interventional cardiology. Founded in 1978, SCAI’s mission is to lead the global interventional cardiovascular community through education, advocacy, research, and quality patient care. SCAI has dedicated its work to advancing the profession and is the designated society for guidance, representation, professional recognition, education, and research opportunities for invasive and interventional cardiology professionals. For more than 40 years, SCAI has personified professional excellence and innovation globally, fostering a trusted community of more than 4,000 members dedicated to medical advancement and lifesaving care for patients with cardiovascular disease. more",
  "reviews": [],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "178.5 MB",
  "category": "Medical",
  "ageRating": "17+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English"
}