{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "PCOS App 4+",
  "subtitle": "Resources For Women With PCOS",
  "seller": "Caitlin Johnson, RD INC",
  "stars": "4.8",
  "rating": "23 Ratings",
  "price": "Free",
  "appDescription": "Discover community, education, and tools for women who have been diagnosed with PCOS. Learn how to manage symptoms, balance hormones, and boost fertility on your own. Create a plan for your body to finally experience the relief and freedom you’ve been hoping for. Access these features for free: - Blog posts answering commonly asked questions about PCOS - Social media content with sharable facts and advice - Newsletter subscription to receive updates from Caitlin Johnson, RD - List of our top Amazon picks for food and products Access these features with a Plus subscription: - Interactive community of women going through the same thing - Networking and educational events to seek additional support - Podcasts and courses on fertility, hormones, cycle tracking, pregnancy - Recipes that reinforce a healthy foundation for managing PCOS - Video tool to get YOUR questions answered by Caitlin Johnson, RD more",
  "reviews": [
    {
      "user": "FoodieStef",
      "date": "04/02/2024",
      "title": "The Best PCOS Resources App!",
      "review": "This is the #1 app I recommend to all my friends who have PCOS. The journey can feel intimidating and lonely, but Caitlin does such a great job catering to all learning styles. You can read, watch, listen, and ask -- all in the PCOS app. Access delicious PCOS-friendly recipes and get notified instantly via push notifications whenever there's something new. more"
    },
    {
      "user": "Caitlin Rose Johnson",
      "date": "08/16/2023",
      "title": "Everyday PCOS Advice in 1 Place",
      "review": "I get so confused with PCOS advice and this app has changed that for me. All the content is so clear and always has actionable help. I’ve made very recipe in the app and love it! I can’t wait for the new one each week. I recommend this to all my PCOS friends. more"
    },
    {
      "user": "Chelsea Potter",
      "date": "12/13/2022",
      "title": "Excited for this app",
      "review": "I've been working with Caitlin for some time as a colleague, and she has such a great (and realistic) approach to helping women with PCOS and their fertility. I'm so excited for her services to become more widely available for more people through this app. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "47.3 MB",
  "category": "Medical",
  "ageRating": "4+",
  "languages": "English"
}