{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "IVUSAID 17+",
  "subtitle": "IVUS teaching companion",
  "seller": "Cardiology Apps",
  "stars": "",
  "price": "Free",
  "appDescription": "IVUS imaging guide with background information, image interpretation, quizzes and cases. Turn annotations on or off to clearly see images and use the detailed search. The IVUSAID App is a free educational mobile application which has been developed to teach medical professionals how to use intravascular ultrasound (IVUS) for PCI guidance based on the current guidelines using our extensive experience and large database of complex coronary cases. Despite the growing body of evidence for clinical benefits of IVUS-guided PCI, IVUS remains underutilized in much of the world including the United States. Challenges in image interpretation and education are among the barriers to widespread adoption of IVUS in everyday clinical practice. Mount Sinai Heart is a global leader within the field of interventional cardiology as well as mobile apps development. The myriad of cases and pathology which are seen in The Mount Sinai Cardiac Catheterization Laboratory make it the perfect center to educate medical professionals within this field. The Key Concepts section of IVUSAID describes principles of IVUS, image acquisition, and concepts of ultrasound behavior in various tissues. The Image Interpretation section of the app has dozens of representative cross-sectional images, videos, and descriptions of plaque types, stent apposition and expansion, artifacts, and more. A short video for each type of lesion or artifact and post-stent findings, in addition to an annotated representative cross section aims to overcome a major limitation of any article or book on IVUS which present a static image, since the actual IVUS pullback is dynamic. Twenty-one complex coronary cases demonstrate IVUS guidance in a variety of patient presentations and lesions including ACS, LM bifurcation, severely calcified lesions and calcified nodules, spontaneous coronary artery dissection, and malapposed stents as well as how IVUS was used to inform treatment decisions. An extensive quiz section helps deliver educational content in a more interactive format where answers are accompanied by detailed explanations and references. We hope that IVUSAID will help techs, fellows, and early-career physicians incorporate IVUS in their daily practice for stent sizing, post-stent optimization, and identification of appropriate treatment strategies. more",
  "reviews": [],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "87.8 MB",
  "category": "Medical",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English"
}