{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Figure 1 - Medical Cases 17+",
  "subtitle": "Expand your clinical knowledge",
  "seller": "Figure 1, Inc.",
  "stars": "4.7",
  "rating": "1.3K Ratings",
  "price": "Free",
  "appDescription": "The Future of Medical Education and Knowledge-Sharing Figure 1 is transforming healthcare by bringing together millions of healthcare professionals to view, share, and discuss real-world patient cases. With thousands of valuable cases - from the common to the rare - education and collaboration happens in real-time and is always centered around the patient. Figure 1 helps HCPs keep their fingers on the pulse of medicine, empowering better patient diagnosis, treatment, and outcomes globally. With Figure 1, you can: ◦ View, share, and discuss real-world medical cases in real-time ◦ Get insights and up-to-date perspectives from the experts on the medical cases that matter ◦ Test your medical knowledge through case collaboration, quick quizzes and effective CME more",
  "reviews": [
    {
      "user": "ParaFF2MedicMom",
      "date": "01/12/2021",
      "title": "Glad to be Back",
      "review": "Happy to return after an extended absence due to SARS and a Septal Wall MI second to the same. We never know the time or date but once we skip over the stick we’re always ready to return to what we know and understand, renewed. We owe it to our patients and students to push each and every one of them to see not only the disease but the person to realize the lack of family interaction when patients are critical can lead to more deaths, longer recovery times, more stress on healthcare workers as well as other staff, and a loss of hope for the patient. We must strive to understand even when tired and worn that we are their link to humanity and while our time is precious and must be spread incredibly thin - we are their only true human interaction at times and can be extremely important to their recovery. Take Heart and Give It In Return For if We Lose This One Special Gift We Will Lose Humanity. more"
    },
    {
      "user": "itsnouraalbalawi",
      "date": "10/01/2024",
      "title": "I love this app it’s my favorite, but.. dark mode? PLEASE?\n\n    Developer Response",
      "review": "I’ve been on Figure 1 for several years. I love it. Thanks for a great app! My only real complaint is that there’s no dark mode. How can I doom scroll medical cases in bed instead of sleeping if there’s no dark mode? Please add a dark mode option, I’ll be so grateful. Thanks again for an awesome app! more Hi there, thanks for the kind words! We've passed your suggestion along to our product team. If you have any other suggestions, feel free to send them our way by emailing support@figure1.com. Best, The Figure 1 Team more"
    },
    {
      "user": "Kphelgerson",
      "date": "06/23/2020",
      "title": "Was a 4, now a 4.6 with changes\n\n    Developer Response",
      "review": "Excellent resource for learning and seeing what others do with medical issues that lend themselves to photographs and/or discussion. Still needs to: Be able to support the uploading of videos. Be able to allow typed in websites or references to act as hyperlinks. more Thank you for sharing this feedback, Kphelgerson. We are currently working on improvements to the app, so I have passed these points along to the team. Kind regards, Ana from Figure 1 more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "92.2 MB",
  "category": "Medical",
  "ageRating": "17+\n                Infrequent/Mild Sexual Content and Nudity\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English"
}