{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Skin scanner, dermatology&acne 17+",
  "subtitle": "AI Skin rash & mole identifier",
  "seller": "Thinkabout",
  "stars": "",
  "price": "Free",
  "appDescription": "Discover an all-in-one dermatology app with a vast database of dermatologic conditions and medications and, a comprehensive glossary of dermatologic terms and procedures. Ensure medication safety by cross-checking for potential interactions and uncovering possible diagnoses with a symptom checker by providing a photo and answering a few simple questions. The content is carefully curated and regularly updated by certified clinicians, ensuring its reliability and accuracy. The information provided in this application MUST NOT be regarded as a replacement for professional medical advice. All of the medical decisions you make SHOULD BE ADVISED BY A QUALIFIED DOCTOR who is able to take all of your conditions into account. KEY FEATURES: *Dermatologic Drug Guide - access an extensive guide to dermatologic medications, complete with dosages, side effects, and precautions. *Dermatologic Disease Guide - explore a wide range of dermatologic conditions, their causes, symptoms, and treatment options. *Procedures Guide - learn about various dermatologic procedures, from skin biopsies to laser treatments. *Dermatologic Terms Glossary - navigate complex dermatologic terminology with confidence. *Interaction Checker - effortlessly check for potential drug interactions and contraindications. *Symptom Checker - quickly assess possible diagnosis by providing a photo and answering a few simple questions. *Bookmark - save frequently referenced information for convenient and swift access. ******* Premium access To access all the premium features and content, you need to subscribe or pay once for lifetime access. The cost of the purchase is charged to your iTunes account. Subscriptions automatically renew and are billed at the rate and period you choose based on your subscription plan. User accounts are charged for auto-renewal within 24-hours prior to the end of the current period. Subscriptions may be managed and auto-renewal may be turned off in iTunes Account Settings after purchase. Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable. Privacy Policy: https://awesum-apps.com/policy Terms of Use: https://awesum-apps.com/terms more",
  "reviews": [
    {
      "user": "Fatty for now",
      "date": "06/02/2024",
      "title": "Should be called skin scammer",
      "review": "Do not purchase. Not a scanner. Gives you basically a ton of medical terms and conditions for you to pick a disease from. Like an uploaded skin desire medical dictionary but more complicated. Do not waste your money on this. Bye bye $20! more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch",
    "Apple Vision"
  ],
  "size": "26.9 MB",
  "category": "Medical",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English"
}