{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "PCOS Help 4+",
  "subtitle": "Slayyy · Lose Weight · Diet",
  "seller": "Sarah Balog",
  "stars": "4.9",
  "rating": "85 Ratings",
  "price": "Free",
  "appDescription": "Empower yourself on your PCOS journey with our tailored support system. Our app combines expert-reviewed lessons, personalized meal plans, and weight tracking to help you take charge of your health. Learn to manage symptoms, balance hormones, and enhance fertility through expert-backed lessons reviewed by an OB/GYN and endocrinologist. With customized meal plans and a user-friendly weight tracker, you'll have the tools to create a lifestyle that works for your unique body. Slayyy is available through a paid subscription. The information provided is for educational purposes only. Sources can be found via the home tab's menu button or at https://slayyy.com/sources/ Terms of Use (EULA): https://www.apple.com/legal/internet-services/itunes/dev/stdeula/ Disclaimer: The Slayyy app is designed to support, not replace, the relationship that exists between a patient/site visitor and his/her existing physician. The information provided in this app is for educational purposes only and is not intended as a substitute for professional medical advice, diagnosis, or treatment. Always seek the advice of your physician or other qualified health provider with any questions you may have regarding a medical condition. Never disregard professional medical advice or delay in seeking it because of something you have read or seen in this app. The use of this app does not establish a doctor-patient relationship and does not constitute an endorsement, approval, or recommendation of any specific tests, physicians, products, procedures, opinions, or other information. Reliance on any information provided in this app is solely at your own risk. more",
  "reviews": [
    {
      "user": "jilli ronan",
      "date": "08/29/2024",
      "title": "don’t hesitate download the app!!!",
      "review": "The app is truly amazing! They give you so many recipes based off you’re struggles and you’re eating habits. Not only that, but they also will give you recipes if you’re on an omnivore diet or a vegan diet etc. Overall, they are very inclusive and are there to help you with any struggles you have. The subscription can be a little pricey, but if you reach out to support services, they are very quick to respond and work out a reasonable price with you. more"
    },
    {
      "user": "nkgirl08",
      "date": "09/01/2024",
      "title": "AMAZING!!",
      "review": "Before you can try the app they ask you to pay for a subscription, though not overly expensive, it was still out of my budget at the time. I was able to reach out to support and they helped to provide me with a payment option that worked for my current budget so I could gain the benefits of the app. Well worth it!! more"
    },
    {
      "user": "91AVCOL21",
      "date": "08/09/2024",
      "title": "Amazing",
      "review": "This app is amazing!!! They have recipes ways to keep track of weight and most of all they allow you to get a free trial for those are like me and unable to pay for the app right now. They are kind enough to give you a year free!!! How amazing are they! They are really trying to help us out! And they are quick to get back to you! So amazing love it already. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "37.6 MB",
  "category": "Medical",
  "ageRating": "4+",
  "languages": "English"
}