{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Ambetter Health 17+",
  "subtitle": "Your plan in your pocket 24/7",
  "seller": "Centene Corporation",
  "stars": "3.0",
  "rating": "63 Ratings",
  "price": "Free",
  "appDescription": "The Ambetter Health mobile app helps members stay connected to their benefits. It’s a one-stop shop for easy and secure access to plan details 24/7. Manage your healthcare benefits on the go with the Ambetter Health mobile app.† Sign in to your current account or create a new account to easily and securely access the information you need. • View, save, and share ID card • Find care: View current primary care provider (PCP) and search for and change PCPs; Search for in-network doctors, specialists, hospitals, and clinics near you • Pay premium and view payment history • Get answers to your questions: View FAQs; Contact member support • View covered services and benefits usage, including deductible and maximum out-of-pocket amounts † Ambetter Health is the brand name used for products and services provided by one or more of the wholly owned subsidiaries of Centene Corporation, who are Qualified Health Plan issuers in the states indicated at ambetterhealthAmbetterHealth.com. Health benefits and health insurance plans contain exclusions and limitations. ©2024 Centene Corporation, centene.com. All rights reserved. For information on your right to receive an Ambetter Health plan free of discrimination, or your right to receive language, auditory and/or visual assistance services, please visit ambetterhealth.com and scroll to the bottom of the page. more",
  "reviews": [
    {
      "user": "elab3",
      "date": "10/01/2024",
      "title": "Unable to access rewards\n\n    Developer Response",
      "review": "I am unable to change my points into dollars on my card. I am also unable to access the rewards. Considering they have to get used in a calendar year it would be nice if this worked. more We’re sorry to hear of this experience! If you are still in need of assistance, please send an email to AmbetterMemberLiaisons@centene.com and provide your name, phone number and a detailed summary of your concerns. Someone from our team will review your concerns and respond to you directly. Thanks! more"
    },
    {
      "user": "mariposafan",
      "date": "08/12/2024",
      "title": "What is the purpose of this app?\n\n    Developer Response",
      "review": "Let's see, I can view my ID card. Oh, I can do that in the native Wallet app. I already know my primary care provider's name. Anything about the plan or coverage takes me to their glacially slow website, but, hey, everything about how I pay them is right here. For the record, it's much, much more important to have information about what you do for me available in the app than it is to have information about what I do for you. It's not so much that it's a bad app as it is that the app doesn't do ANYTHING useful for me. Let me know when it actually helps me rather than you, eh? Right now it's useless and half-baked. The fact that it was released when it’s sole focus is on what I do for you tells me that your product managers and developers need a refresher on who is the customer here. more Thank you for your feedback. We understand your frustration and are actively working to bring this feature natively into the app. Our goal is to provide the best user experience, and we appreciate your patience as we continue to improve. If you have any other concerns or need assistance, please reach out to our Member Services by using the phone number listed on the back of your insurance card. more"
    },
    {
      "user": "Kayaretee",
      "date": "07/11/2024",
      "title": "Worse than the site, how?\n\n    Developer Response",
      "review": "I didn’t think it was possible, but they did it, made an app that performs worse than their site. To view covered service, claims history, or activity & usage, it just funnels you to the site. What’s the point of the app? I don’t need a digital card, but if you do, yay. I tried to view my current invoice and the pdf was from Aug 2023. To view your billing history, you guessed it, it sends you to the website. Oh, but don’t worry, they seem to have worked out the actual payment section, they ain’t gonna miss getting paid. The one and only good thing I can say is about the provider search. Since it can use your location, it makes it easier to find the provider you’re looking for. There are also helpful categories already laid out for you. Other than that, skip this app, it’s garbage. more We understand your frustration and are actively working to bring these features natively into the app. Our goal is to provide the best user experience. Stay tuned for updates and thank you for your patience and understanding. In the meantime, if you need assistance, please feel free to contact Member Services by utilizing the phone number listed on the back of your insurance card. Thanks! more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch"
  ],
  "size": "40.7 MB",
  "category": "Medical",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English"
}