{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Doc Doc - Assistant 17+",
  "subtitle": "",
  "seller": "Doc Doc - Assistant",
  "stars": "",
  "price": "Free",
  "appDescription": "Doc Doc - app for unlimited medical consultations. Access a wide range of medical services right from your home: - online consultations with qualified medical specialists. - online consultations with psychologists to support your emotional well-being. - consultations with rehabilitation specialists (in development) to assist in your recovery. Simple and convenient process: 1. Video, audio, or text consultation with a doctor. 2. Prescription and ordering of laboratory tests. 3. Follow-up consultation based on test results and treatment prescription. 4. Final consultation to assess your condition. Features of the Doc Doc app: - Recommendations for tests and a list of necessary medications. - Booking a laboratory appointment and receiving test results. - Specialist interpretation of laboratory tests. - Medication ordering with delivery or pick-up. - Individual notifications for medication intake. - A personal medical record with a history of consultations, chronic diseases, and allergies. We're here to help: Doc Doc is not just an app; it's your reliable medical assistant, available 24/7. Our mission is to provide quality medical care to everyone in need. Open to Collaboration: We are actively seeking partnerships with charitable and government organizations to extend our help and make medical services accessible to an even larger number of people. If you represent such an organization and want to collaborate, please contact us. Partners and Donors Section: We are proud of our partners and grateful for their support Continuous Development: We are constantly working on improving and adding new features. Stay tuned for updates! Join the Doc Doc community. Together, we're making the world healthier! Made in Ukraine for the whole world. For Doctors: Join our community of professionals and provide help to those in need. Download Doc Doc now and start taking care of your health wisely! more",
  "reviews": [],
  "compatibility": [
    "iPhone",
    "Mac",
    "Apple Vision"
  ],
  "size": "151 MB",
  "category": "Medical",
  "ageRating": "17+",
  "languages": "English, Azerbaijani, French, German, Italian, Kazakh, Polish, Russian, Spanish, Ukrainian, Uzbek"
}