{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Teladoc Health - Telehealth 12+",
  "subtitle": "Online Doctors & Diabetes Care",
  "seller": "Teladoc",
  "stars": "4.8",
  "rating": "579.4K Ratings",
  "price": "Free",
  "appDescription": "Teladoc Health connects you with complete care, at your convenience and an affordable cost. You’ll find what you need to get well—like 24/7 care—alongside primary care, therapy and programs proven to keep you well. EXPERIENCE AND EXCELLENCE Teladoc Health has been modernizing healthcare since 2002. More than 50 million visits later, we are the leader in telemedicine. With our app, top-quality doctors and data-driven programs are just a tap away. SEAMLESS CARE FOR ALL OF YOU Our app brings together doctors, therapists, dietitians, nurses, coaches and self-guided programs that tend to every aspect of your well-being. If you need in-person care, we can refer you to in-network providers and care sites. But don’t underestimate us. With a suite of connected devices, in-home lab services and prescription delivery (in some locations), we cover most common health needs. And with insurance, your copay for care could be as low as $0. PERSONAL AND PERSONALIZED Teladoc Health providers and coaches will get to know you. Our video and phone visits allow you to discuss your health and planning next steps together. The app integrates with our devices and Apple Health to put data in your hands. Analyze it during appointments with your care team, or on your own on the go. Then apply what you learn about your health and your habits to find the right path to your goals. We’ll send you notifications and nudges to keep you on the right track. OUR SERVICES INCLUDE: 24/7 CARE On-demand appointments any time of day with board-certified physicians for: - Colds and flu - Pink eye - Sore throats - Sinus infections - Rashes PRIMARY CARE Access within a week to board-certified primary care physicians and nurses who become your dedicated virtual care team for: - Routine checkups and preventive care - Goal-setting and a personalized care plan - Lab orders (bloodwork) - Checking blood pressure and other vitals - Managing chronic conditions CONDITION MANAGEMENT Depending on your coverage, you may be eligible for: - Programs to help manage conditions like diabetes and high blood pressure - Connected devices like a blood glucose meter or blood pressure monitor - Expert health coaching - Health data, trends and actionable insights MENTAL HEALTH Licensed therapists, psychiatrists and self-guided content for help with: - Anxiety and stress - Depression or not feeling yourself - Relationship conflicts - Trauma NUTRITION Registered dietitians who can help with: - Weight loss - Diabetes - High blood pressure - Digestive issues - Food allergies DERMATOLOGY Dermatologists who diagnose and treat common skin conditions, such as: - Acne - Psoriasis - Eczema - Rosacea - Skin infections Your coverage might also provide virtual access to: - Specialist for an expert second option on surgery, a diagnosis or treatment plan - Therapy and coaching to help with back and joint pain - Imaging and sexual health testing referrals CHECK YOUR COVERAGE Sign up to see which telemedicine services are covered by your health insurance or employer. SECURE AND CONFIDENTIAL Teladoc Health takes your privacy seriously. Your health information is protected by federal and state laws, including HIPAA. Please see our Notice of Privacy Practices for more information on how Teladoc Health uses your health information. AWARDS AND RECOGNITION - Company of the Year—Healthcare Dive, 2020 - World’s Most Innovative Companies—Fast Company, 2021 - Largest Virtual Care Company—Forbes, 2020 more",
  "reviews": [
    {
      "user": "Puzels445",
      "date": "10/11/2020",
      "title": "My invoice says $0??",
      "review": "This app is one of the strangest things I’ve ever experienced. Strange, because I don’t understand how it exists. It doesn’t make sense. I was almost sure it wouldn’t really work, or that it would be terrible doctors. I mean it’s an app. How am I going to get real and personal medical care downloaded from the Apple store. But...it’s...real somehow. I really waited just a few minutes (instead of days or weeks for my pcp) and a doctor pops on my screen. (To be fair, I haven’t asked for their license #s and checked it up yet- but hoping that since its connected to a large insurance company, they wouldn’t risk the huge lawsuits of hiring fake doctors). So far they seem competent and have been on the mark with the diagnoses. But here’s the strangest part. I kept waiting for the bills to come in the mail. They never did. So I checked my invoices in the app and it said $0.00 What??? How is this free? Is it just a benefit for paying my insurance premiums? Sheesh. so worth it. So long as I can afford it, I’m sticking with this insurance now. (Unless I’m mistaken about how this all works) Its worth the monthly premium $ to not have days of anxiety or worry while waiting for a doc appointment. I was also able to call in at 10pm about a UTI and the prescription was sent over to my pharmacy in minutes. UTIs get worse by the hour and can be dangerous. This saved me from having to sit in a covid filled emergency room all night to solve that prob. So so so grateful! more"
    },
    {
      "user": "b-abba",
      "date": "07/29/2021",
      "title": "Multiple Unreliable Physician Experiences\n\n    Developer Response",
      "review": "I feel Teladoc as a whole is great in theory reaching people for a multitude of health related issues. Unfortunately I had two unreliable physicians more than once and it can be difficult to switch once you have seen a specific doctor several times. No one wants to go through medical history again, and again. My physician forgot every time they filled my prescription that I could not have 3 months filled at once, this lead to me needing to request a refill from them every month! Finally the physician completely ignored my pharmacy requests leading me to make an appointment where they rescheduled me over 5 times, just to ultimately cancel with no follow dates (this is not the first time). Then the dermatology physician completely ignored everything I said and I had no resolution, waste of money! I’ve gone with out medicine for 3 weeks, I only needed a quick consult. I’d appreciate better and less struggling, maybe this means Teladoc is more transparent with their physicians resulting in better scheduling and communication to clients. It is very difficult to go on and off mental health medication. I’m willing to give Teladoc one last shot, after all maybe I’m unlucky with two unreliable physicians, but it is the last chance for me. If the results do not improve I will use other sources here on out. more Hi there, We are so sorry that you had this experience and would like to help. Please reach out to email us at information@teladoc.com with your name, phone number and screenshot of this review if you still need assistance. more"
    },
    {
      "user": "sullivan.1068",
      "date": "09/13/2023",
      "title": "Bugs and glitches galore right now\n\n    Developer Response",
      "review": "The app is beautifully designed and has fairly intuitive UI/UX, but there are just so many bugs. Tried to join the waiting room for my appointment this morning, only for the next screen to pop up for a split second, disappear, and a half cut-off yellow error message at the top of the screen to pop up. I did this probably 10-15 times trying to enter the room. I had two appointments booked in advance, and the second screen with my next appointment details had the date and add to calendar button completely overlapping on the same line. The app makes me go through the same intro screens every time I log in. Seemingly not a big deal, but super annoying to click through prompts about sharing health data, location, remembering password, etc. every single time. This info should be saved and not addressed every time. Similarly, having to fill out the mental health questionnaire each time you want to schedule an appointment with your provider is so frustrating. Maybe shorten it after the initial visit, just to check up on things that change often? It takes forever and is unnecessary to address before each (sometimes weekly) meeting. The animations between screens are nice, but move slow and get old when trying to move quickly. It tends to drag, and gives the app a slow and lagging feel. This is a small detail but it drives me nuts lol The services are great, but the app tends to hinder the experience. more Thank you for taking the time to let us know about App performance issues. If you have any more information to help our dev team make improvements, please send us an email at information@teladochealth.com with your name, phone number, and screenshot of this review along with more details. We will prioritize this. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "262.1 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English, Danish, French, Spanish"
}