{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Clue Period Tracker & Calendar 12+",
  "subtitle": "Cycle, Fertility & Ovulation",
  "seller": "BioWink GmbH",
  "stars": "4.8",
  "rating": "362.3K Ratings",
  "price": "Free",
  "appDescription": "Get to know your menstrual cycle with the award-winning Clue app. Clue makes it easy to stay in sync with your body and track your period, fertility, and cycle-related experiences accurately and effortlessly. Whether you’re trying to get pregnant, tracking cycle-related experiences, or navigating the changes of perimenopause, Clue’s got you covered. Backed by science and founded and led by women, Clue is trusted by millions of people worldwide. Thanks to our Berlin headquarters, your data with Clue is protected by some of the strictest data privacy laws in the world (GDPR). Your health data will never be sold or disclosed. No matter where you live. What can Clue do for you? PERIOD & MENSTRUAL CYCLE TRACKING Clue Period Tracking empowers you to become the expert of your unique body. • Know when to expect your period and plan ahead with advanced, personalized predictions • Discover your body’s unique patterns by tracking 100+ experiences connected to your cycle like feelings, PMS, cravings, pain, sex drive, and much more • Review an analysis of your past periods and cycles, including average cycle length, period length, period flow, and cycle variation • Log your birth control method, including pills, IUD, ring, patch, and more • Set up calendar reminders for your period • Add a widget to your home screen so you can see your current cycle and know when your period is predicted to start • Sync your period data with Apple Health • Get answers to your health questions with science-based content that breaks down complicated topics like fertility, STIs, and the science of sex into easy-to-understand articles FERTILITY & OVULATION CALCULATOR Clue’s clinically-tested technology takes the mystery out of getting pregnant and can easily tell you your most fertile days. • Get personalized ovulation and fertility predictions for the best time to try or do home insemination • Access tips and advice from fertility experts to help you understand the science behind getting pregnant PREGNANCY TRACKING • Follow the growth of your baby with weekly updates on size, weight, and development • Track your body's changes during pregnancy, like increased smell and taste, pregnancy glow, sleep quality, the supplements you take, and more • Receive weekly tips and support from OB-GYNs and Nurse Midwives PERIMENOPAUSE Get support throughout your transition to menopause (a time known as perimenopause) • Track hot flashes, sleep changes, your mood, and more • Stay on top of your changing cycle • Learn how your body is changing with expert-led articles Get the most out of Clue, plus access to all four tracking modes (like Clue Conceive and Clue Pregnancy), with a Clue Plus subscription! A few legal details: After you choose the Clue subscription that’s right for you & confirm your purchase, the credit card associated with your iTunes Account will be charged. Once purchased, your subscription will automatically renew unless auto-renew is turned off at least 24 hours before the end of the current period. If you currently have a free trial, any unused time will be forfeited when you purchase a subscription. If you want to renew your subscription, your account will be charged the same amount you paid for your initial subscription, 24 hours before the end of the current period. You can manage or change your subscription at any time, including turning off auto-renewal, by going to the ‘Account Settings’ on your device after the purchase. Note: Clue should *not* be used as a contraceptive. Clue is made to help people understand their menstrual and reproductive health by tracking their data, as well as predicting fertile days to aid conception. The app does not substitute professional medical advice, diagnosis, or treatment. Your healthcare provider can give you advice on your specific needs and situation. Helloclue.com support.helloclue.com Terms of Service: www.helloclue.com/terms Privacy Policy: www.helloclue.com/privacy more",
  "reviews": [
    {
      "user": "Queenbri2302",
      "date": "12/23/2022",
      "title": "More than Just a Period Tracker\n\n    Developer Response",
      "review": "I honestly can’t thank the creators of this app enough. I’ve been using this app for years and Clue has continued to update their app to improve function and usefulness for the masses. It not only tracks your period, but just about anything else health-related, too! It follows your moods, cravings, energy levels, exercise levels, weight, acne, you name it. If you mess up with following your period, you can even go to your analysis section and choose to omit a specific cycle from your overall period tracking; for example, I forgot to track my periods for a few months. When I came back, I simply hid that cycle from in history so it wouldn’t skew my future period predictions. Even from an educational standpoint, the app offers plentiful resources to gain access to information about contraception, love and sexuality, fertility, and even postpartum symptoms. You can use this app to do, literally, WHATEVER you need—it all depends on how much information you pour into it. The more data you enter, the more accurate and helpful the app will be for you. It also helps you be more attentive to what you’re feeling and how every internal and external factor is influencing all the different aspects of your personal health. I love how expansive and all-encompassing Clue is, and it has become a staple in my own health/self care journey. Thank you, Clue! more Hi, we really appreciate you taking the time to write such a positive and thoughtful review. Thank you for sharing what you find useful, it's really helpful to hear what does work for users of the app. I have shared this with the rest of the team, it will make their day! We’re really excited about what’s coming up in the future for Clue and we can't wait to bring more features and functionality to our users. Thank you again, Rhiannon from Clue. more"
    },
    {
      "user": "Panorainian",
      "date": "02/11/2021",
      "title": "5 Stars",
      "review": "This app is literally the best period tracker I’ve ever had. I started using it just over a year ago(ish), and it’s truly been helpful. I added in my past periods from another app and that helped a lot with it being able to always be spot on for my days. One thing I would recommend, is having a “Notes” section for days. I feel like that would be nice because I can remember why I didn’t take my BC (birth control) at a certain time and I can work on being more on time with it. It’d also be nice to keep track of other things in there, such as “my cramps were this bad today because xyz.” And instead of using just the cramps button, I can make a note of how bad or mild they were on which days so I can expect it for next time. I also feel as if it would be easier when talking to an OB/GYN about my periods because my cramps can sometimes be too horrible to the point I can’t even get up and out of bed (the top reason why I’m even taking it - and how irregular my cycle was before). A couple months ago I got the subscription to Clue, and it’s even better than I imagined! I enjoy getting the articles for what I feel on my period; certain emotions, why my cramps can be killer, etc. I’d definitely recommend this app to all my fellow friends. 💕 more"
    },
    {
      "user": "dhakdlowlq",
      "date": "08/25/2021",
      "title": "Great, if you're just menstruating\n\n    Developer Response",
      "review": "I like this app. I just started using it maybe 7 months ago, and even though I only had three pretty irregular periods, I was pleasantly surprised at how accurate the ovulation and period predictions were. It only took the first cycle for the next predictions to be shockingly accurate. It was very nice to have a discrete little banner warning me that my period was supposed to start soon. I love all the symptoms we can track, and the cycle analysis over time. Overall I would like to say I love the app. But I can't. Because I'm now pregnant, and there's no way for me to change my life stage to \"pregnancy\" from \"menstruating\" without signing up for Clue Plus. I understand and accept that Clue wants us to pay for the pregnancy information, but I don't understand why I can't even change my status (and effectively put my cycle on \"pause\") until I give birth. I feel disappointed that this excessively long \"cycle\" could skew the information they collected from the previous ones, making my predictions less accurate for a long time postpartum. I can't imagine how much more disappointing this would be if I had been using this app for longer. I also think it would help to add a \"postpartum\" or \"breastfeeding\" life stage, since you aren't pregnant anymore but those situations still effect if/when you menstruate. more Hello, thanks for leaving us this review. Our pregnancy tracking mode is a paid feature, but we do offer a 7-day free trial where you can test it out and see if you find the content and tracking useful (it comes with tons of guided content, painstakingly written and fact-checked by our science team, as well as a whole suite of pregnancy-specific tracking features). We also have a post-partum life stage you can choose. If you prefer not to join Clue Plus, you can also exclude a cycle in the analysis tab so your data isn’t skewed. Hope this helps! Feel free to write us from the app or from support.helloclue.com if you have questions. Ilaria more"
    }
  ],
  "compatibility": [
    "iPhone"
  ],
  "size": "270.6 MB",
  "category": "Health & Fitness",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information\n                Infrequent/Mild Mature/Suggestive Themes",
  "languages": "English, Danish, Dutch, French, German, Hindi, Indonesian, Italian, Japanese, Norwegian Bokmål, Polish, Portuguese, Russian, Simplified Chinese, Spanish, Swedish, Thai, Traditional Chinese, Turkish, Vietnamese"
}