{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "OpenEvidence 17+",
  "subtitle": "Clinical Decision Support",
  "seller": "Xyla, Inc.",
  "stars": "5.0",
  "rating": "404 Ratings",
  "price": "Free",
  "appDescription": "OpenEvidence is the world’s leading AI-powered medical information platform, providing health care professionals with accurate and efficient answers at the point of care. Every answer on OpenEvidence is always sourced, cited, and grounded in the peer-reviewed medical literature. • 160 medical specialties • 1,000+ diseases and therapeutic areas • 1m+ medical topics Trusted by medical professionals at 7,000+ care centers across the US and by clinicians in over 185 countries. OpenEvidence is only available for health care professionals. Users must verify their health care professional status before using OpenEvidence. AS SEEN IN Forbes: “OpenEvidence Keeps Doctors Up To Date On The Latest Science” TESTIMONIALS “I've been using OpenEvidence for the last week - it has been amazing! Able to narrow down on results quickly and find information that I wasn't able to do with Google/PubMed searches on my own.” - Dr. John Lee, MD. Physician & Faculty Member, Harvard Medical School “OpenEvidence can be the foundational technology to power all clinical decision tools.” - Dr. Antonio Jorge Forte, MD. Director of MayoExpert, Mayo Clinic “OpenEvidence is more up-to-date than UpToDate. And more useful regardless, since it’s interactive, and you can ask it questions, and get very specific answers about specific medical fact patterns in a patient case. It’s like having a curbside consult with a team of expert physicians, but that you can carry around with you in your pocket.” - Dr. Ram Dandillaya, MD. Clinical Chief, Department of Cardiology, Cedars-Sinai Medical Center “I am in community practice and medical director of a community cancer center. OpenEvidence has been an incredible lifeline for daily practitioners.” - C.J., Oncologist “OpenEvidence is absolutely fantastic. I use it a gazillion times a day.” - J.A., Neurologist “OpenEvidence’s efforts to make medicine more evidence-based are invaluable. The shift from judgment to calculation can reduce the level of noise currently found in medicine.” - Daniel Kahneman, Nobel Prize Laureate (In Memoriam) “It is light years ahead of the next best medical oriented AI I have used.” - R.E.., Oncologist STAY SHARP & UP-TO-DATE • Find what you need, when you need it on a mobile-native platform. • The world’s most powerful medical search engine at your fingertips. • Discover and find exactly what you are looking for with deep search and a highly intuitive user interface that understands you and what you are asking. more",
  "reviews": [
    {
      "user": "Nine and wine",
      "date": "09/26/2024",
      "title": "Revolutionary and disruptive tech",
      "review": "I have been using this platform for over 6 months now, and it is both revolutionary and disruptive. Whether updating medical knowledge or searching for actionable up to date treatment plans, this AI reference is invaluable and beyond game changing. My patients (and myself) benefit from its powerful results on a daily basis. The answers are both thorough and accurate with extensive reference if you are an AI naysayer. Only negative I can synthesize is clinicians could be rendered obsolete with this phenomenal technology. In its current iteration, this tool is an invaluable adjunct to modern day medical practice. Adopt it or be left to perish! Much gratitude and many thanks to all who have made this technology readily available to all medical professionals and at no monetary cost. Truly amazing. Keep up the stellar work! more"
    },
    {
      "user": "Joki54321",
      "date": "08/16/2024",
      "title": "Game-changing app!!",
      "review": "Fantastic app! Provides accurate and very helpful answers for an enormous variety of clinical questions. Incredibly helpful to support my patient management. I didn’t notice any hallucinations so far - this makes Open Evidence much more trustworthy than other apps, including ChatGPT and other competitors. Sources including guidelines are very well selected and the list of used references is fantastic. Really a game changer to improve the daily work flow of a physician like me! more"
    },
    {
      "user": "JXuKitty",
      "date": "08/19/2024",
      "title": "Amazing!!",
      "review": "Great app! It’s super easy to use and super educational, and i always get quick, helpful answers. It also gives sources if you wanna dive deeper. it’s honestly become my go-to for medical stuff. highly recommend it to anyone who wants a bit of peace of mind or honestly a bit more info on everyday medical questions. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch"
  ],
  "size": "27.7 MB",
  "category": "Medical",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English"
}