{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "ESC Pocket Guidelines 12+",
  "subtitle": "",
  "seller": "ESC - European Society of Cardiology",
  "stars": "4.8",
  "rating": "720 Ratings",
  "price": "Free",
  "appDescription": "The ESC Pocket Guidelines app is now a CE-marked medical software device. The App now contains the following ESC Pocket Guidelines: Acute Coronary Syndromes (ACS) Acute and Chronic Heart Failure (HF) Adult Congenital Heart Disease (ACHD) Elevated blood pressure and hypertension (HTN) Atrial Fibrillation (AFib) Cancer Treatments and Cardiovascular Toxicity (Cardio-Onco) Cardiac Pacing and Cardiac Resynchronization Therapy (Pacing) Cardiovascular Diseases during Pregnancy (CVD Preg) Chronic Coronary Syndromes (CCS) CVD Prevention in Clinical Practice (CVD Prev) Diabetes, Pre-Diabetes and Cardiovascular Diseases (DM) Dual Antiplatelet Therapy (Focused Update) (DAPT) Dyslipidaemias (Dyslip) Fourth Universal Definition of Myocardial Infarction (UDMI) Endocarditis (Endocarditis) Myocardial Revascularization (MR) Non Cardiac Surgery (NCS) Peripheral arterial and aortic diseases (PAAD) Pulmonary Embolism (Acute) (PE) Pulmonary Hypertension (PH) Sports Cardiology (Sports) Supraventricular Tachycardia (SVT) Syncope (Syncope) Valvular Heart Disease (VHD) Ventricular Arrhythmias and Sudden Cardiac Death (VA+SCD) The ESC Pocket Guidelines app also contains numerous interactive tools, i.e. algorithms, calculators, scores and clinical decision support (CDS) tools. CDS tools are software instruments that guide physicians step-by-step through fulfilling guideline recommendations in specific patient cases. The ESC Pocket Guidelines App also provides dedicated folders for easy access to ESC Essential Messages. Additional features: Perform „full text\", „index\" or „filtered\" searches through the entire content of the app and the notes. Bookmark specific sections or create a personal note and access bookmarks and notes from the „My Library“ section. Share links to specific areas of the app via communication channels, e.g. AirDrop, Mail, LinkedIn, Twitter. Print or generate PDFs of specific sections. Please follow the link below to register for a new MyESC account: https://escol.escardio.org/MyESC/login.aspx more",
  "reviews": [
    {
      "user": "saud sherwan",
      "date": "08/19/2022",
      "title": "Special thanks",
      "review": "Special thanks for valuable precious information with special app for better practice"
    },
    {
      "user": "Phildius",
      "date": "05/04/2020",
      "title": "Great App, pale aftertaste",
      "review": "Great app, no question. Only Four stars because - the app as well as the work of esc is sponsored by the pharmaceutical industry and - there even is a pop up banner to advertise for the companies. Medical guidelines and there publication should be independent from medical companies! more"
    },
    {
      "user": "Brupom",
      "date": "09/14/2017",
      "title": "BruPom1959",
      "review": "Really like the info on the app, but the app keeps crashing on iPhone devices !!! Please fix !!"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "380.6 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Alcohol, Tobacco, or Drug Use or References",
  "languages": "English"
}