{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Allē 17+",
  "subtitle": "Aesthetics Loyalty Program",
  "seller": "Allergan, Inc.",
  "stars": "4.9",
  "rating": "11.4K Ratings",
  "price": "Free",
  "appDescription": "Allē is your go-to app for your aesthetic needs, giving you access to curated content, treatment information, exclusive offers, and your Allē Wallet. With Allē, you can earn and save on aesthetic products and treatments at your participating provider. Allē’s app gives you access to all that Allē offers, including Allē Flash, which enables you to scan for a surprise offer while at your provider’s office. Simply log in to your Allē Account within the app and you’re all set. Or, download the app and create a new account in a few simple steps. Now, let’s see what’s inside. With the Allē app, you can: Scan for Surprise Savings In-Office: Earn a surprise offer at your Allē provider’s office. Just scan the Allē Flash QR code when you arrive, and you may receive an additional offer that can be redeemed instantly. Browse Offers from the Palm of your Hand: Take advantage of exclusive offers for Allē Members that you can redeem right away. Read up on the Latest in Aesthetic Treatments: Learn about products and treatments that might be right for you. Search for Allē treatments and browse educational articles within the app. Access your Wallet in a Few Taps: Check your point balance and your membership status, view your transaction history, available offers, and more. Purchase and Send Gift Cards to other Allē Members: Never worry about losing a gift card again. Allē’s digital gift cards are added directly to your Wallet upon purchase and can be easily gifted to other Allē Members. The Allē app makes it easier than ever to manage your aesthetics rewards. It’s all just a tap away. Download today. Instagram: @Alle Facebook: @Alle more",
  "reviews": [
    {
      "user": "njgurl13",
      "date": "10/03/2023",
      "title": "Update: Since the latest update it is now working again, thank you\n\n    Developer Response",
      "review": "It was working well for me until this last update. Now, altho it shows a history category, and I’ve used it previously, it no longer works. I need it to know when to make my next appointment, please fix this! more We're grateful for your feedback and we're happy to hear that you've had a positive experience with Allē! If you have any questions or wish to share additional feedback, feel free to reach out. Our number is 888.912.1572 and we're available M - F, 8 am - 6 pm CT. more"
    },
    {
      "user": "Kk_katers",
      "date": "03/29/2023",
      "title": "Horrible new program and app\n\n    Developer Response",
      "review": "The old program was great. If you were in your 20s and a Botox user only, you got bonus dollars after so many treatments and maintained A-list or whatever the top tier status was pretty easily. Now, unless you do several Botox appointments in the year, only treating one area at a time, it’s next to impossible to maintain A-list status. The new program is designed to force people to use fillers to meet their point requirements when there’s lot of people who don’t want fillers. Oh and did I mention what their new top tier status called A-list gets you. NOTHING! No more bonus dollars, no more perks, all gone. Just non-expiring points, which I was just told is also a lie even though their terms and conditions say points don’t expire, I’ve been an A-lister for years and apparently my points expire. The app is crap as well, you can’t can’t see this new expiration detail, you can’t see if and when your A-list status was renewed or extended another year, there’s no customer service by email. Only phone # and a basic M-Fr 8-5hrs when EVERYONE else in the U.S. works and when you do reach someone they give you different answers, which is why I prefer email to provide proof of what was told to me. Just another money hungry company, finding ways to lose customers. Wonder how far they will take this crap of a program and app before they lose so many customers they bleed dry in money. more We're sorry to hear that you had a bad experience with Allē. We would like the opportunity to resolve this matter for you. Please give us a call at 888.912.1572 M - F, 8 am - 6 pm CT. more"
    },
    {
      "user": "cantwait2retire",
      "date": "10/10/2023",
      "title": "Issue with App\n\n    Developer Response",
      "review": "9-23 - Still won’t open. The app was working perfectly until the latest update. I’ve deleted it numerous times and reinstalled it along with shutting down my iPhone 14 Pro Max. I just get a blank screen. Nothing comes up. When it works it’s great. I did call the company and sent a screenshot. I purchased the iPhone 15 Pro Max and it doesn’t work on this phone either. The company has been wonderful and reached out to me and they’re still trying to figure out the issue. Today is October 10 and it still doesn’t work. I’m giving them 3 stars right now because the company is really trying. Once it works they’ll get a 5 because they have tried more than any other company that I’ve dealt with since I’ve had the iPhone 3S. Thank you. more Thank you for taking the time to share your experience with us. We want to make this right, so please give us a call at 888.912.1572 M - F, 8 am - 6 pm CT. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch",
    "Apple Vision"
  ],
  "size": "71.6 MB",
  "category": "Medical",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English"
}