{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "MyQuest for Patients 12+",
  "subtitle": "",
  "seller": "Quest Diagnostics, Inc.",
  "stars": "4.6",
  "rating": "179.7K Ratings",
  "price": "Free",
  "appDescription": "Take control of your health. With the MyQuest app from Quest Diagnostics, all your lab results and appointments are at your fingertips – so you have the information you need to stay healthy: • View your lab results securely and quickly • Find nearby Quest locations that are convenient for you • Schedule and manage your appointments • Manage the health of your loved ones with MyCircle • Browse and buy your own tests with QuestDirect • Share your health information with your healthcare providers • Integrate your results with Apple Health Did you know that people are more likely to know their WiFi password than important health information, such as their blood type, cholesterol, and blood sugar levels? Take control of your health with the MyQuest app, and view your lab results, manage appointments, and more, all in one place. Download MyQuest today to get access to an all-new way to manage your healthy journey with Quest. more",
  "reviews": [
    {
      "user": "Stubbs Mackenzie",
      "date": "07/15/2024",
      "title": "Have seen a lot of improvements overall",
      "review": "*Updated to say things run much more smoothly. Using the app was actually quite smooth, and enjoyable. Thank you for your dedication to your patients in this regard! If the tooling for insurance plan lookup was a bit easier to manage on mobile this would be a perfect app. Thank you again! —previous review— I frequently use the MyQuest app and prefer my local Quest over any other lab draw place. I’ve seen this app go from being clunky to reliably responsive now, and there is less lag on loading results or flipping between screens (home, to MyQuest, etc). I especially love that the attached results in MyQuest now have reference links. The one caveat now is that those links do not give you the option to open them in the default, or chosen browser, on the device. Additionally, and this is more feedback for the way results are entered into the database, but any tests done at Quest for a provider that faxes, or sends via portal should be shown in the user’s results page. I think it seems assumed that the person may have access via a MyChart or other patient portal access account but it is nice, for consistency, to see all results from any provider in that page. Thanks for continuing to improve the app! more"
    },
    {
      "user": "33florida",
      "date": "03/16/2023",
      "title": "It only takes one person to make the experience uncomfortable",
      "review": "I have always have no problem at my every 12 weeks appointment but in this case it was a late doctor appointment and I needed to get my blood drawn but it took this one rude nurse to make my experience unhappy and a bit angry when she told me after a few hours being here as a walk in. This time it was different I know I was a walk in but I needed to have my hemoglobin checked because if it was even lower I would have to go to the hospital and get a couple of pints of blood. I wanted all day that they were open to find out because of them being behind they where behind schedule Finally at 20 minutes to 3 one of the other nurses explained to me that they need that extra 20 minutes to finish paperwork to get blood samples out. That I understood but the nurse that was so rude and kept saying that they are not taking any walk ins. So she could have explained this and what they had to do then I wouldn’t have spent about 6 hours there. But I didn’t have to spend my entire day there without eating and just sips of water. I don’t know her name but she has red hair and freckles and fair skin, so I would like to know her name. They have been always good with no complaints and that is why this is my favorite quest in Ellenton florida more"
    },
    {
      "user": "SweetestPea81",
      "date": "01/18/2024",
      "title": "Convenient and useful",
      "review": "I only gave 4 star because the app doesn’t save my insurance information nor my sponsor’s information. Perhaps a security thing, but when you check my military I.d. It would confirm I am who I say I am. It is convenient because I can see my lab results and formulate relevant questions for my doctors. I like that I get my labs not just my doctors… so I’m not waiting to find out… I already know and can make my own suggestions. It is pretty user friendly. If there was anything I say needs improving, it would be a guide for those who have never used the app before to know what information goes where… as a healthcare professional some people need more assistance that others. It may seem self explanatory but when you go to the app you are not automatically logged in, and people set up appointments only to realize they were never logged in. But reassurance that it isn’t lost, they just need to log in is comforting. I help patients to navigate the app when they ask, but maybe there’s a way to incorporate a reminder to sign in before scheduling. Otherwise I like the app, been using it for several years, and I have various doctors so, it again is convenient and easy to access lab results once they are ready! more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "32 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English"
}