{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Baby Tracker - Newborn Log 4+",
  "subtitle": "Feed Sleep Diaper & Milestone",
  "seller": "Nighp Software LLC",
  "stars": "4.8",
  "rating": "212K Ratings",
  "price": "Free",
  "appDescription": "Introducing the redesigned Baby Tracker app version 4, the all-in-one scheduling resource for new parents. Baby Tracker features native user interface for both iPhone and iPad, and is the only log for your baby’s health that allows syncing among multiple devices without compromising your privacy. Designed by busy parents, for busy parents, Baby Tracker offers a simple, streamlined way to track your baby’s daily habits, health, and exciting “firsts” of those precious early days and months. Record feedings, diaper changes, and sleep patterns with a quick one-handed tap, then feel free to go back later and add details and even photos. Baby Tracker makes it simple to track all of your child’s important information for doctors and caregivers, as well as share all the exciting milestones of his or her development with friends and family. Perhaps most importantly, Baby Tracker handles all the details so you never have to take significant time away from the joys of parenting. Comprehensive Feedings Tracker * Start and stop nursing timer with one tap for convenience and accuracy * Settings for nursing, formula, solids, or any combination. * Track time nursing per breast and total for full nursing session * Tracks pumping totals as well as feedings * Notes section allows you to enter details on formula brand, preferences, or allergic response Track Diaper Changes * Summary screen shows time of last changing, along with feedings, and sleep schedule * Accurate records mean faster response time for concerns like dehydration, constipation, or diarrhea * Easily share documentation on bowel habits with doctors or caregivers Sleep Schedule * Know exactly the date that your baby starts sleeping through the night * Recognize nap time and nighttime sleep patterns to better plan your day or share with caregivers * Compare against other data to more easily track down potential causes for baby’s fussiness * Set alarms for putting baby down or to create more structured nighttime feeding sessions Growth Records * Enter measurement data and compare against World Health Organization averages * See baby’s progress and growth over weeks, months, and years * Look at logs to compare them for a more comprehensive overview of your baby’s health and wellbeing. Milestones * Make custom categories for baby’s first smile, first tooth, or first step * Snap a picture on the spot, or add one from your existing library * Use photos for a gallery-style album of baby’s goals and achievements * Create an entry with a quick tap, or include journal notes for more detail Health * Log medical history such as medications, vaccine shots, and temperature checks Data Interpretation * View logged data by day, week, or month * Shows previous 7 days and previous 30 days * Quickly identify data patterns, habitual trends, or abnormalities * Export data via email as a PDF * Print directly from app to add physical copies to your personal records Data Sync and Auto Backup * Works with iCloud or Dropbox for secure, cloud-based auto backup * Sync data among multiple devices for all caregivers or easy sharing of your baby’s progress with others * Clone data to another device using AirDrop for a fast transfer that doesn’t eat up your data plan more",
  "reviews": [
    {
      "user": "98PeterProyas98",
      "date": "11/05/2017",
      "title": "Love it",
      "review": "I think they have thought of everything when developing this app. You can tell parents developed this and that they really considered every last bit of information new parents might want. Especially helpful is the fact that my husband and any other caretakers can also download the app and be on the same account. This way, while I'm at work I can see the baby's activities including when and how much she took her bottle, when diaper changes occurred and their condition, when she napped, and really anything else the caretaker wishes to log. It's really helpful in discovering patterns in baby's eating, sleep, and other behaviors. Also helpful when trying to remember when something last happened (say the doctor wants to know when the last dirty diaper was), you don't have to remember because you can look. One suggestion I would make is to add a feature for tracking and reminding mom's medications. Having had a c-section, aside from having to keep track of everything to do with baby, I also had to keep track of my own pain management meds. It would have been nice to just track them in the same app where I tracked baby. Perhaps it could be a feature you turn on in settings to use while needed and then turn off once it's no longer needed so it's not bogging down the main entry page once mom is healed. However, this critique isn't enough to lessen my love for this app- it would just be an amazing above-and-beyond feature. Thank you for this app! more"
    },
    {
      "user": "Dawnkay",
      "date": "03/21/2017",
      "title": "A newborn necessity",
      "review": "I don't write reviews, but this app is a must have with a newborn. We have only been using it for the past 4 days but it has added some organization and sanity to our lives. Our son had jaundice and we needed to pay attention to what kind of diapers and when/how much he was feeding. Being so exhausted, it is easy to not pay attention to what time the baby ate last or was changed last. I remember at my last appointment I was trying to calculate how often the baby fed and how much etc. I'm ready for our 1 month appointment now. I can literally show his doctor how often he eats, is having wet/dirty diapers, and how much he is sleeping. I tried writing all this down on a log, but we kept forgetting to do it and was guesstimating times. At 4 am in the morning I can just press the plus sign and log how much and it records the time etc. I haven't played with too many features, but have noticed you can log activities like tummy time, the babies weight/ length. I love that there is a chart to see where he is on the charts with growth. I wish I had looked or found an app like this with my last baby. I also love that this app doesn't cater to just breastfed babies or formula fed, but both. This is also great for moms supplementing as they can log both very easy. It gives an option to log pumping sessions as well. You can also add notes with all of your logs. more"
    },
    {
      "user": "Hannahhhh::",
      "date": "07/30/2023",
      "title": "Necessary for a newborn!",
      "review": "Absolutely love this app! I used it with my last and the day my next was born, I went searching for it again. It’s made all of his doctors appointments a breeze— I can tell them when his last weigh was and how much, exactly how many diapers a day, exactly how often he feeds and for how long. It helps me keep track of how long it’s been since my sense of time is off kilter at the moment. I’ll think it’s been an hour since I’ve pumped but it’s been three so it’s nice to have that- for all of logs, not just pumping. This app is incredibly customizable. You can add notes to every log, adjust everything about a log after it’s put in, and even make your own “milestones” which I use to track when I’ve given medication. If you’re pumping and supplementing, it keeps track of how much milk you have in reserve and you can edit this number manually in case of spills, etc. My only critique is that there is no good way to log collected milk, as in using wearable milk collectors throughout the day like my Boons. I’m currently logging that milk as part of the next pumping session but I don’t love that solution as it makes it look like I pump way more than I do. Another option would be to manually adjust my milk store but then that milk wouldn’t get counted in the day’s input statistics. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Apple Watch",
    "Apple Vision"
  ],
  "size": "105.2 MB",
  "category": "Medical",
  "ageRating": "4+",
  "languages": "English, Dutch, French, German, Italian, Japanese, Korean, Portuguese, Russian, Simplified Chinese, Spanish, Swedish, Traditional Chinese"
}