{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "MDLIVE 17+",
  "subtitle": "Virtual Doctor Visits 24/7",
  "seller": "MDLIVE, Inc.",
  "stars": "4.7",
  "rating": "87.9K Ratings",
  "price": "Free",
  "appDescription": "Have an MDLIVE virtual doctor visit with board-certified physicians from the comfort and convenience of your own home or from wherever you are, whenever you want – nights, after hours, weekends, and holidays. MDLIVE also offers behavioral health appointments with licensed therapists and board-certified psychiatrists as well as dermatology services. You can schedule an appointment at a time and day that's convenient for you or have an on-demand visit in around 15 minutes. All MDLIVE doctors are board-certified and state-licensed, with an average of 15+ years of experience. MDLIVE has two National Committee for Quality Assurance certifications and is accredited by the American Telemedicine Association. MDLIVE doctors are also friendly, caring, compassionate, and experts in conducting virtual medical consultations. And best of all, 9 out of 10 people would recommend us to their friends and family members in need of a doctor's visit. Great reasons to use MDLIVE virtual doctors: 1. You're not feeling up to leaving home 2. You want to avoid the high cost of Urgent Care or the ER 3. Your doctor isn't available 4. It's after hours, the weekend or a holiday 5. You need a short-term refill on a prescription 6. It's hard to get to the doctor's office 7. You don't want to take time off work or be away from home MDLIVE doctors treat more than 80 non-emergency medical conditions like these: • Allergies • Back Pain • Bronchitis • Common Cold • Constipation • Cough • COVID-19 Assessment • Diarrhea • Ear Infections • Flu • Headache • Nausea • Pink Eye • Rashes • Respiratory Problems • Sinus Infections • Sore Throat • Strep Throat • Urinary Tract Infections (Females 18+) • …and more We also offer treatment and support for a wide variety of behavioral health issues: • Addictions • Anxiety • Bipolar Disorder • Depression • Grief and Loss • LGBTQ+ Support • Life Changes • Men's Issues • Panic Disorders • Parenting Issues • Postpartum Depression • Relationship Issues • Stress Management • Trauma and PTSD • Women's Issues • And more MDLIVE provides the ability for Virtual Primary Care patients to connect with FDA-cleared medical devices and securely share their data with their MDLIVE Care Team and Primary Care Provider. Although the data is not actively monitored, it is carefully reviewed during subsequent follow-up visits. At these visits, healthcare providers utilize their clinical judgment to effectively manage the patient's condition and treatment plan in accordance with established clinical guidelines. It is important to note that MDLIVE does not support individual usage without the consent and support of a healthcare provider. Therefore, users must always consult with their healthcare provider before making any changes to their care plan, ensuring that their treatment aligns with the appropriate clinical guidance. We treat thousands of people a day with many different conditions, but you should not use MDLIVE if you are experiencing a medical emergency. In addition, we don't treat sexually transmitted diseases, urinary tract infections in males, or urinary tract infections in females under 18 years of age. MDLIVE also cannot treat children under 3 with a fever and children under 12 with ear pain. Copyright © 2023 MDLIVE, Inc. All Rights Reserved. MDLIVE may not be available in certain states and is subject to state regulations. MDLIVE does not replace the primary care physician, is not an insurance product, and may not be able to substitute for traditional in-person care in every case or for every condition. MDLIVE does not guarantee patients will receive a prescription, does not prescribe DEA controlled substances and may not prescribe non-therapeutic drugs and certain other drugs which may be harmful because of their potential for abuse. MDLIVE and the MDLIVE logo are registered trademarks of MDLIVE, Inc. and may not be used without written permission. For complete terms of use, visit www.mdlive.com/terms-of-use more",
  "reviews": [
    {
      "user": "Cocomint 3",
      "date": "08/19/2019",
      "title": "Video therapy sessions\n\n    Developer Response",
      "review": "This is my third time using the MDLIVE for my therapy session. At first I found the technical aspect of learning how to navigate the website very challenging. I had difficulty understanding how the whole thing worked there were no instructions on how to get to the therapist and how to handle technical issues on my IPhone. I found that I needed to remember to refresh my screen every five minutes or the picture would freeze. Or to turn off my notifications or the picture would freeze up or go black. Then you would have to hit the exit app button on the phone. Also, turn off your smart watch or the audio will go to it. Actually it’s better to just turn off your Bluetooth altogether for a video chat. I love the two therapists that I have. They’re very professional and were quick to make me feel comfortable. They asked smart questions and were attentive when I answered them. They gave me exercises that were easy to do and challenging. I think that 45min is not enough time for the first two sessions. I had so much trauma in the past that once I got started it was hard to stop talking in the 45 minutes allowed. I think a wider assortment of specialists is needed. This should be expanded once the kinks are worked out. I love the fact that I’m safe at home when I’m talking about my trauma and that I don’t have to drive home with tears running down my face trying to drive while trying to get myself together. That’s the best part. more We appreciate you taking the time to post your feedback! It pleases us to know you had a great experience and we look forward to serving you again in the future! more"
    },
    {
      "user": "elainefin",
      "date": "02/05/2021",
      "title": "Excellent service.\n\n    Developer Response",
      "review": "First, a 10 minute wait to see a doctor is unheard of today. It was eight minutes. Second, this doctor actually read my chart and the notes before he came online. That was another first in my experience. Third, he asked the best questions. He asked questions directly related to what was happening to me and what had happened in my recent history that was associated to this call. Fourth, I have a condition that is worsening. He actually broached that fact and the fact that I really need to see a specialist and what the consequences for me are short term and long term. My own PC will not talk to me about my condition. Fifth, he offered an alternative medication that has not been tried and I’m excited about using this med as a short-term treatment until I can see a specialist. Sixth, when he wished me well and hoped that I would feel better soon, it was authentic. He actually hopes that I will get relief and get back on my feet shortly. That was absolutely unique. I don’t know if every doctor in the service is as good as Dr. Lynn, but if they come close, they are better than the majority of doctors out there these days in my experience. more Thank you so much for your review! We're glad we could help you get the care you needed from the comfort and safety of home. more"
    },
    {
      "user": "Your Friend in the USA",
      "date": "03/20/2020",
      "title": "Not Reputable\n\n    Developer Response",
      "review": "I tried to get an appointment at 8PM last night but didn’t understand the process and finally scored an appointment at 9:56PM last night. They said it would be a 3 hour wait. I got a call every 30 minutes asking if I wanted to cancel my appointment- until about midnight. I thought they would call but finally fell asleep. I woke up about 6AM and checked the app for my wait time. It said 15 minute wait. After 20 minutes I checked again to see my wait time. It became a 30 minute wait time ... so I called customer and got through. (Something I had not been able to do since making an appointment) and there was a nice man named James who apologized profusely about 9 hour wait. He then recommended I schedule a time appointment (why couldn’t I do that in the first place) for 12:30 - which would be quicker than a next available. Oh my word! So I decided to do it anyway since I was still having symptoms even though I was feeling better. I got a call back 10 minutes later saying there was a mistake and the doctor couldn’t do it over a text gone call. Had to be video chat so now they were rescheduling until 4:30PM - you know, right about the time pharmacies are closing because of Corona. I decided to take it anyway. Finally feel better and just canceled. I completely understand that there are back ups due to Corona but my wait time was completely ridiculous and they did not handle this in a professional way. They are not reputable in my opinion. more Please accept our apology for your frustration. Requests for virtual health care have increased significantly due to the spread of COVID-19. As a result, wait times to see an MDLIVE doctor may exceed our usual 15 minutes in some parts of the country. Our doctors are working hard to address all patients as quickly as possible while maintaining our high standard of care. If you have questions or concerns, please contact customer service at (800) 400-6354. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Apple Vision"
  ],
  "size": "95.9 MB",
  "category": "Medical",
  "ageRating": "17+\n                Infrequent/Mild Alcohol, Tobacco, or Drug Use or References\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English, Spanish"
}