{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Clinical Sense 17+",
  "subtitle": "Improve your diagnosis skills",
  "seller": "Medical Joyworks LLC",
  "stars": "4.8",
  "rating": "189 Ratings",
  "price": "Free",
  "appDescription": "Fun interactive clinical cases. Improve your diagnostic skills and strengthen your fundamentals with up-to-date content. Build the confidence essential for your career. With Clinical Sense, you can improve your ability to appropriately manage a patient over time: from presentation, to admission, to discharge and follow-up. Assume the role of a physician navigating a plethora of challenging clinical situations and make critical medical decisions in real time. Clinical Sense is designed for practicing physicians, medical students, nursing professionals, and other healthcare practitioners who want to learn and have fun while doing so. After all, practice makes perfect; and practice can be fun! Our scenarios offer a wide range of medical specialties, which can be played in minutes. They are also accompanied by a concise yet comprehensive discussion of the diagnostic reasoning, including insights into the ideal management of complications that may arise. The scenarios in this award-winning app are all based on the actual case-management experiences of more than 200 physicians across 30 specialties from all over the world. New scenarios are released every week, often in keeping with global endemic and epidemic trends, to help you brush up on the management skills that are the need of the hour! Achievements: • #1 ranked app in 40+ countries. • Top ranked free medical app in 120 countries. • 1,000,000+ downloads worldwide. more",
  "reviews": [
    {
      "user": "J.K.Rob",
      "date": "08/31/2020",
      "title": "unique and helpful app\n\n    Developer Response",
      "review": "This app takes you step-by-step through various patient encounters almost like a game, which is a fun change-up from just reading. When simply reading about a topic, it’s hard to retain everything. There’s also a difference between understanding the material and knowing exactly how to put it into practice. This app help you learn the material AND grasp how to apply it in clinical settings. They already show lab results, but I haven’t seen imaging results, and that would be helpful. Other nice additions would be more questions about what the differential diagnosis is and what history questions and physical exam components you’d add. Basically, more questions would help me think even more critically through the process. Thanks for a fun, helpful app! more Hello J.K. Rob, Thank you for your wonderful and encouraging feedback. We really appreciate you taking the time out to share your experience with us. I've already forwarded your suggestion to our development team for their attention. Over the last few months we’ve been removing scenarios and updating them to ensure their quality and relevance. However, now all our apps are available as a single product: Clinical Odyssey, please visit https://www.medicaljoyworks.com/ to find out more. Hope you'll continue enjoying our products. Regards! more"
    },
    {
      "user": "Nickshdjdkdjkandnn",
      "date": "01/27/2022",
      "title": "AMAZING!!!\n\n    Developer Response",
      "review": "I’ve never written an app review before, but I thought that this app deserved it. It’s an amazing app and realistic. I’m an aspiring doctor and I have learned so much from this app. It’s the best medical app I’ve downloaded. This app makes learning fun and exciting plus it’s realistic. I love everything about this app. I also love that it is kept updated. They come out with new cases weekly. Sometimes it’s even a couple times a week. I have no complaints. I love all medical joyworks apps including Prognosis. These apps were very well done and I never get old playing them. I’ve had both apps for years now. Thank you for such amazing apps! more Hi Nickshdjdkdjkandnn, thank you so much for taking the time out to share your wonderful thoughts with us. We're pleased to hear that our apps are useful to you. Now all our apps available as a single product: Clinical Odyssey with 700+ learning modules. There is a lot to learn there. Simply visit https://clinicalodyssey.com/ to find out more. Hope you'll continue enjoying our apps. Regards! more"
    },
    {
      "user": "soldierDoc2",
      "date": "05/07/2021",
      "title": "Scenarios not always in line with recommendations\n\n    Developer Response",
      "review": "It’s a great little Ap to catch a quick review, but be cautious as some of the treatments in the scenarios are not in line with current recommendations. For example, the scenario with cat scratch disease (Bartonella) recommended withholding antibiotics despite the patient having over a week of fever and lymphadenopathy. The scenario also recommended a lymph node biopsy with PCR testing to confirm the diagnosis despite a very clear history. The research on antibiotics vs no antibiotics is pretty clear and the expert consensus is that any patient with a clear history and lymphadenopathy be treated with azithromycin. The consensus is that lymph node biopsy should be reserved for cases that do not respond to appropriate antibiotics. UpToDate has a great review of cat scratch disease. more Hi soldierDoc2, we are glad you enjoyed the app. Thank you for sharing your recommendations re: the cat scratch disease scenario—I have passed them on to our editorial team. Please note: our editors keep updating our scenarios to be in line with the latest reviews and clinical guidelines. Unfortunately, the vast breadth of our catalogue (700+ learning modules across multiple apps) means that this takes time. We hope you continue to enjoy our apps! more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "70.1 MB",
  "category": "Medical",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information\n                Infrequent/Mild Alcohol, Tobacco, or Drug Use or References",
  "languages": "English"
}