{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Contraction Timer & Counter 9m 4+",
  "subtitle": "Track labor contractions",
  "seller": "Aleksei Neiman",
  "stars": "4.8",
  "rating": "55.1K Ratings",
  "price": "Free",
  "appDescription": "*** Most downloaded Contraction Timer app in the world! Number 1 in the USA, UK, Australia, Canada, Italy and elsewhere! *** This is the simplest-to-use contraction timer. The app will help to track your contractions and determine when it's time to go to the hospital. If you plan on having a home birth, the app will tell you what stage of labor you are in at any given moment. Keep track of your labor by tapping a single button at the start and at the end of each contraction. The Contraction Timer analyzes the duration and frequency of contractions and will notify you when it's time to go to the hospital. Thousands of pregnant women around the world have become mothers using our app. Always consult your doctor to orient yourself in terms of contraction frequency and duration. This app is not a medical device and our recomendations are based on standard indicators. Your labor may occur differently. Therefore, do not rely exclusively on our app. If the duration and frequency of contractions do not yet correspond to the necessary indicators but labor pains become unbearable, it is better to go to the hospital as soon as possible rather than give birth at home or on the way there. Trust what your body is telling you. If you have any questions or suggestions, please email us at neumandev@gmail.com. Your feedback is very important to us. more",
  "reviews": [
    {
      "user": "Verelenica",
      "date": "06/06/2022",
      "title": "Amazing app",
      "review": "This is an amazing app! I was notified when to pack my hospital bags and within hours when to go to the hospital. I loved the ability to delete a contraction time after accidentally pressing the button. Thankfully, I was able to take naps between contractions and even with forgetting to press the stop contraction button it was able to still give me accurate readings. Unfortunately, I did not go to the hospital on the first alert, however, after many alerts to go to the hospital, I finally made my way to the hospital the next day. At 10 that morning, I went to get my cervix checked finding that I had a very high pain tolerance and was told that I was 7cm dilated. With this app, I was able to show the nurse when my contractions first started the following evening and all my contraction times I had up until I arrival. I was admitted into the labor room, went natural with no medication and had my daughter two hours later. Thank you for making an accurate and reliable app.💜 more"
    },
    {
      "user": "Lexwil2",
      "date": "01/22/2024",
      "title": "Helped me tremendously",
      "review": "With my first two pregnancies I was induced. So I was already hooked up to IV’s before my contractions kicked in. With my latest pregnancy I knew I wanted to bring on labor myself, but I was not aware of how to count my contractions. This app took the guess work out of it for me. On the day I went into the hospital, I was walking around target and curb walking in the plaza(to naturally induce labor) I tracked my contractions and it told me when I needed to start getting my things together (they were already in the car) and when to go to the hospital. I waited maybe another 45 minutes to be sure the alert was legit and continued counting. On the second go to the hospital alert I was On my way! Got to the hospital and delivered 9 hours later! Thankful for this technology. **SN. Since this app will mostly be downloaded on a phone, try to not go to another app or doing anything to distract you after you pressed contraction started. I forgot to press stop contraction a FEW times more"
    },
    {
      "user": "Vidhya Venkat",
      "date": "06/24/2023",
      "title": "This app is a Life Savior!",
      "review": "I crossed my due date and 3 days later I started getting my labor pain. But I was not sure if it’s a true labor and didn’t want to end up in Emergency Room and being sent back home for false labor. So I kept tracking the timing of contraction but it was difficult to analyse. And during that time, I found this app in App Store, since it had high ratings and good reviews, I wanted to give a try. I started recording my contraction timings for 2 hours continuously. Initially it was prompting me to get ready for the hospital. And at a point of time, it prompted me to go to hospital multiple times. We trusted this app and rushed to the hospital, and voila! That was a true labor and I was 6cm dilated already :) Can’t thank this app enough when it was a critical time and when we were confused to make a decision! I highly recommend to use this app! more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "46.7 MB",
  "category": "Medical",
  "ageRating": "4+",
  "languages": "English, Arabic, Croatian, Czech, Danish, Dutch, Finnish, French, German, Greek, Hebrew, Hindi, Hungarian, Indonesian, Italian, Japanese, Korean, Malay, Norwegian Bokmål, Polish, Portuguese, Romanian, Russian, Simplified Chinese, Slovak, Spanish, Swedish, Thai, Traditional Chinese, Turkish, Ukrainian, Vietnamese"
}