{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "EHRA Key Messages 12+",
  "subtitle": "",
  "seller": "ESC - European Society of Cardiology",
  "stars": "4.7",
  "rating": "21 Ratings",
  "price": "Free",
  "appDescription": "Adding to your expertise in the field of heart rhythm and connected diseases! Find the following Key Messages in this app: 2022 - How to use digital devices to detect and manage arrhythmias: An EHRA practical guide (2022) - EHRA consensus on prevention and management of interference due to medical procedures in patients with cardiac implantable electronic devices (CIED) (2022) 2021 - Optimal Implantation Technique for Conventional Pacemakers and Implantable Cardioverter-defibrillators - EHRA Practical Guide on the use of non-vitamin K antagonist oral anticoagulants in patients with atrial fibrillation - Quality indicators for the care and outcomes of adults with atrial fibrillation 2019 - Cardiac Implantable Electronic Device Infections - Catheter-based Left Atrial Appendage Occlusion 2018 - Antithrombotic Therapy in Valvular Atrial Fibrillation - Arrhythmias in Congenital Heart Diseases - Screening for Atrial Fibrillation 2017 - Chronic Kidney Disease - Management of Supraventricular Arrhythmias - Pre-participation Cardiovascular Evaluation for Athletic Participants to Prevent Sudden Death Additionally, this app provides bookmark and notes function, scores and calculators and sharing of the content. Find all detailed information you need about heart rhythm related issues by one single click. more",
  "reviews": [
    {
      "user": "Grishkanich",
      "date": "05/25/2015",
      "title": ".",
      "review": "Crashes all the time.(iPhone 5)"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "153.1 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English, German"
}