{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Included Health 12+",
  "subtitle": "formerly Grand Rounds",
  "seller": "Included Health, Inc.",
  "stars": "4.9",
  "rating": "13.9K Ratings",
  "price": "Free",
  "appDescription": "You don’t have to manage your health alone, you’ve got Included Health (formerly Grand Rounds). Say hello to your own personal care team of fully licensed doctors, nurses and care coordinators, on staff and on call to get you the highest-quality care. Connect with in-network doctors in a flash, expert second opinions, and answers to all your health and benefits questions. This employer covered benefit won’t cost you a thing.",
  "reviews": [
    {
      "user": "Sb675443332",
      "date": "04/14/2021",
      "title": "Huge THANK YOU",
      "review": "I wanted to recognize Megan Gilroy. She has been instrumental in helping me with my care. Her humbleness, kindness and professionalism has helped me navigate a very difficult medical concern. She has stayed on top of my care and made sure to stay in contact with me. Megan displays compassion for her position and it shown in her work. She has been a huge advocate for me while I’m working through treatment options and different specialists. I cannot say enough great things about Megan! In all honesty I have to say she is probably the best resource I have ever had on my side and she goes above and beyond. Her medical knowledge and continuous care has given me hope and let’s me know there really are people doing Gods work. I don’t ever want Megan to think she didn’t make a difference in my care or anyone’s care. She needs to be recognized for her significant role with Grand Rounds. Her efforts need to be recognized and I owe her a huge thank you for being the person she is. She is the definition of kindness. Thank you Megan! more"
    },
    {
      "user": "Sylvia Graves",
      "date": "02/24/2023",
      "title": "Missing info regarding appointments\n\n    Developer Response",
      "review": "I had a confirmed appointment for February 24 9:30 am. At about 8am, I went on the app to verify the exact time, since this was going to be the first time speaking with this doctor. The information was not there. Not canceled, not rescheduled, just non existent. I called the number to speak with someone. They couldn’t find my appointment. After about 45 wasted minutes they said they would send a report of some sort and call me back. Of course, no call back. I wasn’t expecting it judging by how uninformed the person on the other end of the line was. I can tell when someone is just blowing me off to get off the phone. She literally hung up on me after saying she would call me back. I finally found a confirmation email and was able to get to the appointment through the email. When I opened it up to join the call, the app kept asking me to “share my location” my location settings were set to “share” but the app kept denying me access. So I closed the app and opened it again. Nothing. After about 15 minutes of verifying everything, I missed the appointment. I sent a message to the team saying I shouldn’t be charged the $35 for canceling since the app didn’t let me in and still haven’t heard back from them about either of these two issues. Going to delete this app as soon as I hit send on this review. What a disappointment. If I could give zero stars, I would. more Thank you for your feedback and we are deeply sorry for the inconvenience. Please share more details with us at member-support@includedhealth.com, so we can improve your experience. more"
    },
    {
      "user": "CassieFaye221",
      "date": "08/12/2023",
      "title": "Finding Care Virtually Doesn’t Work\n\n    Developer Response",
      "review": "This is the first and probably last time I’ll be using this app. I’ve been trying to utilize the virtual appointment function for 3 hours this morning without success. There’s two options: see a doctor right away or make an appointment. For the first option, I either get “An error occurred. Please try again later” or it takes me through all the steps, saying I’ll be able to connect with a doctor in 5-10 minutes estimated and when I click on “Join Appointment” a message immediately pops up saying there’s no available providers and to please try again later. I’ve been trying for the last 3 hours!! When I get the error right away, I have to log completely out and back in and hope it works. The schedule an appointment for later function doesn’t work at all. When I get to the part when it asks for my availability and I choose the date and time and click continue, it just takes me right back to choose a date and time over and over and over again until nothing happens when I click the continue button. I have this service through my employer and it replaced Teladoc and I wish I still had Teladoc. I never had issues with them and could always connect with a provider within minutes. This app is awful and inconvenient. They say 24/7 access to care? Load of crap. If I could give 0 stars, I would. more Thank you for your feedback and we are deeply sorry for the inconvenience. I have noted your feedback to pass on to our engineers and product specialists. Please share more details with us at member-support@includedhealth.com, so we can improve your experience. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad"
  ],
  "size": "203.8 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English"
}