{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "ACC Guideline Clinical App 17+",
  "subtitle": "",
  "seller": "American College of Cardiology",
  "stars": "4.7",
  "rating": "39 Ratings",
  "price": "Free",
  "appDescription": "Access the American College of Cardiology’s clinical guideline recommendations and use interactive tools such as risk scores, dosing calculators, and algorithms through the ACC’s Guideline Clinical App. The App also includes features such as customizable bookmarks, note-taking, and emailable pdfs. ACC’s Guideline App is free to both members and nonmembers. This app is the ACC’s mobile home for clinical guideline content and tools for clinicians caring for patients with cardiovascular disease. Current guidelines in the App include: • Atrial Fibrillation (AF) • Cardiovascular Risk (CV Risk) • Coronary Artery Bypass Graft (CABG) • Cholesterol (Chol) • Device-Based Therapy (DBT) • Dual Antiplatelet Therapy Update (DAPT) • Heart Failure (HF) • High Blood Pressure (BP) • Hypertrophic Cardiomyopathy (HCM) • Lifestyle (Lstyle) • Non–ST-Elevation Acute Coronary Syndromes (NSTEMI) • Obesity • Percutaneous Coronary Intervention (PCI) • Peripheral Artery Disease (PAD) • Perioperative Management for Noncardiac Surgery (Periop) • Stable Ischemic Heart Disease (SIHD) • ST-Elevated Myocardial Infarction (STEMI) • Supraventricular Tachycardia (SVT) • Syncope • Valvular Heart Disease (VHD) • Ventricular Arrhythmias and the Prevention of Sudden Cardiac Death (VA/SCD) Stay tuned for ongoing updates, more guideline content, and tools. Send feedback to the ACC directly from the App Information page or post a review in the App Store. Help us find new and better ways to deliver guideline content to clinicians. The information, text, graphics, images, trademarks, and other materials (collectively, “Content”) that may be contained in the Guidelines Mobile Application (“App”) is presented as an educational service intended for licensed health care professionals. While the Content in the App is about specific medical and health care issues, the Content is not a substitute for or replacement of personalized medical advice and is not intended to be used as the sole basis for making individualized medical or health-related decisions. The views and opinions expressed in the App are those of the contributing authors and editors and do not necessarily represent the views of the ACCF. The Content is not intended to present the only, or necessarily best, methods or procedures for the medical situations addressed, but rather is intended to represent an approach, view, statement, or opinion. ACCF hereby expressly disclaims responsibility for any liability arising from or in connection with the application of the Content in the App by you. more",
  "reviews": [
    {
      "user": "Ramster1",
      "date": "10/08/2024",
      "title": "5 stars",
      "review": "I am a community cardiologist and this app is excellent, very underrated. It is maintained up-to-date, has a simple user interface and presents information in multiple ways depending on your objective. A must have! more"
    },
    {
      "user": "iraamz",
      "date": "01/15/2019",
      "title": "Amazing app for quick review.",
      "review": "I appreciate your effort in updating app contents on time. If you guys can update app size for iPhone X, XS, XR and XS max would be amazing."
    },
    {
      "user": "Rn in oregon",
      "date": "06/08/2019",
      "title": "Great APP",
      "review": "As an NP student with little cardiology experience, this APP is amazing! Genius design, very easy to navigate!"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "370.3 MB",
  "category": "Medical",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English"
}