{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "LiveWell with Advocate Aurora 17+",
  "subtitle": "Manage your health & wellness",
  "seller": "Advocate Health Care",
  "stars": "4.7",
  "rating": "146.7K Ratings",
  "price": "Free",
  "appDescription": "Get all your health info in one convenient place. With our new LiveWell with Advocate Aurora Health app, you can manage your health and wellness – as well as everyone who counts on you. With LiveWell, you can: Start a video visit or e-visit to get a fast diagnosis and treatment plan Manage care for yourself and everyone who counts on you all in one place Schedule appointments and get medications for everyone who depends on you Message your providers Get bill notifications Take health quizzes Get the latest health and wellness insights Live mindfully with guided meditation exercises Upload health and fitness data, including data from the Apple Health app, when enrolled in self-tracking programs more",
  "reviews": [
    {
      "user": "No pick one yourself.",
      "date": "07/02/2024",
      "title": "Great Aurora/Live Well  system.",
      "review": "Was up north, on vacation (Door County). Got a self inflictive knife laceration injury. Could not stop bleeding with direct pressure. Looked like needed stitches. Looked for a medical clinic, found an Aurora clinic in Sturgeon Bay, headed for clinic with knife wound wrapped tightly. Wife could not take me per her physical condition, but called clinic to inform them I was coming, called me and said they would be ready. And they were. Because of Aurora ‘s Live Well system, all was known. And all was ready for me. A Jennifer Krause FNP-BC took care of me, in a most professional way. And thanks to my Live Well record, knew all meds. I was on, and what she could or couldn’t give me. My tetanus status was over 5 years old and I needed one. Thanks to Jennifer and a RN, can’t remember her name. But those two, a receptionist and I think a male Dr. We’re only ones on duty at about 5PM on July 1, 2024. Thanks, again. THOMAS R.ROBEL more"
    },
    {
      "user": "Etait13",
      "date": "09/27/2024",
      "title": "Great app! Terrible hospital system",
      "review": "Just stay away from Aurora doctors! I promise you, they do not care one bit about you. They must be coached to get in and out of appointments as fast as possible. Every Aurora doctor I have seen comes flying into the office, sits down, asks me to tell them what’s going on, gives me room for one sentence, cuts in, diagnoses without any kind of exam or test, prescribes something, and sends me on my way. Every single visit with every single doctor. If they do end up wanting a sample or something then make sure you are on top of reaching out once the results are in. They won’t remember to go back and review the results. You will end up suffering for days waiting on them to finally get back to you. When they do, do not expect any kind of apology or sympathy. They are taught not to admit fault. You will be told, even if you have the results in front of you and can read them clear as day, that the results really didn’t show much but if you are still having symptoms the doctor will prescribe something. LIARS!!! I LOATHE liars!!! They will absolutely lie to you. I have caught their doctors in lies multiple times. The Aurora doctors are not to be trusted! Please switch to another system. These people almost killed me. I’m not exaggerating. Please. more"
    },
    {
      "user": "Sandra Spurgeon",
      "date": "01/21/2022",
      "title": "Convenience at your fingertips!",
      "review": "This app is super user friendly. The design of the app is very easy to navigate through. It eliminates the hassle of trying to figure out where to go, what to do & how to do it. The format readily defines your search function. It features; All apptmt’s on the app plus the ability to cancel or reschedule, you can pre-register prior to your Apptmt, view bills and pay them as well. In addition, you can send health related messages to your provider and you get timely responses and much more. This has helped me manage my health and my time and I feel more connected with my doctor. The app is a time saver for our doctors as well. It’s a mutual goal to free up time and position our doctors to efficiently optimize their time for patient care. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "Apple Vision"
  ],
  "size": "346.9 MB",
  "category": "Medical",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English, Arabic, Danish, Dutch, Finnish, French, German, Norwegian Bokmål, Spanish, Swedish"
}