{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "WeMoms - Pregnancy & Baby App 4+",
  "subtitle": "Get Pregnant Now, Baby Tracker",
  "seller": "Globalia",
  "stars": "4.8",
  "rating": "15.5K Ratings",
  "price": "Free",
  "appDescription": "Get the world's most popular pregnancy & baby tracker app, and discover what to expect on a week-by-week basis with all the pregnancy information you need! WeMoms offers you an all-in-one experience with medical expert content, daily personalized articles, and interactive 3D experience to track your baby’s development. Chosen by millions of pregnant mothers, learn everything you need to know, with fresh personalized content every day - from getting pregnant through the first years of your baby. Join our global community today filled with welcoming moms-to-be - you’ll feel supported along your pregnancy journey. Track Your Baby’s Development - Discover your 3D baby to track his/her evolution week by week - Visualize your baby's size using the Baby Size Guide - Explore our Week-by-Week Guides explain what to expect during each stage - Stay informed with a Pregnancy Timeline highlighting important milestones and countdown until the big day! Explore Personalized Pregnancy Guides & Tips - Comprehensive Pregnancy and Maternity Guides covering topics tailored to your needs: pregnancy complications, childbirth preparation, breastfeeding, first or second pregnancy, mental health, exercise, food, and more - Daily articles and tips to track and manage your symptoms and find if it’s normal - Personalized Pregnancy Articles based on your pregnancy stage - Valuable tips, tricks, and advice from other pregnant moms, thanks to our community Pregnancy Tools to Track Each Aspect of Your Journey to Motherhood - Use the Pregnancy Due Date Calculator to determine when your bundle of joy will arrive - Track your baby's movements and activity with the Kick Counter - Keep an eye on your weight changes with the Pregnancy Weight Log - Measure contractions throughout your labor with the Contraction Timer Organize & Plan - Plan and document your prenatal appointments with the Pregnancy Calendar - Prepare for your hospital visit with the Hospital Bag checklist for Mother Pregnancy Features - Personalized advice and support throughout your pregnancy journey - Community of over 1 million moms to connect with - Track your baby's growth in 3D imagery - Information and advice on a wide range of pregnancy and motherhood topics - Available in multiple languages Birth Partner & Baby - Stay organized with the To-Do List and Baby Shopping List - Find inspiration and share your favorite Baby Names from a vast collection Our 3D Models Immerse yourself in our exclusive 3D models that depict the week-by-week development of your pregnancy, from blastocyst to fetus to baby. These realistic models allow you to truly connect with your growing baby. - Choose from multiple ethnicities to personalize your experience - Zoom in, zoom out, and rotate to view intricate details of your baby - Watch guided pregnancy week-by-week walk-throughs for a deeper understanding - Tap to witness the baby's movements in action All subjects on WeMoms: Pregnancy, pregnant, childbirth, childbearing, fetus, motherhood, prenatal, baby, fetal, birth, maternity, contraception, womb, fertility, contraceptive, unborn, Pregnancy, Due Date, Calculator Labor & Delivery, Pregnancy Week by Week, Pregnancy Symptoms, Morning Sickness, Pregnancy Weight Gain Calculator, New Fetal Development, Screenings & Tests, Pregnancy Complications, Preparing for Baby, Baby Names, Top Baby Names for Boys, Top Baby Names, Getting Pregnant, Fertility, Ovulation Calculator, Ovulation Symptoms, Preparing for Pregnancy, Bleeding, Interpreting Pregnancy Test, Postpartum Recovery, Newborn Care, Breastfeeding, Baby Sleep, Gassy Baby Relief, Pregnant, Getting Pregnant, Pregnancy, First Year, Toddler, Family, Baby Products, Maternity, Nursing & Feeding, Pregnancy Pillows, WeMoms app, Baby Tracker Privacy Policy: https://www.wemoms.fr/privacy_en Terms of Service: https://www.wemoms.fr/cgu_en Note: WeMoms content should not be used as a form of birth control/contraception. more",
  "reviews": [
    {
      "user": "EmLui67",
      "date": "03/26/2023",
      "title": "Great communication tool",
      "review": "I have seen some dads on here asking for advice and not having an app or platform to use like us moms do. If the app creators see this I hope they would consider working on a sister app for dads. I was shocked and sad to find out that my baby’s father didn’t have the same source of communication within the other few apps they have aimed at pregnancy for fathers. He has one app called Hi Daddy which only gives him a sentence long update for each week. I know it would be a success and a good way to bring dads together the way you have for moms. I love what you have done for us and know you’d do right by them too! more"
    },
    {
      "user": "FindABetterApp1",
      "date": "02/17/2024",
      "title": "UNFAIR",
      "review": "I’m certainly 23 weeks and 6 days iv been on this app since I was 8 weeks and everything we good. I made new friends I could vent to some I could relate to had a good support system loved it! But then a few people on there didn’t agree with some of the stuff I was post nothing negative to them or disrespectful mostly just venting and they became disrespectful and some of my friends got their accounts banned. Well this month of my 23rd weeks iv gotten several DM from WeMoms about twice talking about banding my account for harassment disrespectful language etc.. when I DM them asking them which post or comment was reported, I got no response back only to open my app. A few days later I get back on and boom my account is banned saying I’ve broken guidelines. This didn’t just happen to me but some of the moms iv made friends with. In other words a mom or someone with a fake account can report at pictures of your child and WEMOMS will send you a banned warning for harassment, or being disrespectful it only takes moms to not like what you post report you and boom your account is banned. WEMOMS you need to make your app more secure when it comes to reporting people stuff. YALL need to look more into what people are reporting and give us a chance to fight the report over just banned our accounts. I’m upset my account was banned with such poor reason. Do better! more"
    },
    {
      "user": "tiguij",
      "date": "10/09/2022",
      "title": "Just disappointed honestly..",
      "review": "I downloaded this app a few days after I found out I was pregnant at 2 months. I have enjoyed it for some time, now I am almost 6 months pregnant but honestly I noticed the bullying conversations from jump but I tried to overlook it and just come to get advice and hear about other moms experiences, since I am going to be a new mom. This is a motherhood app, where women who are trying to conceive, currently pregnant, dealing with miscarriages, infertility and more, where women are suppose to empower one another but most of the time they are constantly judging and don’t know how to agree to disagree at all, like children smh You have “women” on here that treat this app like Facebook. Mocking women who are having trouble getting pregnant due to health complications or because they don’t know how to track their ovulation due to irregular periods smh “women” who think they are better than others because they don’t have issues getting pregnant like the next. It’s disgusting! Women delete the app everyday due to the bullying and I will be the next one more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "235.7 MB",
  "category": "Medical",
  "ageRating": "4+",
  "languages": "English, French"
}