{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "OptumRx 12+",
  "subtitle": "",
  "seller": "Optum Inc.",
  "stars": "4.7",
  "rating": "145.9K Ratings",
  "price": "Free",
  "appDescription": "The OptumRx mobile app helps members manage pharmacy benefits without walking into a pharmacy. Compare drug prices, view all your medications, and transfer eligible medications to home delivery. Users can also refill their home delivery prescriptions, check order status, set up automatic refills, and more. Other features include: • View member ID card • Resolve home delivery order holds • Manage account information Search, compare and save. With our easy-to-use tools, you'll get the info you need to find the right drug and pricing options for you. Send medications right to your home. You may be eligible for the convenience of Home Delivery, avoiding trips to the pharmacy to pick up your medications. Manage your Medicine Cabinet anywhere. Easily manage your medications and orders on any device- whether at home or on the go. Our Promises There are some things in life we depend on. Medication is often one of them. We promise to deliver simple ways to get the medication you need. • Affordability We help you find the medications you need at the lowest price available to you. • Accessibility Everything we do centers on getting you the medication you need, when you need it, your way. • Advocacy We'll be here to guide you any time you need us with compassionate care and a simple experience. more",
  "reviews": [
    {
      "user": "scan perfect",
      "date": "12/03/2020",
      "title": "Optum Rx Mail Order Pharmacy",
      "review": "Is a great way to avoid trips to drop off and pick up prescriptions and maintain authorize refills that my Doctors prescribe. They will also attempt to reach out to my Doctor when it's time to refill a prescription that doesn't have any refills left. The pharmacist can not fill a prescription without a doctor's order. And sometimes they need us to call our doctors to order more refills. And if our doctors don't supply the order then they are not able to fill it. But Optum Rx pharmacy keeps up with the time a refill is needed so that we don't run out of our maintenance medications, and that's a good thing. Local pharmacies don't. Most times they don't notify you when your prescriptions are ready for pick up. At least my doesn't. I have to call them to see if they have received an order from my doctors and when it will be ready for pick up. And even if the drug is an antibiotic or server pain medication I don't receive a call or text message to let me know that my prescription is ready. But using the mail order pharmacy is not a good choice for any prescriptions less than 3 months or 90 days. And my doctors usually will add 2 refills. So there you have it. Optum Rx is a very good choice for home delivery medications. more"
    },
    {
      "user": "Buddyroe153",
      "date": "06/28/2020",
      "title": "Very poor website",
      "review": "Update - believe it or not they actually made the website, and app less useful. Now the two pieces of software don’t even have the same info. On the website you can’t find what info you want. I wanted to look up one med I needed to refill. It only showed one of my meds, not all of them. It showed the order as ready to ship with a due date 3 months ago. The app showed all the meds and let me order the one I wanted, but I couldn’t sign on to it directly through the app. It kept telling me the name and password were not on file. It was the same one I used to sign on the the website with no problem. Luckily you could switch to the app from inside the website which is what I did. That link signed on just fine. As always OptumRx has the worst software, most buggy, next to useless stuff I’ve ever used, and I am no newbe to computers. Please, please put some effort into fixing your software so it is intuitive, user friendly, and consistent between platforms, please. I have no choice but to use your service so I am stuck with it and have to fiddle with it or call every time I try to place an order. Old review post - Even though they have updated and changed their website repeatedly it is still far less then perfect. Very slow to load, slow to update info and find searched items. Process is lacking. It is somewhat better with last update but still presents problem navigating the website. more"
    },
    {
      "user": "buzzdc",
      "date": "11/03/2018",
      "title": "Login broken rendering app useless and suspicious reviews\n\n    Developer Response",
      "review": "Ever since iOS 12, the app has become unusable. I decided to wait 2-3 weeks after the system release, before writing this critical review; in fairness to the developer giving them time to fix the log-in issue. Apple gives developers ample time (usually about 6 months) with their beta program to fix any issues before the launch of a new operating system, so it’s pretty shameful if your app has major issues on release date. Considering this is an app that many people rely on for their health, it makes it all the more shameful. I have not been able to login to this app using the fingerprint scanner for weeks. It’s not a systemwide problem, as all my other apps with fingerprint security logins work fine. When the app works, it’s provides the pertinent information needed, however the user interface is not very intuitive, and sways away from most of Apple’s good practices design standards. It’s not accessible and does not take advantage of Apple’s system-wide text resizing, which is imperative for people with poor or low vision. We should expect more from a company which we choose to safeguard our health. I couldn’t help but notice recent extraordinary amount of 5-star, one-sentence, generic reviews. Appears very suspicious. It’s possible these reviews were written are by positive individuals with little to say, or maybe they are fake reviews paid for by the developer, however that would violate Apple’s rules. more We value your feedback and we are sorry to hear about your experience. We have shared this with our technical support team. Please send us your contact information at ORxAppSupport@Optum.com and we will reach out to you. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch"
  ],
  "size": "48.4 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Alcohol, Tobacco, or Drug Use or References",
  "languages": "English"
}