{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "NurseGrid Nurse Shift Calendar 4+",
  "subtitle": "Simple Nursing Work Schedule",
  "seller": "HcT2 co",
  "stars": "4.9",
  "rating": "121.2K Ratings",
  "price": "Free",
  "appDescription": "Organize. Connect. Reflect. #1 shift calendar app and social networking for nurses! Take control of your schedule by balancing work and personal life like never before. NurseGrid™ lets you take control of your career with on-the-go access to organize your work and individual events and stay connected to nursing friends through your phone or smartwatch. You can also share your calendar with friends, family, and colleagues. NurseGrid is used by 1 in 8 US nurses! Every day, nurses across the country trust NurseGrid to: - Carry their work calendar everywhere they go - Swap shifts with other nurses - Compare calendars with colleagues for swaps or off-duty plans - See who they are working with before their shift - Signal availability for additional shifts, swaps, and flex-offs - Manage shift calendar at multiple worksites - Add personal calendar for better life management - Send group and private messages to colleagues - Share your shift schedule with family and friends … and much more! The NurseGrid Apple Watch app lets you see your calendar, shift details and available swaps. It's now even easier to connect with your schedule, wherever and whenever you need it. Now available on Apple Watch - View Shifts weekly - View Shift details - View Available Swaps and Giveaways - Pick up Open Shifts Getting started is easy. Find help documentation and support right in the app! (\"Me\" tab - \"Help Center\") We'd love to hear how we can help you restore your nurse life balance. Contact us at support@nursegrid.com. more",
  "reviews": [
    {
      "user": "enicram",
      "date": "01/23/2023",
      "title": "Time management\n\n    Developer Response",
      "review": "I have enjoyed using nurse grid for the last 5 years! It has helped me to not miss a shift and make adjustments based on my employers schedule grid. I can just open up the app and adjust easily what is listed online. It also helps me keep track of the shifts I charge, precept, attend education, PTO, time off and of course payday. It’s a quick reference guide when called to ask if you can work extra! Nurse grid also helps me to know and manage MY work time versus FAMILY time. I love the color options and icons. I even use nurse grid as my Calendar versus my phone or wall calendar! If I could change one thing about nurse grid though it would be the option to be able to see at least two items on the actual day of each month instead of just one or tapping to see if there is any pertinent items scheduled for your shift. For example, if I’m charging and precepting on the same shift I would like to see “C” and “P” on the display calendar instead of clicking each date to view details. Thank you nurse grid! more Hi there! Thanks so much for your review and feedback, we truly appreciate it! We'll pass along your feedback regarding the information displayed on each day in the calendar view to our Product Team. They review and consider all user feedback as they plan and build updates to NurseGrid. If you have any other ideas or suggestions, or if we can answer any questions, please contact us at support@nursegrid.com! more"
    },
    {
      "user": "Shyralovee",
      "date": "09/13/2022",
      "title": "Good but lacking\n\n    Developer Response",
      "review": "I think this is a good app but is definitely not great. It feels very aged to me. There are apps with more functionality and more features. I think this is used because it’s just a standard with nurses, everyone just hops in cuz it’s what’s popular. Not sure if that’s why there are few updates and far between. Simple is good which is a great part of this app but there aredefinitely ways that can make it more user friendly and keep up with the times. With this app being out 4 years. I’m just expecting more. As others have suggested a dark mode would be appreciated as well as the ability to have a widget on your Home Screen for quick and easy viewing. More colors, icons that pertain to other aspects of life. I would also like to maybe have days with multiple events have a split color to see that my day isn’t just full of one thing without having to click on the dots for everyday I have lots going on. Also, definitely need to be able to compare multiple colleagues. Fortunately for me, I have more than one friend/coworker so it would be great to be able to pair up my schedule with ALL of them . Good app but can be better. Other Apps are too advanced for it to not have these features . Developers-I feel like need to be a little more innovative with ideas and make it a priority to push out not only bug fixes but ALSO new features, maybe a slightly different upgraded interface. more Hi there! Thanks so much for taking the time to write out your thoughts. We truly appreciate your suggestions on how NurseGrid can be better. As you pointed out, many of these suggestions have also been made by other users, and have not gone unnoticed by our Product Team, who are working to implement them. We look forward to sharing our progress and updates with you in the future! more"
    },
    {
      "user": "FiannaWarrior",
      "date": "10/17/2017",
      "title": "Perfect in every way!",
      "review": "The only thing I have to say about the program at this point is their old messages that I sent to a friend and vice versa but I've been there on there for nearly 600 days… There is no way to get rid of them… That's my only complaint I don't like seeing them there… However everything else seems to work great and if I do have a problem I get a hold of Nurse Bridge people and they get back to me so all is good thank you 👍🏼🕷👍🏼 D2 Started using this about a year ago… Every hospital I go to work if I use this particular program… I have the recent hospital that I'm at using it and we now are able to see each other's schedule to swap if needs be… Totally amazing incredibly useful and I wouldn't have it any other way. And a reminder to everybody out there using this program send Kudos to the man who created it every once in a while because the program is awesome thank you... Love it and it is better than paper!!! D2 more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch",
    "Mac",
    "Apple Watch",
    "Apple Vision"
  ],
  "size": "111.7 MB",
  "category": "Medical",
  "ageRating": "4+",
  "languages": "English"
}