{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "PlushCare: Online Doctor 12+",
  "subtitle": "Medical care & prescriptions",
  "seller": "Accolade, Inc.",
  "stars": "4.9",
  "rating": "117.7K Ratings",
  "price": "Free",
  "appDescription": "SEE A TRUSTED, WORLD CLASS ONLINE DOCTOR Get diagnosed and prescribed medications online. Major insurances accepted. Cost effective & convenient. Nationwide. With over 300,000 users and counting PlushCare is a leading virtual primary care provider. Our physicians come from the top 50 U.S. medical schools and are licensed and U.S. board-certified. You can see our online doctors via phone or computer 365 days a year, including weekends and holidays for medical care and online treatments, including online prescriptions. Our physicians can treat over 3,500 medical conditions online and are committed to creating a stress free environment with positive patient outcomes. 97% of conditions are treated on the first visit. If the online doctor is unable to treat you, the appointment is free. Our patients have consistently rated our medical care at close to 5 out of 5 stars across the most popular review platforms. HERE’S WHAT PLUSHCARE PATIENTS ARE SAYING \"I'm a busy guy with work often finding myself out of area. I've used PlushCare a couple of times and couldn't be happier. Doctors are always nice and professional and appointments are easy to get.\" \"Outstanding service. Both my husband and I used the service. It's so much easier than going and sitting in an emergency room or clinic with other people and their germs. A great way to be checked out!\" HOW DOES A VISIT WITH A PLUSHCARE DOCTOR WORK? To book an appointment simply select a time and preferred doctor from our booking page. Then enter your insurance information (if applicable), create an account, select your preferred pharmacy, and at your appointment time, video chat with the doctor of your choice via smartphone or webcam. During your online consultation the online doctor will ask about your medical history as well as any current medications and supplements you may be taking. They will want to hear about your symptoms and together you will create a treatment plan. WHAT DOES PLUSHCARE COMMONLY TREAT? PlushCare offers virtual primary care for ongoing conditions, and virtual urgent care for non-emergency conditions. Our physicians have treated over 3,500 medical conditions online. PRIMARY CARE FOR: Acne Anxiety Asthma Back pain Depression Diabetes Erectile dysfunction Hair loss High blood pressure High cholesterol Thyroid conditions Insomnia And many more... URGENT CARE FOR Allergies Bronchitis Colds Dental infections Diarrhea Ear pain Flu Headache/migraines Nausea PEP Pink eye Pneumonia Rash Sinus infection Strep throat Tonsillitis UTIs Vaginitis Yeast infections And many more... COMMON ONLINE PRESCRIPTIONS OUR DOCTORS WRITE Antibiotics (Amoxicillin, Penicillin, Augmentin) Antiviral medications (Acyclovir, Valtrex) Antidepressants (Prozac, Sertraline, Trazodone, Zoloft) Antipsychotics (Olanzapine) Birth Control (Apri, Yaz) PrEP (Truvada, Descovy) Diuretics (Bumex, Demadex) Pain Killers (Naproxen, Voltaren) High blood pressure medication (Amlodipine, Propranolol, Valsartan) Diabetes medication (Metformin, Diabeta) And many more... WHAT IS PLUSHCARE’S PRESCRIPTION POLICY? Our online doctor's can write a refill or initiation prescription on all medications not classified as controlled substances for 90 days. It is important to note that our doctors are highly trained physicians and will defer to their best medical judgement during your appointment CAN I USE MY INSURANCE AND HOW MUCH WILL MY VISIT COST? PlushCare accepts insurance from major insurance providers. Insured patients will pay their typical office visit copay. The average insured patient pays less than $25. We also accept patients without insurance. This is much more affordable than an in-person urgent care or primary care uninsured appointment. CAN MY CHILDREN SEE A PLUSHCARE DOCTOR? Yes. PlushCare has friendly & experienced pediatricians on staff. For more information, you can visit our FAQ page at support.plushcare.com more",
  "reviews": [
    {
      "user": "Ididntstealthechair1",
      "date": "10/18/2018",
      "title": "Great appt",
      "review": "Wow. This was he first time I’ve used plush care and it was a really good experience. Dr. Savery was right on time, professional friendly. She was kind and warm in our interaction and it really was just like a doctors visit in an office but I never had to get out of bed. I’m feeling terrible and the thought of having to get up, dressed drive and commit probably 2 or more hours out Was too daunting. She spent all the time needed with no rush. I called because I felt like I had a uti, which came on very quick. I’ve experienced this multiple times a year the last few years and I was discouraged to have to go through all the motions of physically seeing a doctor when I suspected I needed antibiotics, it’s been a 5 minute discussion in the past, prescription and done. So, she diagnosed me just the same as physically having to see a doctor. She gave me the precautions to look for if I were to get worse and needed a face to face visit. She called in my prescription, so, I can just make a quick trip to pick it up and I’ll be better. My insurance no longer covers my doctor I’ve seen for years and I don’t want to switch so, when I rarely need a doctor, I pay out of pocket anyway. So, it was only about $15 more than an in office visit. This service is amazing and I’m so glad I decided to try it. I’m so thankful for seeing dr. Savery today. more"
    },
    {
      "user": "B3cca007",
      "date": "04/14/2019",
      "title": "So Thankful for PlushCare",
      "review": "I have used this twice, now. I was worried about having multiple doctors but the Doctors are awesome, compassionate, ask the right questions, in a short period of time, and never rushed. PlushCare keeps a log of your visits. Which is headache free to remember them all. I get frequent utis. Having to sit for hrs in an emergency room in pain. I no longer have to wait. Make an appt, be prepared to answer questions. Docs are earlier than appt and so far the Docs are better than an emergency visit. When you know you need antibiotics. The docs do send you to get a culture tests done. Pick a location close to you. So easy to get done, quickly. Lab techs are just as fantastic! I have had my culture lab test lost at an emergency room twice and your sitting not knowing for more hrs. They lost it. (Mind you. Your paying for it.)😞 I felt nervous seeing multiple Doctors but so far. 💯 stress free. Most of all affordable and do use your ins, too. If you have it. PlushCare is a Godsend. This is just a perfect way to see a doctor for minor medical issues without leaving your home. Easy to set up. Easy to change your pu location for meds, etc... So easy to use, bottom line. Thank you Dr Crabtree and Dr Riad 😊 Also I will mention the communication thru, video chat, emails and texts, is easy and not confusing at all. 👍👍👍 more"
    },
    {
      "user": "Fekets10",
      "date": "01/16/2022",
      "title": "So Grateful",
      "review": "I found PlushCare while seeking answers to support both myself and my daughter who tested positive for the Omicron virus. Although I was fully vaccinated I developed a fever and a cold that progressed into the worst sore throat I have ever experienced in my life. I started getting really nervous as my throat was severely inflamed and I believe I developed throat ulcers. I had terrible coughing fits that burned terribly and I was concerned about my breathing going forward as I was struggling with swallowing. The constant nasal drip made things more difficult. This went on for two full days. Finally I was able to book a 7am appt with Dr Chansky after being up at 2pm, again. She knew right away what I was experiencing and prescribed Miracle Mouthwash and an anti inflammatory that my partner picked up just three hours later. Later, after approximately 25 hours of excruciating pain, my throat like opened up and almost all of my throat pain dissipated-I could swallow normally again! The Magic Mouthwash helped me sleep and eat in the interim. Ps-I eventually discovered that green tea w coconut oil and greasy lo mein noodles was a saving grace to put down food and medicine and stay hydrated. Thank you Dr. Chansky and thank you Plushcare!!! You saved me and kept me out of the very swamped hospital. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "Mac",
    "Apple Vision"
  ],
  "size": "225.9 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English"
}