{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "IPF Manager 4+",
  "subtitle": "Idiopathic Pulmonary Fibrosis",
  "seller": "@Point of Care",
  "stars": "4.3",
  "rating": "3 Ratings",
  "price": "Free",
  "appDescription": "NOTE: This app now integrates with the Health app so if you choose to also manage certain heart conditions and have an Apple Watch or other device that creates heart rate data, you can now send that data to your doctor through the app giving you full control over which data you send. No health data is collected or sent from device without you specifically doing it. Getting the Full Picture of Your IPF When you are living with Idiopathic Pulmonary Fibrosis, the IPF Manager can help you manage the symptoms that affect you every day. Studies show that people with chronic diseases can positively affect their lives by using @Point of Care apps to track pain, medications, and more—giving a sense of control over their conditions. For many, the best part of using IPF Manager, is seeing moods, pain, medications—even how often they journal—in colorful charts. When your health journey is presented this way, it is easier to spot trends, notice strengths, and identify areas of concern. When You Download IPF Manager and Register, You Can: • Track your progress and symptoms by filling in the daily journal with its sliders and buttons and watch your data transform into easy-to-read charts • Manage your medications and treatments, including reminders • Use the photo upload feature to share visible symptoms with care providers • Connect to care providers so they can monitor your progress between visits and better understand how your condition is affecting you • Stay up-to-date with the latest information on IPF when you access the “Learn More” section • In-app Help guides you through the features so you can get the most out of the app • Experience the new animated feature @Points Rewards and accumulate badges by using the app A Wealth of Medical Expertise Going Back to 1980 Our @Point of Care platform is an award-winning digital technology. It provides mobile, desktop, digital clinical answers at the point of care through Projects In Knowledge. To be able to connect with you and share your HIPAA-protected information, tell your care provider to download our @Point of Care Suite App or register online at www.atpointofcare.com. more",
  "reviews": [],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "21.3 MB",
  "category": "Medical",
  "ageRating": "4+",
  "languages": "English"
}