{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Migraine Buddy: Track Headache 4+",
  "subtitle": "Headaches and Migraines Diary",
  "seller": "Voluntis",
  "stars": "4.8",
  "rating": "34K Ratings",
  "price": "Free",
  "appDescription": "Curious about why 3.5 million migraine sufferers trust Migraine Buddy? Migraine Buddy is your ultimate companion to: - Pinpoint and decipher patterns quicker than ever before - Maximize your medical consultations with comprehensive reports crafted by top specialists - Share experiences, gain insights, and even chat with fellow users in our thriving community - [Premium] Outsmart your condition with predictive risk analysis and tailored action plans for faster relief - [Premium] Personalized coaching plans developed by experts to ensure progress at your pace Discover Migraine Buddy’s Features: Customizable Attack Recording How does it assist you? Glean insights from shared triggers, symptoms, medications, and relief methods. Customize the tool to record your unique migraine attributes. Exports for Doctors - Diary export: Comprehensive reports for a deeper understanding of your headache patterns, vital for diagnostic purposes. - MIR export: Collaborate with your neurologist and headache specialist to reduce migraine and headache frequencies. AI features - [Premium] End of attack prediction - Symptoms and triggers suggestions - 7 days Weather Forecast: Pressure and temperature fluctuations can trigger your migraines. While you can't control the weather, you can strategize. Stay informed about impending pressure changes to help ward off attacks. Migraine Insights & News In-app updates with the latest information and research on migraines. Stay informed about the latest developments in the migraine world. Participate in questionnaires and gain insights from other users' experiences. An Active Community Join our vibrant community of 3.5 million users who are there to offer support, share experiences, and provide advice. Automatic Sleep Recording Uncover potential links between your sleep patterns and the onset of migraines. Why is this crucial? Migraines can feel isolating. Receiving support from those who understand and sharing unique experiences can provide new perspectives on your journey. Want more? Upgrade to MBplus, Migraine Buddy’s premium suite. Take your migraine management to the next level with the world's most advanced tools at your fingertips. With MBplus, gain access to: - Advanced Features - Detailed Reports - Actionable Programs *Migraine Buddy optionally integrates with the Health app for a holistic health view. Migraine Buddy Terms of Use: https://migrainebuddy.com/terms-of-use more",
  "reviews": [
    {
      "user": "Livie T",
      "date": "10/08/2019",
      "title": "Fantastic app with a nice and simple UI\n\n    Developer Response",
      "review": "As someone who has suffered from migraines for my entire life I was always trying to find an effective way to track them and record details. However, I kept having trouble remembering and keeping everything organized. I love this app because it’s so easy to enter the info, but it also has a good amount of detail. It compiles the data and presents it to you in an interesting way that can help you get a new perspective on symptoms, triggers, and your body’s patterns. I especially like the sleep tracking part (it’s linked to my FitBit, but it can also link to an Apple Watch), as that is one of my main triggers, and having definitive information about my sleep schedule can really help me predict and prevent migraines. The resources are helpful and the chat forum is a wonderful place to discuss your experiences with other migraine sufferers, as well as to get advice or tips on how to manage your migraines. My main issues with the app are mostly that there are occasionally typos, which can sometimes make it feel slightly less professional, and that the layout could probably be improved a little (it’s quite bland and sometimes things kinda blur together). If I were to suggest anything I would suggest the ability to make a more in-depth profile and the option to do private messaging. I believe it would be quite helpful to be able to have one-on-one conversations with people you might have met through the forum. more Thank you for your strong support! You can send your buddy link to other users and start a one to one chat with them. Just post in a group chat your buddy link adding @user name you want to have a private conversation with. Feel free to contact me directly at Jenny@healint.com if needed. Jenny more"
    },
    {
      "user": "thulet",
      "date": "12/26/2019",
      "title": "Single most helpful tool in 15+years\n\n    Developer Response",
      "review": "As someone who’s struggled with chronic debilitating migraines for over 15 years and tried so so many different things without any success... I’d also tried many different tracking methods and finally decided that tracking wasn’t going to help, but hinder, as it caused too much focus on the migraines and I needed to focus on living. But this app has changed all of that!!! THANK YOU Migraine Buddy for creating something that helps me do both! For helping me easily, quickly and simply input data about my migraines, keep track, and keep living my life to the best of my ability. But ALSO, the oh so helpful tools, connection with the community, reports, weather (my biggest trigger has always been barometric pressure!! - and now for the first time EVER I have the ability to plan to the hour of when I can take my meds or know when I’m going to start going downhill just to know even if I can’t take one of my meds... it’s helps to know if I need to buck up or to go lay down if I can), ability to see patterns, etc... this app and its tools has been the single most helpful thing in the last decade for me of communicating with my doctors, identifying my auras, and figuring out what actually helps. Thank you!! All in a way that doesn’t take over my life and keep me fixated on my migraines - they are already present enough! If you have migraines and are thinking about this app - GET IT! more Thank you so much for such a great review! Jenny more"
    },
    {
      "user": "RealityIsCheckingIn",
      "date": "07/21/2024",
      "title": "I love this App\n\n    Developer Response",
      "review": "I’ve had migraines the majority of my life but they increased in severity and frequency in the last five years to the point I went searching for more answers and treatments than OTCs could offer. A doctor told me I should be tracking them to better understand my triggers and my research led me to this app. I love the interface. It’s calming to look at when I do have a migraine. It feels like a friend who understands my pain, my triggers, and what helps. Being able to track them and see patterns is very useful. I do subscribe to the plus version but it’s totally worth it to me even though I feel it’s a bit pricey. I’ve been subscribed long enough I’ve seen them add updates and use user feedback to improve what the app offers so I feel like the developers listen and respond to us. I like the discussions with other users. I love that I’m helping contribute to research for migraines. The guides to understanding migraines were helpful because I didn’t know a lot and I learned so much through the app. The app helped me figure out what my triggers even are, and a few were surprising, and other users helped me figure out some options for relief. Great app overall. With a lot of great features even if you don’t subscribe for all of them. more Thank you so much for the compliment. Feedback from people like you are critical to how we improve and continue making Migraine Buddy the best Migraine app for patients by patients. 💖Jenny more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "154.5 MB",
  "category": "Medical",
  "ageRating": "4+",
  "languages": "English, Dutch, French, German, Italian, Japanese, Polish, Portuguese, Spanish"
}