{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "DynaMed 17+",
  "subtitle": "Confidence in Practice",
  "seller": "EBSCO Publishing",
  "stars": "4.9",
  "rating": "3.3K Ratings",
  "price": "Free",
  "appDescription": "DynaMed is a clinician-focused tool designed to facilitate efficient and evidence-based patient care. Rigorous and daily review of medical literature by our physician and specialist staff ensures that timely and objective analysis, synthesis and guidance are at our users’ fingertips. Physicians who are “on-the-go” can take advantage of mobile access and continue work without missing a beat, thanks to syncing between desktop and mobile experiences.",
  "reviews": [
    {
      "user": "Hyphen Fn Baby",
      "date": "04/28/2020",
      "title": "Use every day for reliable and current evidence based information",
      "review": "I regularly use DynaMed. The resource has grown considerably over the years. It is a trusted tool to use for point of care information and decision making. CME accrual and submission is incredibly easy. Alerting functionality is great, letting me know when the editors make enhancements to the topics most relevant to me. Format of content makes it easy to quickly get to the relevant information. Highly recommend to anyone in practice. Thank you, DynaMed! more"
    },
    {
      "user": "G_UC.FNP",
      "date": "05/26/2020",
      "title": "Amazing Clinical Resource",
      "review": "In the past I was introduced to UpToDate and I had been using UpToDate for quite sometime before discovering DynaMed. I believe I have found a superior resource for my clinical practice in using DynaMed. I find DynaMed to be more user friendly, better organized and I find the most current evidence based answers I need much quicker and easier than in UpToDate. Thank you for this great resource! more"
    },
    {
      "user": "MS3 peds rotation",
      "date": "10/08/2023",
      "title": "Just skip and subscribe to UpToDate\n\n    Developer Response",
      "review": "Dynamed not clearly recommend treatment pathways and abx like utd does and most certainly not with bold face, easy to reach tables, indenting and paragraph spacing. Where are the pictures, diagrams, illustrations, information for patients? Dynamed absolutely pales in comparison to UTD in any medical setting. It’s a cheap excuse of anything else available to a practicing clinician and barely suits a medical student. I would never pay a nickel for it to use, yet forced to use it since our institution chose the 4th rate option to save money. As a result, most of the attendings and housestaff across multiple services signed up independently to UTD, effectively wasting any potential economic savings with Dynamed. more Hi, we are sorry that you're having issues with DynaMed. Can you write to us at DynaMedFeedback@ebsco.com. Kindly include a description of the issue you are facing and we can investigate further. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "Apple Vision"
  ],
  "size": "32.2 MB",
  "category": "Medical",
  "ageRating": "17+\n                Infrequent/Mild Alcohol, Tobacco, or Drug Use or References\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English"
}