{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "SingleCare Rx Pharmacy Coupons 12+",
  "subtitle": "Prescription Drug Discount App",
  "seller": "SingleCare",
  "stars": "4.8",
  "rating": "17.1K Ratings",
  "price": "Free",
  "appDescription": "Paying for prescriptions shouldn’t be painful. Join the millions saving billions with SingleCare, the prescription savings card that saves you up to 80% at the pharmacy! Create a free account and get an extra $3 off your next eligible refill, plus earn additional bonus savings throughout the year. Prescription drug prices are rising. Life-saving medications can cost thousands of dollars. If you can’t afford your medications (or simply want to save big on prescriptions), use the SingleCare app to get free coupons that work at all major pharmacies. Whether it’s insulin for diabetes or an asthma inhaler, you can find a free coupon using the SingleCare mobile app or on SingleCare.com. SingleCare is a prescription savings card (aka a “coupon card”) that provides discounts on 10,000+ prescribed drugs for a sign-up price of $0. It’s always 100% free to use the card. Whether you’re insured, underinsured, or uninsured, you qualify for a reduced rate on prescriptions with SingleCare and our accurate drug pricing tool helps you find low prices on thousands of FDA-approved medications. Stop overpaying for your prescriptions and start using our free Rx coupons at your local drugstore. Try SingleCare in 3 simple steps: 1. Search for your prescriptions on the free SingleCare app 2. Compare discounts at nearby pharmacies and get a free coupon card 3. Show your coupon card at the pharmacy counter to save up to 80% on your medication Remember, you can always use the card again for your next refill! SingleCare Features: $0 User Fee: • With a prescription from a medical professional, you can get SingleCare prescription savings cards for free. • All customers at participating pharmacies can use our prescription drug coupons • It doesn’t matter if you’re a doctor, nurse, patient, pharmacist—if you take medication, we have coupons for you. • There are no strict eligibility requirements or limited-time offers. Loyalty Program: • Sign up for our free loyalty program providing access to lower cost medication. • Receive an extra $3 off your next eligible prescription fill when you join! Easy Refills: • Reuse coupon cards on every refill. Prescription Discount Finder: Enter your zip code on the app to find a participating pharmacy near you. We partner directly with thousands of major pharmacies nationwide, including: • CVS • CVS Pharmacy at Target • Walmart • Walgreens • Kroger • Albertsons • Rite Aid • Longs Drugs • Sav-On Pharmacy • Fry’s • Harris Teeter • Wegmans • H-E-B • Meijer More ways to save: 1. Ask for a prescription - To use our coupons, a medical care professional must prescribe the medication. You can still save money on vitamins, natural health supplements, and over-the-counter medicine as long as you have a script for it! 2. Go generic - Generic meds are cheaper than brand names. Ask your healthcare provider if a generic version of your prescription is available. 3. Buy in bulk - Fewer refills = fewer copays. Fill a 90-day supply instead of a 30-day supply to save more in the long run. 4. Shop around - Enter the drug name and dosage on our app, and enter your zip code to compare costs at local pharmacies. If you don’t see your exact med on the app, you can still take our prescription drug discount card to the pharmacy and they can look up if there is a SingleCare offer available. SingleCare has been featured on CNN, Wall Street Journal, Business Insider, Healthline, Yahoo! Finance and Bustle. Start saving on your prescriptions today! By downloading SingleCare, you agree to be bound by our Terms and Conditions found at https://www.singlecare.com/terms-and-conditions. more",
  "reviews": [
    {
      "user": "orcas, oceans+3",
      "date": "04/13/2024",
      "title": "Fantastic!!!\n\n    Developer Response",
      "review": "I recently got divorced and lost one of my health insurance plans. I had to wait 4 months before my new prescription plan was available. That meant, I had to pay full price for my medication. If I had to buy the medication without single care, it would have cost me more than what I earn every month. Single care absolutely saved my life. I could not have survived, without single care. The price of my medication was astronomical. I stopped taking 1/2 of the medication prescribed to me. Why? I could not afford them. It was terrible. Fortunately, I found a Single Care advertisement ,in the waiting rooms of one of my Dr’s. I had very low expectations when I signed up. I figured, this is a free service, there must be a catch!! Was I 100% wrong. The amount of money I save/saved using Single Care is incredible. I can’t thank Single Care enough for making it possible for me to get ALL my prescriptions! It’s free to join , I hope you give them a try. Seriously, it’s a fantastic company and it doesn’t cost anything to join. Give it a try, you will be very happy you did!!!! more We’re so glad that our app was able to help you save. Thanks for your review! - Diki from the SingleCare team more"
    },
    {
      "user": "Ex we",
      "date": "09/22/2022",
      "title": "SingleCare helps everyone, with Insurance or without insurance!\n\n    Developer Response",
      "review": "Even with good insurance (we have United Healthcare PPO for Medical, and Express Scripts for Pharmacy Insurance), I have found the price of some medications to be absolutely unaffordable! I have sometimes had to go back to my Doctor to request a less expensive option. Other times I just decided not to bother filling the Rx. SingleCare has changed that! I was able to look up my medications on the SingleCare App and actually get a list of all the local Pharmacies sorted by the lowest price first using the special SingleCare negotiated pricing. Then I simply select the pharmacy I want to go to for my Rx, which reveals a special coupon I use at the pharmacy to get the amazing low price! I can't believe this program is free and anyone can use it! I tell everyone about it. With the exception of one or two genetic medications I was already filling for a good price, now I don't even bother to use my Express Scripts Rx Benefit. I go right to the SingleCare App for incredible savings! Thank you! more Hi there, Thanks for taking the time to write us a review. It is delightful to hear such positive words and it's always a pleasure to serve our users. - Alyssa from the SingleCare Team more"
    },
    {
      "user": "Dtrz222277",
      "date": "05/29/2022",
      "title": "So far so good",
      "review": "Supplies the prices are good even better than other competitors which is surprising on some medication but not all but the key question is? For how long? I may be paying the same price for a particular medication for a week or two then it may go up or may not even be available any longer. These are no good is variables if become reality or not good actually there are acceptable. Do you want reviews do you want the truth this is the truth. And today this world well, truth is often poorly lit. Me I will tell you the truth. Thank you kindly and listen to the truth that don’t to me “listen to the truth which yes is coming out of my mouth but I am just a messenger for it what has made that razor-sharp reality are people like me that was in the thousands of them that is one person. One or two persons people can do much thousand and 1000s and look at my thousands are the same page well guess what they can move mountains that’s right yeah that works? That’s how that works. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "48.9 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English, Spanish"
}