{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Pocket ICU 17+",
  "subtitle": "Best-Selling Critical Care App",
  "seller": "Unbound Medicine, Inc.",
  "stars": "5.0",
  "rating": "1 Rating",
  "price": "Free",
  "appDescription": "New 3rd Ed. Available Now! FREE PREVIEW – View select topics to discover why this is a 'must-have' for all critical care pros (physicians, nurses, residents, students) ** Updated to include the latest 3rd edition content** New topics address bioweapons, disaster preparedness and critical care challenges of an air-transmissible, pandemic-causing pathogens like COVID-19. POCKET ICU FEATURES • Concise guidance written by attending physicians for everyone in critical care • Entries with diagnosis, treatment, and management details • Coverage of subspecialty areas including pediatric, neuro, cardiac, transplant, burn, and more • Detailed images, figures, and decision support algorithms • Overview of Statistics and Evidence-Based Medicine (EBM) • Helpful appendices provide pharmacological data, respiratory formulas, and cardiopulmonary relationships • Advanced Full Text Search helps find topics quickly • “Favorites” for bookmarking important entries • Highlighting and note-taking MORE ABOUT POCKET ICU With content from the highly regarded Pocket Notebook series, Pocket ICU provides users with an essential tool for quickly locating information from every subspecialty area of critical care. Entries have been written by attending physicians and are presented in brief but broad format so anyone in an ICU setting can quickly find answers and save time. This powerful resource can be downloaded to your smartphone and tablet and is great for preparing for rounds or consulting expert recommendations while on the ICU floor. Editors: Gyorgy Frendl, MD, PhD; Richard D. Urman, MD, MBA, CPE Publisher: Wolters Kluwer | Lippincott Williams & Wilkins Powered by: Unbound Medicine more",
  "reviews": [
    {
      "user": "Thespockeye",
      "date": "06/23/2021",
      "title": "CCT medic\n\n    Developer Response",
      "review": "Hi. Issues I mentioned earlier have been resolved. Billing through Apple, loading with just more time. Side point, I’ve had Pt’s very recently I needed to confer for guidance. One was young female, on CXR, CT very large mass directly myocardium. Was totally unaware asymptomatic. She sought attention for entirely unrelated issue. Discovered entirely by chance. Another unfortunately more common, pregnant Pt with acute asthma. They definitely didn’t know what they didn’t know. Covid has collected legions of very sick patients in outlying centers, overwhelmed and needing serious support. Previous ED destinations that had pts waiting out their doors & down the street, are getting them seen earlier in satellite ERs while waiting for admit beds to come available. The process is evolving. I appreciate your app, to review previous cases and prepare for plenty that’s new to me. Thanks. more Hello, thank you for reaching out to us. We'll need more information to find your account within our system. Please contact our Support department so we can help resolve the issue you're experiencing. You can contact us here via phone, email, or chat: Phone: 610-627-9090, M-F 9AM-5PM / Email: support@unboundmedicine.com Update 7/1: Thank you very much for your updated comment and review. We appreciate it, and glad you are finding the app useful. Thanks again! more"
    },
    {
      "user": "Dave Kaniecki",
      "date": "07/07/2019",
      "title": "For the cost you should get much more\n\n    Developer Response",
      "review": "The content is good but for the price I expected much more. Unfortunately I was unable to get my money back even after reviewing it for only less than an hour. more Our records show your purchase was made via in-app purchase. Apple does not share financial information of its users. For this reason, any refund requests should be directed to Apple. Users wishing to see the type of content as well as the interface for the app are encouraged to view the free preview that shows the index list of topics covered. more"
    },
    {
      "user": "angry NP",
      "date": "07/18/2020",
      "title": "My purchase\n\n    Developer Response",
      "review": "I purchased this app and no information loads. I would deter anyone from buying this, more We regret to hear that you are having a problem with the app. Please contact our Support team so that we may help you access your content. You can call our free live support at 610-627-9090 (M-F, 9AM - 5PM). more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "6.7 MB",
  "category": "Medical",
  "ageRating": "17+\n                Frequent/Intense Alcohol, Tobacco, or Drug Use or References\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English"
}