{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Ada – check your health 17+",
  "subtitle": "Know and track your symptoms",
  "seller": "Ada Health",
  "stars": "4.8",
  "rating": "11.2K Ratings",
  "price": "Free",
  "appDescription": "Get a health check for yourself and your relatives. You can check your symptoms online 24/7 and find out possible causes. Whatever's bothering you, from pain, headache, or anxiety to allergy or food intolerance, the free Ada app (symptom checker) could help you find answers from the comfort of your home. Doctors have trained Ada for years so that you can get an assessment within minutes. How do free symptom checks work? You answer simple questions about your health and symptoms. The AI of the Ada app assesses your answers against its medical dictionary of thousands of disorders and medical conditions. You receive a personalized assessment report that tells you what may be wrong and what you could do next. What can you expect from our app? - Data privacy and security – we apply the strictest data regulations to protect and keep your information private. - Smart results – our core system connects medical knowledge with intelligent technology. - Personalized health information – your guidance is personal to your unique health profile. - Health assessment report – share relevant information with your doctor by exporting your report as a PDF. - Symptom tracking – track your symptoms and their severity in the app. - 24/7 access – you can use the free symptom checker anytime, anywhere. - Health articles – read exclusive articles written by our experienced doctors. - Assessments in 7 languages – choose your language and change it from the settings at any point: English, German, French, Swahili, Portuguese, Spanish, or Romanian. - BMI calculator – check your body mass index (BMI) and find out if you’re a healthy weight. What can you tell Ada? The Ada app can help you if you have common or less common symptoms. Here are some of the most common searches: Symptoms: - Fever - Allergic rhinitis - Loss of appetite - Headache - Abdominal pain and tenderness - Nausea - Fatigue - Vomiting - Dizziness Medical conditions: - Common cold - Influenza infection (flu) - COVID-19 - Acute bronchitis - Viral sinusitis - Endometriosis - Diabetes - Tension headache - Migraine - Chronic pain - Fibromyalgia - Arthritis - Allergy - Irritable bowel syndrome (IBS) - Anxiety disorder - Depression Categories: - Skin conditions such as rashes, acne, insect bites - Women's health and pregnancy - Children's health - Sleeping problems - Indigestion issues, such as vomiting, diarrhea - Eye infections Disclaimer: The Ada app is a certified Class IIa medical device in the European Union. CAUTION: The Ada app cannot give you a medical diagnosis. Contact urgent care immediately in an emergency. The Ada app does not replace your healthcare professional's advice or an appointment with your doctor. We want to hear from you. If you have any feedback or just want to get in touch, reach us at hello@ada.com. Your feedback will be processed in accordance with our Privacy Policy [https://ada.com/raw/privacy-policy/]. more",
  "reviews": [
    {
      "user": "HoneyLemon*",
      "date": "06/12/2018",
      "title": "Very Accurate!",
      "review": "I don’t usually leave reviews, but this app has been incredibly helpful for me. For some reason this past year I went through a few rough illnesses, one in particular that no one was able to accurately diagnose. I was in the worst pain I have ever been in and everyone kept telling me that it was nothing, or that they weren’t sure what was causing it. With nowhere left to turn I decided to downloaded this app put my symptoms in to try and find out something about what might be going on. The app makes it clear that this is not a true medical diagnosis and that you should always seek help from a doctor in person when you can, but even still it came up with a few possible diagnoses that I was curious about. Nearly a week later, when my condition finally got bad enough a doctor was able to figure out what was causing the pain and it turned out to be the same diagnosis this app suggested as the most likely cause of my symptoms. Since this incident I have used the app a few more times and it has been very helpful and incredibly informative. more"
    },
    {
      "user": "Bookworm0917",
      "date": "12/14/2020",
      "title": "Programmed very well.. but could use some minor improvements",
      "review": "I’m diagnosed with bipolar disorder and ada has been able to help me distinguish between when I’m having an anxiety attack or when my muscle aches and pains were more than just side effects of my meds. However, I believe that ada could be improved if we were able to add pre existing conditions to our profiles, in addition to our prescriptions actually factoring into the reports. Am I feeling fatigued because of my meds? Or is it something else? Pre existing conditions and medications can make it that much harder to question if it’s more than a side effect. And especially in the times of Covid seeking medical help is just getting more expensive in the US. But ada has helped me see when I should and shouldn’t go to the doctor (they helped me recognize the symptoms of pneumonia in time for me to get diagnosed before my lungs would be damaged any further than they were). I love this program, I just wish we could add the illnesses we already have and the effects our meds have on us. Of course the devs can’t list every medication, but letting us list the symptoms those meds cause should be factored into ada’s reports. There’s more conditions other than smoking, diabetes, etc that ada currently lists, and I feel the preexisting conditions are very limited. And I hope my thoughts on this are seen by the devs and can be brought into consideration. more"
    },
    {
      "user": "froghead*rates",
      "date": "06/03/2019",
      "title": "It’s a lifesaver!",
      "review": "For someone like me, who’s always worrying about having the most major sickness when I only have small symptoms, ada is a lifesaver. Anytime you feel sick and anything hurts, you can use ada to type your symptoms down and answer a few questions about how you’re feeling. This includes things like, “how are your symptoms changing over time?” and if you have any other symptoms. It lists a number of different things you could have, some of them are less likely then others. You can read about the sickness and it even gives you remedies to treat it. This app has helped me a number of times, and it’s also very easy and simple to use. You can get a symptom assessment done in only a few minutes because the questions are simple and straight to the point. Still, you should always see a doctor if you’re worried, and I’m happy to say ada does also remind you that. I have nothing bad to say about this app at all. It even checks up on past symptom assessments to see if you’re doing okay! more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch",
    "Apple Vision"
  ],
  "size": "34.4 MB",
  "category": "Medical",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English, French, German, Portuguese, Romanian, Spanish, Swahili"
}