{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Amwell: Doctor Visits 24/7 4+",
  "subtitle": "Get Care with Telehealth",
  "seller": "American Well",
  "stars": "4.9",
  "rating": "44.9K Ratings",
  "price": "Free",
  "appDescription": "High-quality, affordable medical care is in the palm of your hands — and on-demand — with Amwell. Amwell is the best way to see a doctor from home or on-the-go. Our telehealth app connects you to board-certified, experienced medical providers. High-quality healthcare is now available, 24/7, with on-demand service or scheduled appointments, often with next-day availability. Amwell brings healthcare home through the power of telemedicine so you can feel better faster. AMWELL IS EASY AS 1 -2 -3 1. Download the app 2. Choose the type of visit 3. Choose your provider No more driving to the doctor or sitting in waiting rooms. With Amwell, quality medical providers are available 24/7, to help you feel better faster. AMWELL DOCTORS HAVE SEEN IT ALL Our experienced clinicians can provide the care you need quickly. Common patients concerns include: • Urgent Care: bronchitis, sinus & respiratory infections, sore throat, diarrhea, cold/flu, gout, strep throat, urinary tract infections, pink eye, hypertension, migraines, pneumonia • Therapy: depression & anxiety, ADHD/ADD, bereavement, trauma, couples therapy, stress, divorce, sleep disorders • Psychiatry: anorexia, bipolar disorder, panic attacks, PTSD, OCD, psychosis, insomnia, substance abuse • Nutrition: weight concerns, food allergies, meal planning, high blood pressure, pediatric nutrition, digestive disorders, pregnancy diets • Lactation Consulting: breastfeeding help AFFORDABLE PRICES FOR SERVICES YOU NEED We believe quality healthcare should be accessible and affordable. That’s why before insurance, Amwell costs: • $79 or less for urgent care • $99 starting cost or less for online therapy • $269 initial online psychiatry visit, follow-up visit starting at $99 • $70 or less for nutrition counseling visits • $129 initial breastfeeding support visit, follow-up visit $75 Have health insurance? Many major carriers cover Amwell visits. To check if yours does, simply enter your health insurance information to see the price you will pay for your visit. It’s that easy. PATIENTS AGREE - AMWELL IS EASY & CONVENIENT We couldn’t have said it better ourselves … take their word for it! • “[The visit] took 20 minutes and prescription has been called in. The same process with my local doctor would’ve taken 2 to 3 hours between drive time, wait time, visit, and returning back to work.” • “I honestly have to say this is one of the best new services I have ever used…I was able to download the app, pick a doctor, and “see” the doctor right from my iPhone.” • “The whole process is easy to set up, within minutes we were connected to a video conference with a medical professional who was very thorough but more important, really took the time to listen.” 100% SECURE & CONFIDENTIAL We take your privacy very seriously. Your visit with the doctor is confidential and HIPAA compliant. AWARDS AND RECOGNITION • Most Popular Mobile Telehealth Platform of 2014-2016 – App Annie • Best Telemedicine App of 2016 – Healthline • First telehealth service awarded accreditation by the American Telemedicine Association CONNECT WITH US To learn more or get your questions answered, please reach out to us! • Web: www.amwell.com • Facebook: www.facebook.com/amwellpatient • Twitter: www.twitter.com/amwell • Email: support@americanwell.com Please note that telehealth is not for emergencies. If you’re having a medical emergency, call 911. Any customer review may be used in marketing materials such as emails, fliers, blogs, or other promotional assets. Publishing a review is considered a grant of permission to share the review outside of the App Store. The review will be published anonymously. If you use Apple Health, you can choose to share your health information with the doctor during your video visit, such as heart rate, blood pressure, body temperature, blood glucose levels, weight, nutritional information, and respiratory rate. more",
  "reviews": [
    {
      "user": "Lolagirl123",
      "date": "01/04/2024",
      "title": "On point",
      "review": "Originally, I had booked an appointment with a different virtual clinic early in the morning when they sent my link to connect finally after waiting a couple of hours they gave me 30 seconds to connect which it took me about 33 seconds to actually hit the button because I wasn’t feeling well first of all need less to say they canceled my appointment.. so of course I tried to book another appointment with same clinic of course an hour and a half later they sent me the link to connect with the doctor. I literally held my fingers on my keypad just waiting on the link, but I guess I was slow at responding within 15 seconds, and again it was canceled shame on me, but I should have went to another virtual clinic at that time but when we’re sick, we do weird things so I book with them again needless to say finally at 9 o’clock on the day that I booked the same appointment with a clinic it took me all of 20 minutes to fill out everything I needed to fill out and be seen by my doctor and get diagnosed and get my prescriptions!! I will definitely be using Amwell from this day forward!! They definitely get five stars If I could give more, I would would definitely recommend this company!! Thanks am Amwell!! more"
    },
    {
      "user": "SinceritySpeaks",
      "date": "02/08/2018",
      "title": "Extremely Happy w/ This Service",
      "review": "OMG!!! I was super hesitant to try this service but didn’t feel like sitting in Urgent Care for hours for my particular issue. The intake process was surprisingly super fast! And the app is very user friendly. Once I completed my medical history and input my insurance information, I spoke with the doctor in less than 5 minutes! And this was around 2:30! Mid-day!!! When it’s usually impossible to get in and out of an urgent care facility. the whole process took less than 30 minutes! I promise, I do not write reviews, don’t have time, but I had to take a few moments to write this review b/c I was thoroughly impressed! The actual doctor, Dr. Cynthia Horner was AWESOME! She was patient with my explanation for calling in today, I did not feel rushed AT ALL, which sometimes happens in urgent care offices, she was on top of all of my questions and I felt very comfortable with her diagnoses. She even offered some encouragement around my fitness goals! I am so impressed and will definitely tell all of my friends about this experience! Thank you sooo much! more"
    },
    {
      "user": "review0621",
      "date": "05/06/2022",
      "title": "Poor experience in app + poor medical assistance\n\n    Developer Response",
      "review": "The application itself is very glitchy and buggy. There were multiple times the app crashed during setup. Once I did complete setup and attempted to connect with a provider online, I was told the provider I selected would contact me promptly. 15 minutes later there was no call and no record of the pending appointment anywhere on my account. There was no way to contact anyone or receive any kind of update. I attempted to set up another appointment in fear that I hadn’t properly set the original appointed - went through the entire process only to be told that my initial appointment was still pending, and I could not set up another appointment until the initial appointment completed. Another 15 minutes go by, and I finally get a call from a physician that was not the physician I selected. He then proceeded to tell me that he wasn’t authorized to prescribe antiviral treatments for Covid 19 because I was not high risk, even though that is not in alignment with the CDC’s most recent messaging. All in all, I spent hours and $80 to get told inaccurate information from a physician that was not the one I selected. While the $80 is the max you will pay, the app was unable to confirm my insurance carrier, so made me pay the full amount in full before I could see a physician. All in all - very poor experience and I will not use this app again. more Thank you for taking the time to let us know. This is important feedback and I will share this with the team. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Apple Vision"
  ],
  "size": "89.3 MB",
  "category": "Medical",
  "ageRating": "4+",
  "languages": "English"
}