{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Aysa 17+",
  "subtitle": "",
  "seller": "Logical Images",
  "stars": "4.6",
  "rating": "372 Ratings",
  "price": "Free",
  "appDescription": "From VisualDx, Aysa is the easy-to-use app to get personalized answers to your skin condition questions. Aysa helps you screen your skin symptoms and prepare for your practitioner visit. Key Features and Privacy: · Symptom Checker: Use the phone's camera to take a picture of your skin concern & Aysa quickly finds symptom matches to provide personalized, helpful information about the symptoms, all while protecting your privacy. · Symptom Content and Images: Symptom content and images to help improve user awareness about them. · Equity in care: Image library has representation of all skin types, including the leading skin of color image collection. · Privacy: Aysa protects your privacy by encrypting your image as it is sent to our machine learning model and discarding it immediately after analysis. About VisualDx and Aysa: Your skin is unique; skin conditions can look different from person to person. Aysa is built on the resources of VisualDx, the award-winning clinical decision support software focused on equity in medicine for over 20 years. Its curated library of more than 120,000 medical images includes every skin color and type, and what each of 200 skin conditions can look like at every stage. The workflow even allows you to select skin color, ensuring the best information and images possible. Aysa knowledge and recommendations are based on best available evidence ordered according to standard industry protocols, interpreted by expert opinion. Best available evidence is evaluated by source type, statistical validity, and clinical suitability. Content includes materials adapted from leading textbooks, literature review articles, PubMed, the US Centers for Disease Control and Prevention (CDC), the World Health Organization (WHO), and Infectious Diseases Society of America (IDSA). Leading content sources are reviewed, as is medical literature in general, with ongoing targeted searches in MEDLINE and PubMed. Editorial contributors and staff follow a protocol from most to least evidence: from meta-analyses and systematic reviews of randomized controlled clinical trials to cohort studies to case-control studies to case series to individual expert opinions. More Info: Terms of Use: http://www.visualdx.com/legal/acceptable-use-policy-notice Privacy Policy can be found here: https://askaysa.com/visualdx-privacy-policy/ The support URL can be found here: https://askaysa.com/contact/ more",
  "reviews": [
    {
      "user": "peacelovelaur",
      "date": "03/10/2022",
      "title": "Coolest app ever!",
      "review": "I work in dermatology and have tested this many times on many different people & it’s spot on every time! The questions are also super helpful bb with training those new to dermatology as well. I love the description about the diagnosis too. Absolutely incredible! The fact that it’s free makes it even better. 15 out of 5 stars! more"
    },
    {
      "user": "beezepgh",
      "date": "04/28/2024",
      "title": "Pretty good! Retired doc",
      "review": "After working in my yard (weeding with gloves), noticed a row of itchy- but tender- bumps along my wrist, some very tiny and one “main” one; they became red with a sort of salmon cast after a few days and didn’t resolve. At first, was reminded of a spider bite I got as a kid, with several satellite small bumps. They aren’t intensely itch but are pretty tender if I try to scratch. After about 4 days, i stopped wearing my watch to see if that affected it (nope). After a week or so, I applied topical steroid cream once, yesterday. These seems to be a little blistery looking. No new ones appeared. SO DECIDED TO CHECK THIS APP- it came up with several options, the top 3 of which are my top 3 diagnoses: insect bite/ atopic dermatitis/poison ivy. I’m sticking to insect bite since there is tenderness >> itching and no new lesions or spread since the first 24 hours. Putting watch on R wrist hasnt led to new irritation. I like the app for reassuring me that I wasn't likely missing anything! It Might be helpful to collect a little more history such as contact with allergen or outdoor or gardening exposure vs no outdoor exposure. more"
    },
    {
      "user": "Dishatto",
      "date": "07/29/2022",
      "title": "Not helpful",
      "review": "I hate to say it but this app is iré hype. I mean a lot of work went into it but like someone else said, it just gives you an encyclopedic list of ideas of what rash, bite, bruise, etc might be. And there are NO realistic pics to compare yours with. I mean, I had a mosquito bite which I uploaded just to see how good the app was and it gave me back a pic of a crusted purple sore and asked me if mine was like it. The pics they show you in all the suggested options they compare yours to look nothing like your own pic you’ve uploaded. You are better off googling what you think yours is and then clicking on ‘Google image’ - you’ll get a hundred images and easily find one that looks like yours which you can then click on and read about. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch"
  ],
  "size": "56.9 MB",
  "category": "Health & Fitness",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information\n                Infrequent/Mild Sexual Content and Nudity",
  "languages": "English"
}