{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Drugs.com Medication Guide 17+",
  "subtitle": "Know more about your meds.",
  "seller": "Drugs.com",
  "stars": "4.8",
  "rating": "8.7K Ratings",
  "price": "Free",
  "appDescription": "The easiest way to lookup drug information, identify pills, check interactions and set up your own personal medication records. Key Features Complete Drugs A – Z listings Fast search, accurate suggestion engine and the most comprehensive database of drug information available online. Pill Identifier Identify any meds simply by entering an imprint, shape or color. Database updated daily. Interactions Checker Provides a list of interactions that may occur when different drugs are taken at the same time. Also checks food interactions automatically. Personal Medication Records Add your medications to instantly assemble relevant medical information in a simple, easy to read personalized format. Access in-depth consumer information, FDA alerts, drug interactions, plus food, allergy and medical condition interactions. An invaluable tool for medication management and adherence. Discount Card Save up to 80% on your pharmacy prescriptions with our free drug discount card, accepted at over 63,000 pharmacies nationwide. Q & A Ask a specific question about your medication. Search on thousands of questions and answers. Health Professionals Quick access to all the tools you know and trust. Many more helpful tools. Quickly redo your recent searches. Try the Symptom Checker. Lookup specialised databases for side effects and dosage information. Not quite sure how to spell a drug name? Use the phonetic search. Drugs.com does not provide medical or treatment advice. Always consult with a physician. Follow us on Twitter @drugscom for tips and updates. About Drugs.com Drugs.com is the most popular, comprehensive and up-to-date source of drug information online. Providing free, peer-reviewed, accurate and independent data on more than 24,000 prescription drugs, over-the-counter medicines & natural products. Drugs.com is a multiple Webby Award nominee and attracts more than 24 million U.S. visitors per month. App Support If you have any feature requests, suggestions or you simply need help, please visit http://www.drugs.com/apps/support/ and our responsive support team will prioritize your request. Terms and Conditions are available at https://www.drugs.com/support/terms.html. more",
  "reviews": [
    {
      "user": "Most Important App",
      "date": "08/08/2023",
      "title": "Accurate and Absolutely necessary",
      "review": "If you take more than 2 pills a day, you need this app. Not only does it allow you to put in all your Rx AND over-the-counter drugs, but it notifies you of any contraindications & rates them from major (severe) to minor. It also explains the best way to take them, will let you know if there’s a recall even before it goes really public, and you can set the App up to notify you to take your medication. It will also check the Rx against your allergy list. Just recently , the app notified me that a new beta blocker I was prescribed had a major interaction with one of my chemos. It took my oncologist a week to find the source of that information in a tiny little article in JAMA, and it was absolutely correct. Things could have gone very south without that information and it was not in any of the Rx literature. This App also provides vital medical information when you or anyone else needs to know what you take in an emergency. You can also print out all the information either as a full sheet or as wallet cards to keep with you. The App is part of the WebMD/ Medline online medical resouce which is one of the best authoritative & updated sources of medical information . more"
    },
    {
      "user": "Dbchaos333",
      "date": "09/04/2020",
      "title": "Essential",
      "review": "If you are taking 4 or more meds, this app is essential. It has a pill identifier included that tells you what pill you have if you find one loose lying around the house, just enter the imprint and what it looks like. It also allows you to create a medication profile, where you list all your medications you take and it cross references them for interactions. It also lists all possible side effects, etc. Also, it serves as an emergency card in case of emergency and say you are in a car accident or knocked unconscious and sent to the hospital, if they can get into your phone and your not conscious to tell them what medications you are on , the hospital or ems people, or your family if they can get into your phone, can put together a list of what medications your on from your medication profile so they know what they can give you and how to treat you without hurting you or causing interactions. With some medications that is very important, such as nalaxone or suboxone, if you are on either of those and in a car accident and need to be intubated, it is essential for them to know you are on either of those two medications. Great app, many more features. If you take more than just a couple meds, this app is for you. more"
    },
    {
      "user": "Lilshorty217",
      "date": "10/05/2024",
      "title": "So helpful and convenient!",
      "review": "I’m chronically ill so I have several medications to keep track of plus me ones that I’m getting prescribed often for infections. The doctor say they don’t interact but I’ve had some bad reactions and didn’t know why. Well, now thanks to this app I can tell you why!! I even have to split my vitamins up and take them at a different time because they’ll interfere with meds. And I have to take my metoprolol at a two hour later window now both morning and night because it was interfering with my one of my other meds and causing an increase in my heart rate which was the opposite affect of why I’m taking it! Since then, problem solved. I needed more potassium because of muscle cramps thanks to ehlers danslos so I ordered some but added it on here and saw the LIFE THREATENING affect they’d have on my because of heart issues I had and basically told me DONT TAKE TAKE THEM. So I cancelled them right away. Over all this app is awesome and wonderful!! No doctor or pharmacist can do what this app can because they can’t keep all this information in their head. So this app is a must to be proactive about your own health! A++++ from me and thank you!!! more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "45.5 MB",
  "category": "Medical",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information",
  "languages": ""
}