{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Health Tracker: Healthily 17+",
  "subtitle": "Mood tracker & health tracker",
  "seller": "Webron Software LTD",
  "stars": "4.2",
  "rating": "392 Ratings",
  "price": "Free",
  "appDescription": "Health Tracker offers you tracking tools such as mood tracker,medication, symptom tracker and mental health tracker.Healthily cares about your health with Health Tracker Health tracker - Healthily cares about your health. You can use dozens of trackers such as health tracker, mood tracker, mental health tracker, medication tracker, symptom tracker, headache tracker. Our award-winning app is designed with leading medical options to help you stay in control of both your mental health and physical health. With Health tracker, you can create a tracker for your health in any area you want. Mood tracker is designed just for you to follow your daily mood! Follow your psychological state by entering your daily mood with the mood tracker. Learn how to keep your mental health strong to stay healthy from our health library. Our health library, which is necessary for mental health, has been prepared for you. Our in-house doctors review and review all our health and personal care content under the guidance of our clinical units of world-renowned medical experts. Do not skip your medication treatment with the health tracker and medication tracker you will create. Keep a regular record of your symptoms with the symptom tracker. Increase your symptom trackers with the headache tracker and mental health tracker. TRACK HEALTH PROGRESS Research shows that monitoring your mental health, healthy eating and activity can lead people to make positive changes; That's why we love our users in a healthy way. Follow your mood regularly with mood tracker. You are unique, so compare what works for you and your audience to build competencies that will create lasting change. Weekly progress reports also help you stay motivated, and you can even connect to Apple Health. TRY THE 28-DAY PLAN Are you ready to feel fitter, happier, healthier and more energetic? Get your health back on track with our 4 plans to restore fitness, sleep, mood and nutrition. You can determine which plan is best for you by taking a quick evaluation by our in-house doctors. The plan includes physician walkthroughs and guided empowerment modules to help you reach your health goal, as well as daily tracking statistics and weekly progress reports to help you stay motivated. Health tracker was developed for you together with doctors and with the latest health technology trusted by many people. CHECK SYMPTOMS AND GET EXPERT HEALTH TIPS Want health tips you can trust? Talk to DOT, our friendly and confidential chatbot, and browse our world-class library to learn the secrets of living healthily. Feeling unwell? Check your symptoms with DOT and decide what to do next. Or try our Smart Symptom Checker: www.livehealthily.com/symptom-checker TRY FREE FOR 7 DAYS LOOK AFTER YOURSELF SAFELY Healthily helps you look after your health with confidence. But we don’t provide medical advice, diagnosis or treatment recommendation. Always consult with your doctor before making medical decisions. See how to use Healthily safely (https://www.livehealthily.com/legal/safe-use) and our terms of services (https://www.livehealthily.com/legal/terms). COMPLETELY CONFIDENTIAL Our chatbot, trackers and journal have the ePrivacy seal of approval, so you know your data is private and protected. How we process your data and keep it safe: https://www.livehealthily.com/legal/privacy. more",
  "reviews": [
    {
      "user": "Shevanne",
      "date": "09/04/2022",
      "title": "Best health app\n\n    Developer Response",
      "review": "One of the best apps!!! Not only am I tracking everything important to my health and well-being like sleep, sleep quality, exercise, meditation and anything else I can think about but you can easily and reliable check your symptoms or anything that is bothering you… not to mention great articles that support healthy living. A great resource for wellness… highly recommended to help living a healthy life. more We're thrilled to hear you're enjoying Healthily, Shevanne! Thank you very much for your review. more"
    },
    {
      "user": "Ctelle1234",
      "date": "05/25/2022",
      "title": "Tons of misses\n\n    Developer Response",
      "review": "This app has a lot of promise based on the UI but way too many issues. 1) For some reason you can’t edit the actual initial setup of a goal afterward (like the icon or color, or scale). Yes you can adjust the goal metrics but what if I want to change how it’s configured? 2) There are two seemingly “default” goals (mood and energy). I didn’t see how to delete them, but rather “hide them”. Hiding them made them disappear into somewhere I wouldn’t know where to look if I wanted them shown again. 3) Metric scale doesn’t have ability to count 0 (therefore making something like counting number of drinks, with 0 being the goal, impossible. 4) Even the feedback form in the app seems faulty. Tried to use it but every time I tried to press return for a new bullet the form disappeared. Unsure if it was submitting or just closing out. 5) The graphs are a good start but I’d like to see a daily chart as well, not just weekly or monthly. For a paid app this just falls way short. Canceled my trial. more Hi Ctelle1234 - thank you for your feedback, we really appreciate your thorough review of our app. We're constantly updating our service to ensure the experience our users are getting is always evolving and improving. We would love to be able to contact you directly to pick your brains and potentially run some product testing. Could you please email support@livehealthily.com if this is something you'd be open to doing? Many thanks. more"
    },
    {
      "user": "Vizwald",
      "date": "06/20/2022",
      "title": "Tracking helps me reflect on my health",
      "review": "Taking the time to sit down and think about my health and it’s role in my day. It has helped me to confront and attack a lot of the problems with my health and live a better life overall."
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch",
    "Apple Vision"
  ],
  "size": "194.7 MB",
  "category": "Health & Fitness",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English"
}