{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Kardia 4+",
  "subtitle": "",
  "seller": "AliveCor, Inc.",
  "stars": "4.8",
  "rating": "120.6K Ratings",
  "price": "Free",
  "appDescription": "Kardia works with the FDA-cleared KardiaMobile, KardiaMobile 6L, or KardiaBand personal EKG devices, which can detect the most common arrhythmias in just 30 seconds. The Kardia app is designed to make managing heart care from home easier than ever, giving you the ability to seamlessly record EKGs, share heart data with your doctor remotely, keep track of your health history, and more. Capture a medical-grade EKG with your Kardia device anytime, anywhere—no patches, wires, or gels required. Get an immediate result from Kardia's Instant Analysis of normal, possible atrial fibrillation, bradycardia, or tachycardia. For additional analysis, you can choose to send the recording to your physician or to one of our partners for a Clinician Review by a cardiologist (US, Australia only) or cardiac care physiologist (UK, Ireland only). The Kardia system is recommended by leading cardiologists and used by people around the world for accurate EKG recordings. Track your heart health data from home with the medical accuracy your doctor can trust. NOTE: This app requires KardiaMobile, KardiaMobile 6L, or KardiaBand hardware to record an EKG. Get your Kardia device now at alivecor.com. Kardia integrates with Apple Health to create a combined view of your health metrics. NOTE: Requires KardiaMobile or KardiaBand hardware to record an EKG FDA 510(k) numbers: K191406, K181823, K171816, K183319 CE # 0123 more",
  "reviews": [
    {
      "user": "Crack a Book",
      "date": "10/20/2017",
      "title": "A True Personal Health Tool",
      "review": "I was having heart palpitations and brief rapid heart rate episodes lasting any where from minutes to hours. I went through the regular cardiac tests..... stress test, blood work, EKG, echo, and 48 hour mobile heart monitoring. The palpitations and rapid heart rate did not surface during these test. How discouraging, because my symptoms were real but not solid proof. My cardiologist was concerned but not convinced there could be a problem. I mean after all doctors work with concrete facts. I remembered I had a Kardia, AliveCor Mobile EKG which I had purchased a year or so before these symptoms to help with my mother's heart tracking. I started monitoring my palpitations with the view to sharing the results with my doc. I also used the device when I started to have longer rapid heart rate episodes which were sporadic and usually occurred when the Doc's office was closed. (Who can run to the doctor at a moments notice and get in? Not me) Bingo! Proof that my symptoms were real. I printed out the EKG records I had taken with my Kardia, faxed them to my cardiologist, and received a call the same day with the diagnosis of Afib. I truly believe a correct diagnosis came about faster, without a possible emergency room visit, and in the comfort/safely at home only because of this fabulous device and easy to use app. For under a hundred dollars it's the BEST investment in my and my family's health I have made. more"
    },
    {
      "user": "proactve patient",
      "date": "08/20/2019",
      "title": "Time Out",
      "review": "I have had atrial fibrillation for a number of years. During that time if I felt anything “off” I went to the ER. After relaxing and working with meditation all the symptoms went away every time. The doctors seemed to be as surprised as I was. There were many false alarms. At the hospital I was routinely checked-out. With 20 minutes of meditation all the systems were normal. My cardiologist was pleased with how I was being proactive. He showed me the Kardia app and I purchased it that day. The app gave me such peace of mind. I could use it to determine if I was having a heart event and needed to relax and check again to determine if I needed to go to the ER. Now, which is two years later, I have done routine daily readings and I’ve had no sign of a-fib except two times. I sent the results for an immediate reading and feedback. 20 minutes later—but using meditation and quietly coping whatever was going wrong had already resolved any concerns before my results even had been reported back to me. I keep my yearly check-ups and I’m doing great. Given my experience I recommend the Kardia app. It’s a great tool in your fight with heart disease. It’s peace of mind and no false alarm trips to the ER. It’s a huge piece of what I do to stay well and deal with my heart irregularities in a very wise way. Best of luck to anyone reading this post. more"
    },
    {
      "user": "dinghbat",
      "date": "04/14/2020",
      "title": "Great Tool - ICU RN gives thumbs up",
      "review": "30+ years in Critical Care nursing, and w/ a few health issues of my own now, I can only say “Wow!” This is a great tool for those wishing to know if they are having Atrial Fibrillation episodes so they can get prompt treatment. Treatment of A-fib is vital in preventing strokes, death, and disability. I was able to determine my skipped beats were not PVC’s from coffee consumption but PJC’s and probable culprit taking more levothyroxine than my thyroid levels warrant (plus my old pal, caffeine). Got my thyroid levels checked and Bingo! The intrinsic interpretation function will not give you that kind of diagnosis (only gives normal or not, a-fib or not options) unless you pay for an expert interpretation ($19) or get Premium package. If you can read ECG’s already, then this can help identify PSVT vs rapid A-fib, and many other dysrhythmias. No substitute for going to your provider, but the ability to share your rhythm strip is REALLY INVALUABLE. Option to carry it on your phone is brilliant because folks always have phones on their person to capture evrnts. I have added it to my first aid kit. Home health agencies should be using these and anyone doing wellness checks on older adults. I wonder how many lives this tool has saved, and how many strokes it has prevented? Amazing! Thank you! more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Apple Watch",
    "Apple Vision"
  ],
  "size": "394.7 MB",
  "category": "Medical",
  "ageRating": "4+",
  "languages": "English, Arabic, Czech, Danish, Dutch, Finnish, French, German, Hungarian, Italian, Japanese, Korean, Norwegian Bokmål, Polish, Portuguese, Russian, Simplified Chinese, Spanish, Swedish, Thai, Traditional Chinese, Vietnamese"
}