{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Maven Clinic 17+",
  "subtitle": "Virtual care for every family",
  "seller": "Maven Clinic Co.",
  "stars": "4.6",
  "rating": "353 Ratings",
  "price": "Free",
  "appDescription": "Maven is the world’s largest virtual clinic for women and families on a mission to make healthcare work for all of us. From family building and fertility to pregnancy, parenting, and menopause, we’ve got you covered with 24/7 care. Download the Maven Clinic app to: * Video chat or message with more than 35 types of specialists * Attend provider-led virtual classes and watch on-demand videos * Read thousands of exclusive MD-approved articles * (Sponsored accounts only) Meet with your own dedicated Care Advocate—your go-to expert for everything from in-person referrals to questions about your benefits If your employer or health plan sponsors Maven, activate your free membership today. Otherwise, book appointments and pay as you go. more",
  "reviews": [
    {
      "user": "honululie",
      "date": "12/01/2017",
      "title": "Mom Approved",
      "review": "I’m a busy mom of two small children, so it’s difficult for me to make a doctor’s appointment to discuss my health. I love this app because I don’t have to find a sitter or load up my children in the car to take them to sit in a waiting room. The funny thing is...I started using Maven as part of a paid focus group, and now I love it and will be using it often. The medical professionals are great. They really listen to you and offer practical advice. Being at home is very comfortable, and I feel safer discussing sensitive things like my sex drive or weight. Some medical professionals can even write you a prescription. The prices are great in my opinion. More often than not you pay less than a copay to get straight to the point with your medical questions. No filling out extensive paperwork. No germy waiting areas. No consulting forums with people who aren’t qualified to give you medical advice. Even sessions with specialized doctors aren’t too much more than an average copay. The app is attractive and very easy to use. Make sure you fill in your health binder, and writer a brief pre-appointment note to help your doctor, therapist, or nurse practitioner know what you need. more"
    },
    {
      "user": "Megoco11",
      "date": "02/25/2022",
      "title": "Maven is the best app for pregnancy/postpartum",
      "review": "I tried a few pregnancy apps, and Maven is by far my favorite app. The educational content is great - user friendly, actionable and clinically sound - and feels perfectly timed to what I'm experiencing. The app itself is really pleasant to use. I also appreciate the access to experts. I've been able to connect with a dietician and PT when I've had questions, as well as a care navigator who helped me understand how to use the app. The PT was really appreciated - there was a 3-4 week waitlist to get into a pelvic health therapist locally, but I was able to schedule with a MavenPT for the next day. I’ve also benefited greatly from the lactation support (thanks, Susie!!) since the baby came. We have access through my husband’s employer, and I’d encourage all employers to offer it. Not only did it improve our pregnancy experience, we saved so much time from not having to travel to/from appointments (I.e., we took less time away from our jobs), and we saved healthcare costs by not having to see specialists in person. more"
    },
    {
      "user": "Jessyoko",
      "date": "12/28/2019",
      "title": "Lifesaver",
      "review": "Maven is awesome. During all the crazy ups & downs of my fertility and pregnancy journey, Maven has been there for me. I’ve been able to get same-day video appointments and texts from exceptional practitioners. For example, I got a 7pm same-day appointment with a world class reproductive endocrinologist when I needed fertility advice after a miscarriage. When I had sharp sciatic pain, I got an appointment in less than an hour with a physical therapist who showed me exercises over video chat while I was in bed in my pajamas. When I have quick questions about what meds to take while pregnant or whether it’s ok to eat certain things, I message an OB and usually get a response in under 30 minutes. It’s so much better than going through my normal healthcare provider, where it takes weeks to get an appointment and every checkup is so transactional. Maven is quick, easy, and has great doctors. So grateful for Maven! more"
    }
  ],
  "compatibility": [
    "iPhone"
  ],
  "size": "136.7 MB",
  "category": "Medical",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information\n                Infrequent/Mild Sexual Content and Nudity",
  "languages": "English"
}