{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Medisafe Medication Management 12+",
  "subtitle": "Pill and Medicine Reminder",
  "seller": "MediSafe Inc.",
  "stars": "4.7",
  "rating": "90.9K Ratings",
  "price": "Free",
  "appDescription": "New Lock Screen widget now available! Never forget another medication. Never forget to take your meds and pills again with the MUST HAVE pill reminder ranked #1 by pharmacists and physicians in independent tests. Now in the U.S.: See crucial drug-to-drug interaction warnings about how your meds might conflict, as well as easily import your meds and prescriptions using Health Records on iPhone from more than 100 hospitals and health systems in the US. Be safe with your meds - Improper medicine use and dosage tracking leads to: • 50% of patients not taking medicines as prescribed • 125,000 deaths a year (one every 4 minutes) • 700,000 hospital visits a year • 44 out of 100 prescriptions never picked up at the pharmacy With Medisafe you won't put yourself or your loved ones at risk by missing a dosage -- or taking a double dose because nobody tracked. This is the MUST HAVE med app seen on Fox TV, ABC, Mashable, Inc. Magazine, Los Angeles Times, Boston Globe, Life Hacker, Fast Company, TechCrunch, and many more. Here's why: CLEAN & SIMPLE: Visual and easy medical manager to handle drug reminders. HEALTH APP INTEGRATION: Keeps track of your measurements and syncs them to HealthKit app: blood glucose, blood pressure, weight, pulse, temperature and in the US, medications from health records where available. REPORT SHARING: See your progress report and send it to the doctor or nurse as a visual informative PDF. FAMILY INTERACTION: Synchronizes the family's medicine pillboxes to one place, in real time. Manage your entire family from one account! MEDTONES: Various Medtones to make Medisafe playful and a great addition to your day: have Darth Vader, Dr Evil, Austin Powers, Elsa or your Nagging Mom remind you about your meds. REMINDERS: Reminds you to take medication doses on time every time, even if your device is asleep. Medisafe has timezone support too! No need to worry while traveling, your reminders are always on time. REFILL REMINDER: Rx refill reminds you when you need to restock your prescriptions. Pharmacists rank Medisafe #1 out of 461 apps they've tested, and MyVCM recognizes Medisafe for HIPAA privacy \"best practices in managing security and compliance.\" Medisafe does not provide medical advice, diagnosis or treatment. Always seek the advice of your physician or other qualified health provider with any questions you may have regarding your medications or a medical condition. Terms of Use: https://www.medisafeapp.com/terms-and-conditions/ Privacy Policy: https://medisafeapp.com/privacy-policy/ More info: FAQs: https://www.medisafeapp.com/help/ Pharmacists Rank Medisafe #1: http://bit.ly/2nTjmsI Contact us: support@medisafe.com Thanks, Medisafe Team more",
  "reviews": [
    {
      "user": "GeekyDragonfly",
      "date": "05/04/2022",
      "title": "I never knew I needed this so much!!!",
      "review": "This app!!! So simple to use and yet so powerful! I have struggled for years to keep up with my med schedule on my own (manually). When a friend suggested this app, I thought, “Why have I never considered trying to manage them through technology?!” And I am so amazed! Just Wow! It’s changed my life so much!! I literally have to take medicine every two hours, so getting an alert instead of having to watch the clock is such a game changer for me! Also, no more guessing whether I took a medicine or not … and what time I actually took it (which is important for timing out my meds because I can’t take certain meds too close together). I can look back and say, “oh yeah, I was late taking this med by 30 minutes, so let me reschedule this next med for 30 minutes later. Oh, and that throws off the schedule for these others, so let me “easily” reschedule those as well.” Entering all my meds into the app was so easy and being able to enter the Rx number, amount of pills left, and set notifications for when to refill … guys, I just can’t say enough. It’s one of the simplest apps on my phone, but one that has had the greatest impact on my life. Thank you (to the developers) for making such a great, well thought out, powerful but simple to use app. It’s simplicity to use is what makes it so great. Making it complicated would have detracted from its power as the time-saving, life-saving tool you’ve developed. more"
    },
    {
      "user": "حبي Viber",
      "date": "08/25/2023",
      "title": "App crashes when opening and unusable **updated below**\n\n    Developer Response",
      "review": "I have been using this app for years. Even though version 8 made some weird bugs appear it was never as bad as this latest update. I can’t open the app. I can't do anything as tapping on its icon makes it load and then after less than 3 seconds it instantly closes and the same thing happens if I reopen it. I tried to open it five times and the same thing happens. A phone restart did not fix this and I am now worried this update that the App Store says was released Sunday means I can’t keep track of meds **easily** as I have been doing for years until (if?) this weird bug gets fixed. I stuck with this app for years as it was the only way to make sure I 100% took my meds with my severe Obsessive Compulsive Disorder. Before using it I skipped meds rather than accidentally take a double dose (I forget and obsess about taking a medicine or not a looot….) so I am hoping this gets fixed within a week. I am editing the review to note that I never created an account for this app because of privacy worries so I can’t delete it and re-download it to see if that fixes it :( ***second edit added after the August 25th update follows***: it works! It works again!!!! Thank you, Medisafe team 🥳😁 more Hey there, we really appreciate you coming back and updating your review. We're glad to be assisting you in your health and wellness path. more"
    },
    {
      "user": "JBJ0507",
      "date": "06/19/2022",
      "title": "App saved my life!",
      "review": "I don’t usually take prescription medication but have had to recently due to medical complications from an emergency hospital visit. When I do I usually research the med and it’s side effects. Even in my research I don’t always come across every interaction it has with other foods or meds. Seems like more meds keep getting added to my care every other day. My doctor called me this afternoon with a new med based on some lab work. No mention to interactions with my current meds. My husband picks up the meds from the pharmacy, no mention by the pharmacist of any interactions. Load the new med into the app and check for interactions and critical alert and red is what I see. Immediately call the pharmacist and not only could I not take the med at the time I was planning, I can’t take it with 2 of my other critical meds. If it wasn’t for this app I don’t know if I would have found this interaction on my own but my doctors and pharmacist most certainly should have. With my vitals and current condition there was a high chance that I would have stopped breathing in the middle of the night. Thank you seriously! This app is amazing and I will keep using for every family member and love I can use it when I go down to just my supplements. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch",
    "Apple Watch",
    "Apple Vision"
  ],
  "size": "225.1 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English, Arabic, Danish, Dutch, Finnish, French, German, Hebrew, Italian, Japanese, Korean, Portuguese, Russian, Simplified Chinese, Spanish, Turkish"
}