{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "MyChart 12+",
  "subtitle": "Your secure health connection",
  "seller": "Epic",
  "stars": "4.6",
  "rating": "384.2K Ratings",
  "price": "Free",
  "appDescription": "MyChart puts your health information in the palm of your hand and helps you conveniently manage care for yourself and your family members. With MyChart you can: • Communicate with your care team. • Review test results, medications, immunization history, and other health information. • Connect your account to Apple Health to pull health-related data from your personal devices right into MyChart. • View your After Visit Summary® for past visits and hospital stays, along with any clinical notes your provider has recorded and shared with you. • Schedule and manage appointments, including in-person visits and video visits. • Get price estimates for the cost of care. • View and pay your medical bills. • Securely share your medical record from anywhere with anyone who has Internet access. • Connect your accounts from other healthcare organizations so you can see all your health information in one place, even if you've been seen at multiple healthcare organizations. • Receive push notifications when new information is available in MyChart. You can check whether push notifications are enabled under the Account Settings within the app. Select features are also available on Apple Watch. Note that what you can see and do within the MyChart app depends on which features your healthcare organization has enabled and whether they’re using the latest version of Epic software. If you have questions about what’s available, contact your healthcare organization. To access MyChart, you must create an account with your healthcare organization. To sign up for an account, download the app and search for your healthcare organization or go to your healthcare organization’s MyChart website. After you’ve signed up, turn on Face ID, Touch ID, or a four-digit passcode to quickly log in without needing to use your MyChart username and password each time. Then, make sure you have push notifications enabled to receive updates on your device when new information is available in MyChart. For more information about MyChart’s features or to find a healthcare organization that offers MyChart, visit www.mychart.org. Have feedback about the app? Email us at mychartsupport@epic.com. more",
  "reviews": [
    {
      "user": "Ream Mail",
      "date": "02/03/2022",
      "title": "Life Changing 5*\n\n    Developer Response",
      "review": "Until someone in my community had shared their journey with Ochsner and their ability to communicate via messages and Zoom with their doctors, I was not familiar with the app for Ochsner nor had I ever been a patient there. I’ve currently been going through fighting cancer and was not receiving care that needed in Mississippi. I downloaded the app; the world opened up. All the specialists I needed to see were right there at my fingertips suddenly as well as the ease and simplicity too schedule appointments at my desired location/time/provider. In addition I’ve since been able too experience Ochsner and if could give more than 5*, I definitely would be. I had to have an EUS done there; every single individual I encountered regardless of involved in my care directly or indirectly, they ALL showed such kindness, respect, compassion, that I’d not had this kind of care anywhere else. And I mean everyone I crossed paths with and not just on the date of my procedure but also at a whole different location where I went to see my new Ochsner oncologist at Luling and again 5* too infinity more, because everyone right down to the receptionist and the individual working at their tiny cafe was AMAZING! Thank you Ochsner for choosing employees that are obviously happy to be there doing what they do, I am quite grateful!! Keep up the great work! more Thank you for your review! We are glad to hear MyChart is working well for you. more"
    },
    {
      "user": "Stephi2boobies",
      "date": "03/16/2023",
      "title": "Everyone should use MyChart\n\n    Developer Response",
      "review": "I’ve worked for the U of U and I’ve also been a patient for the U of U healthcare. MyChart is the easiest, most efficient way to communicate with your provider and your healthcare team, to communicate with you. I always encouraged patients to use MyChart instead of relying on telephone calls. You see, if you don’t use MyChart and only communicate via a phone you will have greater wait times when you are expecting a result for a test, an answer to a question, or a prescription refill request. We are not allowed to leave any info on a voicemail so all you’ll get from a missed call is the name of the person calling and a callback number. With MyChart you will get your answer or results with the first correspondence. It’s secure and so easy to use. You get a text notification whenever anything new pops up so it’s hard to miss a result or response from the provider. If you rely on the phone remember that if the medical staff calls you and you don’t answer you go to the end of a very big line. It can take 2-3 days before you make it back to the front of the line. MyChart allows you practically instant access to your results. It’s a godsend for both the patients and medical staff. I highly recommend it if you want an efficient way to communicate with your provider. more Thank you for your review! We are glad to hear MyChart is working well for you. more"
    },
    {
      "user": "Universe Observer",
      "date": "07/21/2023",
      "title": "Almost perfect.\n\n    Developer Response",
      "review": "02 Jul 2023 I have been using the MyChart app from Epic for over 10 years and it has been great at providing the information I need in the spectrum of health services that I am provided with. There are a few things that the app / providers need to perfect MyChart however for it to be up in the five star range. 1. You need to enable the saving of all records regardless of type by the patient user as a PDF file. Having to take scrolling screen shots and save them so they can be opened into an image to PDF converter is a real pain. Safari already allows PDF saving of browser windows, MyChart needs to do the same. 2. Lab results, Practitioner Summaries and Notes, Radiology reports, surgery procedure notes and summaries need the ability for the patient to email them to primary and other secondary providers without having to go through the hoops in Item 1 and then emailing them. 20 Jul 2023: Received reply from Epic. I have used the Web site instead for Item 1; but, it will be more convenient from the app. Will update when that happens. The emailing is an isdue however that currently is only addressed by downloading a PDF the uploading on other providers portals rather than directly from MyChart. I find myself constantly having to do this because providers do not update secondary providers and visa versa. I feel like a mouse on an exercise wheel having go do the work that providers should be doing. more We are always looking to improve the experience for our users, and really appreciate the feedback. Printing is available from the website version of MyChart and will be added to the mobile app in a future release, along with the ability to save documents from the app as PDFs. If there is anything else we can look into, please contact us at MyChartSupport@epic.com. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "Apple Watch"
  ],
  "size": "101.3 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English, Arabic, Danish, Dutch, Finnish, French, German, Norwegian Bokmål, Portuguese, Simplified Chinese, Spanish, Swedish"
}