{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "mymediktor - Symptom Checker 17+",
  "subtitle": "Solve your health questions",
  "seller": "Teckel Medical s.l.",
  "stars": "4.7",
  "rating": "169 Ratings",
  "price": "Free",
  "appDescription": "Solve your health questions from the first symptom. Check your symptoms for FREE. The symptom checker allows you to input how you feel with your own words. Its artificial intelligence picks the questions a professional would ask to get to a list of possible conditions and a recommendation. See the description of diseases in our dictionary. Please do not hesitate to send us your suggestions or comments: info@mediktor.com Specs: Artificial intelligence and natural language interpretation. Compatible with the Apple Health App for the integration of vital signs. CE - 7074-PS License Mediktor is a sanitary licensed medical device. It complies with all the essential requirements and with the conformity assessment procedures that are applicable to it according to AEMPS and European Union regulations. This tool does not offer medical advice. It is provided for informational purposes only. Do not use it to replace professional medical advice, diagnosis or treatment. If you believe you may have a medical emergency, call your doctor or the Emergency Medical Services immediately. more",
  "reviews": [
    {
      "user": "Tikimuni",
      "date": "05/11/2017",
      "title": "Impressed",
      "review": "Very accurate."
    },
    {
      "user": "marcelochamba",
      "date": "08/15/2017",
      "title": "Excelente",
      "review": "Excelente aplicación resolver tus dudas con profesionales médicos en tiempo real!!!!"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Apple Vision"
  ],
  "size": "43.3 MB",
  "category": "Medical",
  "ageRating": "17+\n                Infrequent/Mild Sexual Content and Nudity\n                Infrequent/Mild Alcohol, Tobacco, or Drug Use or References\n                Infrequent/Mild Mature/Suggestive Themes\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English, Arabic, Catalan, Dutch, French, German, Greek, Italian, Japanese, Korean, Portuguese, Simplified Chinese, Spanish"
}