{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "PainScale - Pain Tracker Diary 12+",
  "subtitle": "Chronic Pain Management Coach",
  "seller": "Boston Scientific",
  "stars": "4.5",
  "rating": "431 Ratings",
  "price": "Free",
  "appDescription": "The popular pain tracking app for mobile! Join over 100,000 chronic pain patients who manage and scale their pain and symptoms with PainScale; the highly-ranked pain tracker health app on the web! The PainScale app offers a FREE suite of pain management tools to help chronic pain patients to scale their pain and manage a pain tracker diary! Created with input from doctors and chronic pain patients, the Pain Diary acts as a pain tracker and organizes all the information the patient needs in one accessible location. With over 800 organized articles, health tips, exercises, and information on pain meditation programs and treatment options, pain management becomes easier. PainScale provides personalized pain management education for users. Trusted content is available to help people understand their symptoms and better manage their condition. By providing insights to a community of other patients who share their treatment information, PainScale helps patients discover information on treatment options that may work for their condition. PainScale is an easy and simple to use, pain and health tracker app. Features • Pain Diary – log and track your pain to track triggers, pain intensity, symptoms, treatments, medications, activity, mood, and sleep digital scale. • Pain Reports – get and send summary and detailed reports for better patient-physician communication, you can take all the information you need from the Pain Diary. • Insights - personal tips to help you discover information on treatment options to better manage your condition • Trusted Content – get FREE access to a searchable library of articles, videos, and meditations to help find pain relief • Daily Health Tips – get daily meditation, stretch, and exercise routines, everything you need to help you cope with your chronic pain • Apple HealthKit Integration – simplified and seamless connectivity with Apple Healthkit for tracking health and fitness activity • Reminders – get reminders to help stay engaged with restoring your health • Care Team Communication - and tap-to message functionality that connects you directly with your Physician and Support Network • Customize your experience for pain management with a personal profile ? Get the info you need in the following topics: • Chronic pain • Pain relief • Lower back pain • Back pain • Neck pain • A migraine • Fibromyalgia • Failed back surgery • CRPS • Arthritis • Pain management • Coping • Neuropathy • Nerve pain Get Help: contact us at help@painscale.com Visit Us: Access your account on the web. Log in at https://www.painscale.com Like Us: Join the PainScale community by liking us on Facebook https://www.facebook.com/MyPainScale/ What are the things that make your pain increase, what spikes or triggers it, and what helps you the most? PainScale helps you get actionable insights to better your pain relief and health in general. Pain scale and pain diary have been used by physicians for almost five decades – it is one of the most valuable tools in pain management. Painscale.com takes advantage of the modern digital technologies to provide an easy to use pain tracking solution using the same proven pain management methods. PainScale.com web site and the app is designed for educational purposes only. If you have any concerns about your own health or the health of someone else, you should always consult with a physician or other healthcare professional Download Now PainScale - Free Chronic Pain Tracker Diary!!! more",
  "reviews": [
    {
      "user": "Coeur de Parisienne",
      "date": "08/26/2020",
      "title": "Exactly What I Needed & Been Searching For...",
      "review": "So I have to keep track of my cancer pain. It’s in my bones among other areas in my body. My pain management dr needs to understand the issues better than my brain dead answers the day I see her give. This app takes care of everything about the pain records I need to keep. It goes into great detail so that I may have the answers directly bob hand. During this pandemic, when my Drs appts are strictly done by video, this is perfect so that I can have the info right at my fingertips. It also helps when my wife needs to understand how bad it is for each day and understand when the breakthrough pain takes control and I need to seek emergency care. This is an amazing app. It should be shouted from the rooftops to help all suffering from any pain. more"
    },
    {
      "user": "Mamakoki",
      "date": "04/13/2024",
      "title": "Good app",
      "review": "I started sending a review because I got the map and the segments where not as shown when I purchased the app. This is an option in the upper right corner. You CAN change body maps. It will erase all data from previous but this more segmented map is what should appear in the app when you open it. It is MORE appealing with more options to choose your pain location and many people will not figure this out. You should change that quickly. So when one opens the app they see what they have indeed purchased and not something else, initially getting bummmed that it’s not what the purchased page showed and much later finding out it was there as an option. Weird business if you ask me. more"
    },
    {
      "user": "Ginny Beans",
      "date": "07/29/2020",
      "title": "Best Free Pain Tracker Out There",
      "review": "I’ve tried using other pain tracking apps (even paid for a few), none of them have been as detailed as this. It is easy to use and the data collection is excellent. I have a difficult time expressing the severity of my pain to my doctors. This app is a must if you have chronic pain, with or without a diagnosis. The suggestions for managing your type of pain is so helpful. I especially appreciate the reminders for tracking, I always forgot to keep my logs with other apps and then couldn’t be specific during my check ups. This allows my doctors to have insight on my conditions activity. Living in pain is difficult, but with this app you don’t have to feel alone. Thank you for this app it has changed my life. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch"
  ],
  "size": "75.6 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English"
}