{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Spruce: Medical Communication 12+",
  "subtitle": "HIPAA phone, text, video, fax",
  "seller": "Spruce Health",
  "stars": "4.9",
  "rating": "62.3K Ratings",
  "price": "Free",
  "appDescription": "Spruce is the leading platform for HIPAA-compliant communication and care outside of the exam room. Call, text, fax, secure message, video chat, and more—all from one secure app, with a unified team inbox. Designed for healthcare professionals and their patients, Spruce takes your clinical operations to the next level, with powerful, easy-to-use tools for team collaboration, panel management, telehealth, business phone functionality, and automated custom communications. Healthcare Professionals: Start your free 14-day trial today—no credit card required. Patients: Spruce is always free. Download to connect with your care team for secure messaging and telehealth.⁣⁣⁣ — SPRUCE FOR HEALTHCARE PROFESSIONALS — • Get new phone and fax numbers, or transfer in your existing lines • Robust mobile and desktop apps • Built-in compliance: Automatic HIPAA BAA, two-factor login security, SOC 2 auditing, HITRUST certification, and automatic audit logging for communication read, write, and view • Advanced phone system: Phone trees, multiple lines, secure voicemail, automated transcription, VoIP, number sharing • Messaging and fax: Secure individual and group messaging, two-way SMS texting, secure two-way eFax • Telehealth: Secure video calling, as well as adaptive clinical questionnaires for patient intake and screening • After-hours: Automated schedules adjust your phone system and messaging to match your business hours • Automation: Save messages for reuse, schedule messages for future delivery, implement automatic message responses for common needs • Panel management: Contact and conversation tagging, patient list upload, advanced search, bulk messaging, and custom inbox configuration and communication routing for each team member • Team collaboration: Secure team chats, shared inboxes, internal notes, and @-paging bring the features of modern team software to the healthcare space • And more…! — SPRUCE FOR PATIENTS — • Sign in to a free and secure patient app, on mobile or desktop • Receive video calls from your care team • Send and receive secure messages, including photos • Receive alerts for new activity Ask your healthcare team for an invitation to connect on Spruce. If they're not on Spruce yet, ask them to sign up today! more",
  "reviews": [
    {
      "user": "Matrixwood10",
      "date": "08/14/2021",
      "title": "Greatness",
      "review": "They have been completely a lifesaver to me and has helped me completely with my issue and has made it easier to have more people to talk to about my problems and they’re available more to me than my other doctor was. Which I went in and seen him once a month and he only gave me about five minutes of his time. These people are used doctors and others that are included in your program will spend more time with you answer more questions and they have done that for me more than the two years than When I was seeing my Other Doctor. Anybody that is suffering and Suboxone works for them I truly highly recommend the service because I’ve struggled 20+ years on opiates and the Suboxone has been the only thing that has helped that’s giving me some freedom back so give these guys a try if you read my review you won’t be disappointed. -James Clark more"
    },
    {
      "user": "crunchfrog",
      "date": "04/26/2024",
      "title": "Thank you Spruce development team!!",
      "review": "The Spruce product and engineering teams deserve some recognition—3 weeks ago, I submitted a feature request through the feedback link in the app, and within a few short weeks they had implemented it! Maybe they were already working on it, but what a coincidence! Check out the new privacy screen they added in v4.4.4. When you switch apps and Spruce is put in the background, instead of continuing to show your private conversation, now the app content is covered with a full screen app logo. You won’t see it in action until you switch back to the Spruce app, which will then fade out the privacy screen and show the normal app content. Thank you again Spruce engineering and product teams for prioritizing user privacy and for making the privacy screen behavior so natural that I think most people will just be happier and feel safer, without consciously knowing why. For me, what a treat it is to experience firsthand the generous responsiveness and skillful implementation of the engineers. Way to go! And if one of you wants to tell me where your office is, I’ll send cookies in thanks! :o) Hehe. Keep up the great work! more"
    },
    {
      "user": "Pipsquacky777",
      "date": "06/03/2019",
      "title": "I Highly Recommend Spruce\n\n    Developer Response",
      "review": "I recently switched my private counseling practice over to Spruce and my only regret is n not having done it sooner. I love being able to send and receive faxes in my phone. Having a secure phone “line” that uses my existing phone is wonderful. I can tag clients so I can do searches for people with similar issues and email them information that might be relevant to them. I can “page“ myself to remind me to do a client related task or follow up with them. (It’s kind of like the marking.) I can get off of the phone with a client and immediately write a note to document the call. I can do video sessions. I’m looking forward to improvements such as clients being able to access from their PC (right now they have to use a smart phone) and better reporting so that I can more easily send out the client records when requested. But they’re a great service for a great price. My anxiety level has literally gone down because of the seamlessness of this service. Thank you Spruce! more Thank you for taking the time to share your experience on Spruce — we appreciate it and are glad to hear that you are using many of Spruce’s features to their full potential in your practice. We wanted to let you know that we recently made it possible for patients to use Spruce on their PC (in addition to their smartphone). Please get in touch so we can help set this up for your practice. Our team is available via the support chat in-app or by email at support@sprucehealth.com. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Apple Vision"
  ],
  "size": "108.9 MB",
  "category": "Medical",
  "ageRating": "12+\n                Infrequent/Mild Medical/Treatment Information",
  "languages": "English"
}