{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "Symptomate – Symptom checker 17+",
  "subtitle": "Check your symptoms",
  "seller": "Infermedica",
  "stars": "4.6",
  "rating": "130 Ratings",
  "price": "Free",
  "appDescription": "Have you noticed some worrying symptoms recently? Our short interview, created by doctors and powered with AI, lets you check them anytime. It’s fast, it’s free, and it’s anonymous. Symptomate analyzes thousands of symptoms and connects them to just a few conditions, narrowing the number down from hundreds. Symptomate is appropriate for conducting a preliminary assessment of both child and adult symptoms. HOW DOES IT WORK? 1. Choose the person to be interviewed (either you or someone else) 2. Add basic demographic data 3. Enter a few initial symptoms 4. Answer a series of symptoms-related questions 5. Get a list of the most probable conditions and associated recommendations including: triage level, medical specialization, appointment type, and related educational content. WHAT TO DO WITH RECOMMENDATIONS? * read them to better understand your health * use them to choose the right medical care * print them out to prepare for an appointment Important: Symptomate does not store any of your data. It is 100% anonymous. It is up to you whether you'd like to use its calculations or not. EXTRAS * simple language of medical content * explanations and instructions * interview mode for parents and care-givers * educational content on conditions * tips on home care for mild conditions SYMPTOMATE AT A GLANCE: * 5 levels of possible care * 1600+ symptoms * 840+ conditions * 300+ risk factors * 60+ engaged physicians * 84,000+ hours of doctors’ work * 95% of recommendations accuracy * 15 language versions: English, Spanish, Chinese, German, French, Portuguese, Arabic, Dutch, Czech, Turkish, Russian, Ukrainian, Polish and Slovak LEGAL NOTICE Symptomate does not provide a diagnosis. It is for informational purposes only and is not a qualified medical opinion. Do not use it in emergencies. In case of a health emergency, call your local emergency number immediately. Your data is safe. The information you provide is anonymous and not shared with anyone. Read more in our Terms and Conditions (https://symptomate.com/site/terms-of-service/), Cookies Policy (https://symptomate.com/cookies-policy/) and Privacy Policy (https://symptomate.com/privacy-policy/. more",
  "reviews": [
    {
      "user": "why do you need to know 🫥",
      "date": "05/11/2024",
      "title": "it helped a lot!",
      "review": "I woke up the other day and felt horrible, I didn’t know what to do so I asked my mom to bring me to quick care or something, thinking it was nothing, my mom decided to just wait until she finished making lunch for my dad. In the meantime, the whole thing got even worse within seconds so I searched up my symptoms in order to see what I had or what I can do. Then I stumbled upon this app, i put all my symptoms and problems, and they told me to go to the er. I told my mom and she immediately took me down there. Turns out, I had a disease that was almost deadly if left untreated. I’m super thankful that I saw this app! more"
    },
    {
      "user": "rinilynn",
      "date": "04/23/2022",
      "title": "Spot on",
      "review": "I was putting all my symptoms to check this out and I have done certain area and with all the symptoms it says multiple sclerosis which I have been diagnosed. I have been concerned with the rheumatoid arthritis and it says that it’s high or whatever. Then I focused on my stomach and I have been diagnosed with irritable bowel syndrome which is what this said it could be. Now going to add in my back pain and see if it matches up with what this colonoscopy tells me. This app is pretty cool!! more"
    },
    {
      "user": "PDF Paul",
      "date": "09/10/2021",
      "title": "Can’t Handle Multiple Health Problems",
      "review": "This app, like most doctors, simply don’t understand that people get more than one health problem at the same time. This hyper-advanced concept is simply rejected these days because it forces doctors (and apps) to actually think… instead of being told what to think. They get so confused. If you are diabetic with sleep apnea, this app gets just as confused as any doctor. But this app is easy and fantastic if you just have one problem. Nice interface and easy to use. I give it five stars for basic issues. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPad",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "8.1 MB",
  "category": "Health & Fitness",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English"
}