{
  "imageUrl": "/assets/artwork/1x1-42817eea7ade52607a760cbee00d1495.gif",
  "title": "YourDoctors - Online Doctor 17+",
  "subtitle": "Talk To A Doctor Online, 24/7",
  "seller": "HealthATech Solutions Inc.",
  "stars": "4.5",
  "rating": "4.8K Ratings",
  "price": "Free",
  "appDescription": "Skip the wait time at the emergency or the doctor's office. In minutes, we connect you with a healthcare provider who can diagnose, prescribe, and issue medical notes. See an online doctor hassle free without appointments or wait time. Skip the waiting queue at the doctor's office and get seen within minutes and get a prescription, refills, sick or medical notes, and more. Get diagnosis and medication prescriptions online from home. No insurance is needed to consult with a family doctor virtually. Your Doctors Online provides a constant communication channel with a doctor, enabling you to obtain a diagnosis quickly. Our 1M+ 5-star rated users adore our online physician services. Contact one of our qualified doctors at any time, anywhere for urgent care. Even on holidays, we remain open round-the-clock. Here is what our patients are saying about Your Doctor: “This is the best app...You can ask anything, and the doctors answer you within minutes, I love it. ” “Impressive work!! Connecting with a doctor was so quick. I am impressed. ” What kind of issues our doctor help with? Our doctors can help with many medical issues ranging from: - Sexual Health - Pregnancy - Cold or Flu - Skin - Children's Health - Prescriptions - Prescription renewals - Birth Control pills - Medical notes and more How to consult with online doctors at Your Doctors Online? Connecting with a doctor is easy. Download the app and begin requesting a consultation with a doctor. You can connect for unlimited visits with a doctor that gives you prioritized access. Some of our features include: - Available 24/7 - See a doctor with no wait time - Get a diagnosis, prescription, lab requisitions or sick notes, and more - See your medical history and health progress - Pick up a prescription at your local pharmacy or get it delivered to your house with our pharmacy network Is our service secure? Our foremost priority is to ensure your safety and security. We safeguard your data by encrypting it thoroughly, testing it frequently, using account security measures, and implementing other procedures and policies in line with the highest industry standards. Your medical history is only accessible by you and our medical team serving you. -------- Privacy Policy : https://yourdoctors.online/patient-terms-of-service/ Terms of Service : https://yourdoctors.online/terms-of-service/ more",
  "reviews": [
    {
      "user": "cja1978",
      "date": "03/08/2019",
      "title": "This is actually real",
      "review": "I was up in the middle of the night worried about a possible medical issue developing. I was doing all kinds of online searches but wasn’t satisfied with what I was finding. I then searched for “online chat with doctor” and found this app. I was extremely skeptical and figured I would have to pay once installed and I wasn’t prepared to do that as I didn’t know whether this was a legitimate app/service. However, it said I could chat for free immediately. I went ahead and entered my information and question and for some reason, I was lucky enough to be first in line. Dr. Mary Jensen was so helpful. She immediately told me what I could do to address this concern at home (it was the type of issue that genuinely could be dealt with at home, at least initially, and then if that doesn’t work, I suppose I will go in to visit a doctor and get prescription medicine, if required). I can’t tell you how happy and relieved I am. I had that type of anxiety which is acutely heightened at night and I am so grateful to have been able to address this concern immediately. I actually think this app is worth paying for now, (but the beauty of it is that there is also some service provided for free) and if you are parents of little ones, like I am, it could be really useful, in particular. more"
    },
    {
      "user": "inoreview",
      "date": "01/25/2022",
      "title": "Quick Response to Late Night Anxieties",
      "review": "This app was a very quick and efficient way to take care of my medical anxieties. I had a recent scare with a possible Tetanus infection. There was not a lot of answers I could find online for my specific case, so I went to look for a real chatroom, and happened on this app. The prices are a bit steep for average app fees, but definitely not as steep as going to urgent care in the USA. Additionally, it took not even 20 minutes to chat with a real doctor instead of possibly being put on hold for hours on end with other 24 hour services. With quick, efficient, and good advice, the session was over with what to look for and what to keep doing. Additionally, theres a free 3 day trial to make sure that this service is right for you. A perfect amount of time to get quick service when you need for a first time. They also have different plans for perhaps more chronic issues or, like me, getting service for a once in a while medical inquiry. Additionally, the app features other handy tools such as a way to track vaccinations as well as view past chats. I haven’t explored to many of the features deeply, but it’s nice to see a logging feature on a medical app like this. Obviously not a replacement for the ER, but a great app to turn to for more urgent and primary care type questions, especially with Covid19 making going to the doctor less of a chore and more of a gamble. more"
    },
    {
      "user": "SDH26",
      "date": "11/27/2021",
      "title": "Scam app. Positive reviews you see for this app were paid for by people who never used the app\n\n    Developer Response",
      "review": "This app is a scam. I used this app based on some fake reviews I read here in the App Store and online and the fact that I have used a real online doctor app before. Now, as for the SCAM? First…You’ll notice when you speak to a “doctor” that they literally just give you a copy and paste of what your problems could be from WebMD’s website. After that, they’ll say they’ll give you a prescription for your needs. Mine happened to be $19. They asked for which pharmacy I’d like to receive my meds at, and proof (picture) of my ID. Then, they’ll send a link (this link will have no actual proof of anything just a link for standard payment) once paid, I didn’t receive any follow up about my meds. I waited 24hrs and went to cvs to get it and nothing was there. I contacted a doctor via the app again, and they said I should receive an email when it’s been sent to the pharmacy. After 3 days of back and fourth with CVS (mind you, the free trial is 3 days) it was confirmed that no prescription was sent. Nor was one on the way. They also confirmed that doctors nor hospitals can verify when you’re prescription is ready for pick up. Only the actual pharmacy can do that. In short? Save your time, headache, and overall money. I’d give zero stars if I could. more Hello. Sorry to hear your experience was not to our standard. To prevent this from happening again, we hired a team of pharmacists that get in touch with the pharmacy on your behalf to ensure the prescription has been delivered. Our team processes all prescriptions within 24 hours, and you are entitled to a full refund if our team is unable to send your prescription to your pharmacy within the given time frame. I am hoping that by now, you have received a full refund for the experience you had with us in the past but in case you haven't, kindly contact support@yourdoctors.online. We apologize for not being able to provide you with the best service, but your feedback helped us improve. We hope that you would be able to give our application another chance to see the difference your feedback has made. Thank you. more"
    }
  ],
  "compatibility": [
    "iPhone",
    "iPod touch",
    "Mac",
    "Apple Vision"
  ],
  "size": "85.6 MB",
  "category": "Medical",
  "ageRating": "17+\n                Frequent/Intense Medical/Treatment Information",
  "languages": "English"
}