{
    "title": "Medgic - AI Skin Analysis",
    "description": "Medgic’s proprietary Artificial Intelligence (AI) algorithms allow scanning, detection and analysis* of your skin on mobile phones in THREE SIMPLE STEPS:\r\n \r\n1)     Use Medgic AI camera to take a photo of your skin condition or disease\r\n2)     Medgic AI brain will analyse.. No humans involved!\r\n3)     Medgic will tell you the results*, along with some friendly advices*\r\n \r\nFEATURES*\r\n- Camera to capture skin photographs and images\r\n- To detect, appraise and check for dermatological disease or conditions\r\n- To analyze skin health and test for any dryness or inflammation\r\n- To scan, evaluate and recognize any skin problems\r\n- To suggest friendly advices for general good health, fitness and healthy lifestyle\r\n \r\nEXAMPLES OF CONDITIONS*\r\n- Inspect, spot and scan for healthy, beautiful or unhealthy skin\r\n- Review, investigate and examine for smooth or saggy, bad and dry skin\r\n- Analysis, study and evaluation of unknown skin for any of the following common dermatological cutaneous problems or diseases (allergies, allergy, lump, bump, lesion, discoloration, darkening, pigmentation, sun burn, solar damage, erythema, eczema, dermatitis, skin aging, cancer, squamous cell carcinoma, basal cell carcinoma, melanoma, atopic dermatitis, seborrheic keratosis, acne, zit, pimple, black head, white head, rosacea, acne vulgaris, comedone, scarring, scar, wrinkle, ulcer, tumor, pressure sore, ringworm, fungus, larva migrans, bite, spider vein, telangiectasia, striae, stretch mark, mole, nevus, nevi, vitiligo, liver spot, melasma, dark or pigmented spot, bruising, hemangioma, purpura, psoriasis, callus and corn, abscess, boil, carbuncle, furuncle, folliculitis, tinea, keloid, xerosis, wart, itchy skin, pruritus, wheal, urticaria, blister, cold sore, skin tag, cyst, lipoma, ganglion, fibroma, tophi and other joint swellings.)\r\n \r\n*PLEASE NOTE THAT MEDGIC IS NOT:\r\n(see complete policy: https://medgic.co/en/tap?tab=tou)\r\n- A diagnostic medical device or investigation. It cannot diagnose or perform health screening and checkup. It does not offer diagnosis, histology, dermatoscopy, biopsy or other confirmatory services\r\n- A replacement or substitution for consultation with a doctor, licensed physician or qualified health care professional. It cannot provide second opinions and formal medical examination, consult and guidance\r\n- A therapeutic or management guide. It cannot offer treatment or dispense medications or creams\r\n- A dermatologist, dermatology clinic, dermatology book, resource or hospital\r\n- An emergency service\r\n- A referral for derm medics or skin specialists\r\n- An AI doctor or robot physician. It cannot determine the final diagnosis and cannot treat humans\r\n- An appropriate appraisal tool for hair, nail and general health\r\n- Guaranteed to provide 100% accurate results\r\n \r\nMISSION:\r\nWe hope our AI technology can be deployed to the real world one day to benefit mankind, but we are still a work in progress! Please rate us positively so that we can keep improving!\r\n \r\n--------------\r\n \r\nWe are always happy to hear from you, do reach out to us at: hello@medgic.co  \r\n\r\nFollow us on https://www.facebook.com/medgic.co or https://www.instagram.com/medgic.co/\r\n \r\nWebsite: https://www.medgic.co\r\n \r\nTerms of Use: https://medgic.co/en/tap?tab=tou\r\nPrivacy Policy: https://medgic.co/en/tap?tab=pp \r\nFAQ: https://medgic.co/en/faq",
    "descriptionHTML": "Medgic’s proprietary Artificial Intelligence (AI) algorithms allow scanning, detection and analysis* of your skin on mobile phones in THREE SIMPLE STEPS:<br> <br>1)     Use Medgic AI camera to take a photo of your skin condition or disease<br>2)     Medgic AI brain will analyse.. No humans involved!<br>3)     Medgic will tell you the results*, along with some friendly advices*<br> <br>FEATURES*<br>- Camera to capture skin photographs and images<br>- To detect, appraise and check for dermatological disease or conditions<br>- To analyze skin health and test for any dryness or inflammation<br>- To scan, evaluate and recognize any skin problems<br>- To suggest friendly advices for general good health, fitness and healthy lifestyle<br> <br>EXAMPLES OF CONDITIONS*<br>- Inspect, spot and scan for healthy, beautiful or unhealthy skin<br>- Review, investigate and examine for smooth or saggy, bad and dry skin<br>- Analysis, study and evaluation of unknown skin for any of the following common dermatological cutaneous problems or diseases (allergies, allergy, lump, bump, lesion, discoloration, darkening, pigmentation, sun burn, solar damage, erythema, eczema, dermatitis, skin aging, cancer, squamous cell carcinoma, basal cell carcinoma, melanoma, atopic dermatitis, seborrheic keratosis, acne, zit, pimple, black head, white head, rosacea, acne vulgaris, comedone, scarring, scar, wrinkle, ulcer, tumor, pressure sore, ringworm, fungus, larva migrans, bite, spider vein, telangiectasia, striae, stretch mark, mole, nevus, nevi, vitiligo, liver spot, melasma, dark or pigmented spot, bruising, hemangioma, purpura, psoriasis, callus and corn, abscess, boil, carbuncle, furuncle, folliculitis, tinea, keloid, xerosis, wart, itchy skin, pruritus, wheal, urticaria, blister, cold sore, skin tag, cyst, lipoma, ganglion, fibroma, tophi and other joint swellings.)<br> <br>*PLEASE NOTE THAT MEDGIC IS NOT:<br>(see complete policy: https://medgic.co/en/tap?tab=tou)<br>- A diagnostic medical device or investigation. It cannot diagnose or perform health screening and checkup. It does not offer diagnosis, histology, dermatoscopy, biopsy or other confirmatory services<br>- A replacement or substitution for consultation with a doctor, licensed physician or qualified health care professional. It cannot provide second opinions and formal medical examination, consult and guidance<br>- A therapeutic or management guide. It cannot offer treatment or dispense medications or creams<br>- A dermatologist, dermatology clinic, dermatology book, resource or hospital<br>- An emergency service<br>- A referral for derm medics or skin specialists<br>- An AI doctor or robot physician. It cannot determine the final diagnosis and cannot treat humans<br>- An appropriate appraisal tool for hair, nail and general health<br>- Guaranteed to provide 100% accurate results<br> <br>MISSION:<br>We hope our AI technology can be deployed to the real world one day to benefit mankind, but we are still a work in progress! Please rate us positively so that we can keep improving!<br> <br>--------------<br> <br>We are always happy to hear from you, do reach out to us at: hello@medgic.co  <br><br>Follow us on https://www.facebook.com/medgic.co or https://www.instagram.com/medgic.co/<br> <br>Website: https://www.medgic.co<br> <br>Terms of Use: https://medgic.co/en/tap?tab=tou<br>Privacy Policy: https://medgic.co/en/tap?tab=pp <br>FAQ: https://medgic.co/en/faq",
    "summary": "Scan, analyze and check your skin with Artificial Intelligence. Fast and easy!",
    "installs": "500,000+",
    "minInstalls": 500000,
    "realInstalls": 740836,
    "score": 3.33,
    "ratings": 5718,
    "reviews": 293,
    "histogram": [
        1423,
        625,
        564,
        797,
        2282
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "developer": "MEDNET PTE LTD",
    "developerId": "MEDNET+PTE+LTD",
    "developerEmail": "hello@medgic.co",
    "developerWebsite": "https://www.medgic.co",
    "developerAddress": null,
    "privacyPolicy": "https://www.medgic.co/pp",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "categories": [
        {
            "name": "Medical",
            "id": "MEDICAL"
        }
    ],
    "icon": "https://play-lh.googleusercontent.com/BWwIBcFWONwebZZ6RBizOn2il32XR9alQX7qPgu4kULxTODmfaDHJAtYveEhV1aGIhQ",
    "headerImage": "https://play-lh.googleusercontent.com/AHzwvInH_arajMA3WwI5ODR5aIkdHXB61M_BnLONg_wAqeIcPUE-fIO7nFx9p8I8kBZq",
    "screenshots": [
        "https://play-lh.googleusercontent.com/-sl2Zzg9NfxD89kmxS-G6x7KmS6mBnzBrafvH1luntDOxDKaEfmPL-cWh7-nlnUJNng",
        "https://play-lh.googleusercontent.com/2hHV0S9weV7cq4otDhq3l4rMPLlg12aES0aNZUrkNaemhNDkizkLZNVa1-FCw7b33g",
        "https://play-lh.googleusercontent.com/i-9voAYiFxEmj9U608kk4NUcmt_FEcg_cwSjUe1tw9bpEkkVWoWEKt9hVNrtQ4YQ3w",
        "https://play-lh.googleusercontent.com/yyjDcy0YrDR-B2iCOnN3qQ_kqDR-fOE4roKZdTAOOmdx9lT6S5JRZbSFhyn4QVLJAXI",
        "https://play-lh.googleusercontent.com/Tksv7-iL4YQRLmNzm5sTye77nHORLciCaXzNRvAeNIGd1ftfTH4HjVdI1z2rAXIjJqc"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": false,
    "containsAds": false,
    "released": "Jul 29, 2018",
    "lastUpdatedOn": "Aug 11, 2024",
    "updated": 1723442356,
    "version": "1.9.9",
    "comments": [],
    "appId": "co.medgic.medgic",
    "url": "https://play.google.com/store/apps/details?id=co.medgic.medgic&hl=en&gl=us"
}