{
    "title": "Health & Her Menopause Tracker",
    "description": "Health and Her Menopause App empowers you through your perimenopause and menopause by helping you build positive lifestyle habits that put you back in control. \r\n\r\nThe Health & Her menopause app is the first personal trainer for your menopause journey. Get free evidence-based exercises, tools and tracking to help you stay on top of your symptoms. \r\n\r\nSymptom toolkit includes: Cognitive Behavioural Therapy (CBT) exercises for hot flashes, night sweats and low mood, Guided Imagery Meditation for better sleep, Pelvic Floor Training for sensitive bladders, Deep Breathing for stress & worry, and more. \r\n\r\nExercises are guided and can be effortlessly scheduled into a tailored plan with supportive daily reminders to keep you on track and committed towards positive behavioral change. \r\n\r\nWith the Health and Her Menopause App you also gain access to a free library of expert content tailored to the changes you’re experiencing. Complete daily symptom assessments to monitor what is triggering or improving your symptoms. Learn more about your body, mind, and hormones, and discover top tips. From gynecologists and psychologists, to sleep experts and career coaches - our panel includes top menopause experts. \r\nBrought to you by the award-winning menopause website Health & Her, the UK's Number 1 Perimenopause Brand* \r\n\r\nHealth & Her Menopause App includes: \r\n\r\nEVIDENCE-BASED EXERCISES \r\n- Access a range of guided exercises and proven techniques designed to help you build positive lifestyle habits\r\n- Symptom toolkit includes: interactive CBT exercises, sleep meditation, muscle relaxation, pelvic floor training, deep breathing, yoga for menopause and more. \r\n\r\nCUSTOM PLAN & REMINDERS \r\n- Create a schedule of activity based on your symptoms\r\n- Get daily reminders to keep you motivated and on track to achieve your goals \r\n- Set quick and easy reminders to take your supplements or HRT \r\n\r\nSYMPTOM & CYCLE TRACKING \r\n- Keep a daily log of symptoms, triggers and activities to track your menopause overtime\r\n- Track perimenopause related menstrual cycle changes with the dedicated period tracking feature, and get period predictions based on your patterns\r\n- Integrate with Apple Health to track your menstrual cycle from all sources.\r\n\r\nSMART INSIGHTS\r\n-\tSelect where you are in your journey and track perimenopause, menopause or post menopause symptoms directly in the app\r\n-\tIdentify important patterns and discover which lifestyle factors could be making your symptoms improve or worsen\r\n\r\nTAILORED EXPERT ADVICE \r\n\r\n- Get expert menopause advice from leading Gynecologists, Doctors, Nutritionists, Sleep Experts, Relationship Counsellors, CBT Experts, Fitness Coaches, & more\r\n- Access a content library of over 50 evidence-based resources, with information and tips tailored to the symptoms you’re experiencing \r\n\r\n- Explore a carefully curated selection of self-care options that have been tried and tested by women just like you \r\n\r\nThousands of women are already using Health & Her to help manage their menopause. Here’s more about us: \r\n\r\n- Featured in Good Housekeeping,  Sky News, MSN , Yahoo News and many more.\r\n\r\n- We partner with Universities for research and study in the area of Women’s Health\r\n\r\n*IRI, Women’s Health category, Value Sales, 52 wks to 19th Feb 2022, Total Market UK.",
    "descriptionHTML": "Health and Her Menopause App empowers you through your perimenopause and menopause by helping you build positive lifestyle habits that put you back in control. <br><br>The Health &amp; Her menopause app is the first personal trainer for your menopause journey. Get free evidence-based exercises, tools and tracking to help you stay on top of your symptoms. <br><br>Symptom toolkit includes: Cognitive Behavioural Therapy (CBT) exercises for hot flashes, night sweats and low mood, Guided Imagery Meditation for better sleep, Pelvic Floor Training for sensitive bladders, Deep Breathing for stress &amp; worry, and more. <br><br>Exercises are guided and can be effortlessly scheduled into a tailored plan with supportive daily reminders to keep you on track and committed towards positive behavioral change. <br><br>With the Health and Her Menopause App you also gain access to a free library of expert content tailored to the changes you’re experiencing. Complete daily symptom assessments to monitor what is triggering or improving your symptoms. Learn more about your body, mind, and hormones, and discover top tips. From gynecologists and psychologists, to sleep experts and career coaches - our panel includes top menopause experts. <br>Brought to you by the award-winning menopause website Health &amp; Her, the UK&#39;s Number 1 Perimenopause Brand* <br><br>Health &amp; Her Menopause App includes: <br><br>EVIDENCE-BASED EXERCISES <br>- Access a range of guided exercises and proven techniques designed to help you build positive lifestyle habits<br>- Symptom toolkit includes: interactive CBT exercises, sleep meditation, muscle relaxation, pelvic floor training, deep breathing, yoga for menopause and more. <br><br>CUSTOM PLAN &amp; REMINDERS <br>- Create a schedule of activity based on your symptoms<br>- Get daily reminders to keep you motivated and on track to achieve your goals <br>- Set quick and easy reminders to take your supplements or HRT <br><br>SYMPTOM &amp; CYCLE TRACKING <br>- Keep a daily log of symptoms, triggers and activities to track your menopause overtime<br>- Track perimenopause related menstrual cycle changes with the dedicated period tracking feature, and get period predictions based on your patterns<br>- Integrate with Apple Health to track your menstrual cycle from all sources.<br><br>SMART INSIGHTS<br>-\tSelect where you are in your journey and track perimenopause, menopause or post menopause symptoms directly in the app<br>-\tIdentify important patterns and discover which lifestyle factors could be making your symptoms improve or worsen<br><br>TAILORED EXPERT ADVICE <br><br>- Get expert menopause advice from leading Gynecologists, Doctors, Nutritionists, Sleep Experts, Relationship Counsellors, CBT Experts, Fitness Coaches, &amp; more<br>- Access a content library of over 50 evidence-based resources, with information and tips tailored to the symptoms you’re experiencing <br><br>- Explore a carefully curated selection of self-care options that have been tried and tested by women just like you <br><br>Thousands of women are already using Health &amp; Her to help manage their menopause. Here’s more about us: <br><br>- Featured in Good Housekeeping,  Sky News, MSN , Yahoo News and many more.<br><br>- We partner with Universities for research and study in the area of Women’s Health<br><br>*IRI, Women’s Health category, Value Sales, 52 wks to 19th Feb 2022, Total Market UK.",
    "summary": "Personalised menopause support that puts you back in control.",
    "installs": "100,000+",
    "minInstalls": 100000,
    "realInstalls": 228762,
    "score": 4.287129,
    "ratings": 3115,
    "reviews": 110,
    "histogram": [
        214,
        58,
        332,
        488,
        2001
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "developer": "Health & Her",
    "developerId": "Health+%26+Her",
    "developerEmail": "contact@healthandher.com",
    "developerWebsite": "https://healthandher.com",
    "developerAddress": null,
    "privacyPolicy": "https://healthandher.com/privacy-policy/",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "categories": [
        {
            "name": "Health & Fitness",
            "id": "HEALTH_AND_FITNESS"
        }
    ],
    "icon": "https://play-lh.googleusercontent.com/mBnlL9iLmRv78mhCAUrRavZOgxlAJQR8HS4VATarWOiQ4jYeyRGDs-GGP3aTlLtcoYWU",
    "headerImage": "https://play-lh.googleusercontent.com/qsKb6Rl38WxGA8d8OGCWDLndr7td8HEClRV3a1zgYjaHU3X41SLo1qccypCAPSE6oIs",
    "screenshots": [
        "https://play-lh.googleusercontent.com/j_3jDbA5166OZjNPzPzfhj5oxQ-UbLvzKxVVXW5RC4hNCz-1-ZEy1ihztaMIHj2QjE8",
        "https://play-lh.googleusercontent.com/nw8FQEze9I5lQsJ96kXsHebqi_11_aH6UCNK_5bJITN1xIXO2qQAZEbiLQuCiR1qjLY",
        "https://play-lh.googleusercontent.com/b2gU2KvorNLJBFiuySl650AcHvEM-byHWxQm-bAmL9UWHfqhSdG74Ts6tr77LI6Zhw",
        "https://play-lh.googleusercontent.com/cvv_AJmGjX_Wii6-shVBmJJMnBYIZ8pyrbiDyrJkNc-JG_5N3awRQy-hgN1XFOJsSA",
        "https://play-lh.googleusercontent.com/WQn4NpJX6jNofp3zIR2223n-2J4PTpKSIRdw7rYL_ivzfikGXoQdbF-K59yV2iY3AVI",
        "https://play-lh.googleusercontent.com/C3YIEToqmWxLGKfV57M8RTFHtFHwghuugaXpYX9VocPkm1v8rH2BqHDQWr7R950rbbk",
        "https://play-lh.googleusercontent.com/QoDubIID5O4s8yQUok5qHovDgvjMrSrA70v_p83ezkD9655Fo5VgbeB0TcTRBG1sG_Y",
        "https://play-lh.googleusercontent.com/Pc4hEWXN21JeXEgmoU6N__ndSpzaj2pEnafPg7EFToFHPCC1GZfAcF4OQA_jt5fArD5J"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": false,
    "containsAds": false,
    "released": "Oct 22, 2020",
    "lastUpdatedOn": "Jul 30, 2024",
    "updated": 1722333115,
    "version": "1.7.10",
    "comments": [],
    "appId": "com.healthandher",
    "url": "https://play.google.com/store/apps/details?id=com.healthandher&hl=en&gl=us"
}