{
    "title": "Motherocity Postpartum Tracker",
    "description": "ABOUT MOTHEROCITY\r\nDiscover the world’s 1st and only postpartum guide co-written by top health, scientific, and medical experts. Your postpartum tracker, postpartum plan creator, recovery forecasts, and maternal health directory, are all supported by data science and real mom experience! The new and innovative Motherocity is the key to reducing global postpartum maternal morbidity, inequities and disparities among new and pregnant mothers and postpartum parents globally.\r\n\r\nLet's explore all of the wonderful advantages of using Motherocity to help navigate recovery after having a baby and enhancing your postpartum.\r\n\r\n\r\nMOTHEROCITY Features\r\n\r\nPRIVACY FIRST\r\nYour information is secure and protected. You always have the option to erase your health information, which is never shared with organizations other than Motherocity.\r\n\r\nMembers of the Motherocity Health Expert Advisory include doctors, scientists, maternal health specialists, and mothers.\r\nEvery day, thousands of mothers use the Motherocity Postpartum Tracker to record postpartum effects and symptoms.\r\n\r\nPERSONALIZED EXPERIENCE\r\n-52- week Postpartum guide and education\r\n-Customizable Postpartum Tracker for daily updates and tips on your journey\r\n-Maternal Health Directory of specialist worldwide and searchable for your resource\r\n-Postpartum recovery monitoring\r\n-Personalized health insights and journaling\r\n-Safe and judgement free community support \r\n\r\nPOSTPARTUM PLAN CREATION\r\n-Planning tool for your postpartum period for a continuation of care following your birth plan\r\n-Detailed events and requirements for your support team\r\n-In-depth explanations of care, medicine, food, mental healthcare, sleep schedules and more\r\n-Send your details to your supporters and choose what details to share\r\n\r\nMATERNAL HEALTH SPECIALIST DIRECTORY\r\n-Specialists connect with parents in need of postpartum care based on location or preference\r\n-Local and community partners are encouraged to create a free profile to be included in our directory\r\n-Moms and parents are able to search and communicate in live-time with specialists\r\n-Specialists are able to grow their client relationships with families\r\n-Participate in a community of postpartum families in need of virtual and in-person postpartum care\r\n-For Physicians, Health Specialists, Midwives, Doulas, Nurses, Aide and all other professionals offering support to the postpartum community\r\n\r\nCOMMUNITY CONNECTION\r\n-Safe and judgement free direct connection to other moms and parents experiencing postpartum\r\n-Hundreds of educational guides and content for informed recovery\r\n-Community to connect mom, parents and healthcare experts\r\n-Communicate your concerns to gain professional guidance \r\n-Access to real people with guidance, tips, tidbits and guidance\r\n-Maternal Health specialists of all genres and demographics are encouraged to create a free profile\r\n\r\nLIFESTYLE TRACKER & REMINDERS\r\n-Gain the most accurate AI-based picture of your recovery path\r\n-Keep a daily log of your symptoms and activities\r\n-Track changes in your journey (c- section, lactation, weight, mood, vaginal health, uterine health, etc.)\r\n-Journal your hydration, meals, snacks, mood, activity, sleep, pumping, feedings, wet diapers, weight, and postpartum symptoms\r\n-Personalize your daily goals, rituals and self-care routine\r\n-Set reminders of your daily milestones for things like breastfeeding, pumping, hydration, feedings and appointments.\r\n\r\nMEDICAL DISCLAIMER\r\n-Motherocity forecasting and guidance should not be used as a substitute for medical care. \r\n-If you need immediate or emergency attention, please contact your healthcare provider or specialist. \r\n\r\nDATA SAFETY\r\n-Understanding how developers gather and share your data is the first step toward safety. \r\n-Depending on your use, location, and age, data privacy and security standards may change. \r\n-This data is provided by the developer, M.O.O. LLC, who might make future updates.\r\n\r\nSUPPORT \r\nHi@Motherocity.com",
    "descriptionHTML": "ABOUT MOTHEROCITY<br>Discover the world’s 1st and only postpartum guide co-written by top health, scientific, and medical experts. Your postpartum tracker, postpartum plan creator, recovery forecasts, and maternal health directory, are all supported by data science and real mom experience! The new and innovative Motherocity is the key to reducing global postpartum maternal morbidity, inequities and disparities among new and pregnant mothers and postpartum parents globally.<br><br>Let&#39;s explore all of the wonderful advantages of using Motherocity to help navigate recovery after having a baby and enhancing your postpartum.<br><br><br>MOTHEROCITY Features<br><br>PRIVACY FIRST<br>Your information is secure and protected. You always have the option to erase your health information, which is never shared with organizations other than Motherocity.<br><br>Members of the Motherocity Health Expert Advisory include doctors, scientists, maternal health specialists, and mothers.<br>Every day, thousands of mothers use the Motherocity Postpartum Tracker to record postpartum effects and symptoms.<br><br>PERSONALIZED EXPERIENCE<br>-52- week Postpartum guide and education<br>-Customizable Postpartum Tracker for daily updates and tips on your journey<br>-Maternal Health Directory of specialist worldwide and searchable for your resource<br>-Postpartum recovery monitoring<br>-Personalized health insights and journaling<br>-Safe and judgement free community support <br><br>POSTPARTUM PLAN CREATION<br>-Planning tool for your postpartum period for a continuation of care following your birth plan<br>-Detailed events and requirements for your support team<br>-In-depth explanations of care, medicine, food, mental healthcare, sleep schedules and more<br>-Send your details to your supporters and choose what details to share<br><br>MATERNAL HEALTH SPECIALIST DIRECTORY<br>-Specialists connect with parents in need of postpartum care based on location or preference<br>-Local and community partners are encouraged to create a free profile to be included in our directory<br>-Moms and parents are able to search and communicate in live-time with specialists<br>-Specialists are able to grow their client relationships with families<br>-Participate in a community of postpartum families in need of virtual and in-person postpartum care<br>-For Physicians, Health Specialists, Midwives, Doulas, Nurses, Aide and all other professionals offering support to the postpartum community<br><br>COMMUNITY CONNECTION<br>-Safe and judgement free direct connection to other moms and parents experiencing postpartum<br>-Hundreds of educational guides and content for informed recovery<br>-Community to connect mom, parents and healthcare experts<br>-Communicate your concerns to gain professional guidance <br>-Access to real people with guidance, tips, tidbits and guidance<br>-Maternal Health specialists of all genres and demographics are encouraged to create a free profile<br><br>LIFESTYLE TRACKER &amp; REMINDERS<br>-Gain the most accurate AI-based picture of your recovery path<br>-Keep a daily log of your symptoms and activities<br>-Track changes in your journey (c- section, lactation, weight, mood, vaginal health, uterine health, etc.)<br>-Journal your hydration, meals, snacks, mood, activity, sleep, pumping, feedings, wet diapers, weight, and postpartum symptoms<br>-Personalize your daily goals, rituals and self-care routine<br>-Set reminders of your daily milestones for things like breastfeeding, pumping, hydration, feedings and appointments.<br><br>MEDICAL DISCLAIMER<br>-Motherocity forecasting and guidance should not be used as a substitute for medical care. <br>-If you need immediate or emergency attention, please contact your healthcare provider or specialist. <br><br>DATA SAFETY<br>-Understanding how developers gather and share your data is the first step toward safety. <br>-Depending on your use, location, and age, data privacy and security standards may change. <br>-This data is provided by the developer, M.O.O. LLC, who might make future updates.<br><br>SUPPORT <br>Hi@Motherocity.com",
    "summary": "Postpartum recovery tips, education and support for your informed journey.",
    "installs": "1,000+",
    "minInstalls": 1000,
    "realInstalls": 1060,
    "score": 3.8,
    "ratings": 15,
    "reviews": 10,
    "histogram": [
        4,
        0,
        0,
        0,
        10
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": true,
    "inAppProductPrice": "$8.99 - $35.99 per item",
    "developer": "Motherocity Postpartum Tracker",
    "developerId": "Motherocity+Postpartum+Tracker",
    "developerEmail": "DPO@Motherocity.com",
    "developerWebsite": "https://motherocity.com/",
    "developerAddress": null,
    "privacyPolicy": "https://motherocity.com/pages/policy",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "categories": [
        {
            "name": "Health & Fitness",
            "id": "HEALTH_AND_FITNESS"
        }
    ],
    "icon": "https://play-lh.googleusercontent.com/0YwSo849UhNSxt_vVRn06Oyq9hhR_5de2N407fjLf10SdaU4Z_Yb-OxgazngTnkgZTc",
    "headerImage": "https://play-lh.googleusercontent.com/zfWmlwSpfKU8obquK65WhrK1469sTfljvjq_f3QzTRaHBingOLV7lfNJnZpsY6GzKT8",
    "screenshots": [
        "https://play-lh.googleusercontent.com/TxyR3KvtMzbD6spclvlNb5V4XSGFKEjTTxj08qmmmtW7fmEdYF7WeJI6DcOO-F17sw",
        "https://play-lh.googleusercontent.com/G-Q3pMFryCX_F_MJ9z53WJE4gX5UZDo-qR4PlOu8G3DbNZMjQKdOhaUHCLp31nn4Nmw",
        "https://play-lh.googleusercontent.com/ZjckrAbXua-_5_LT_2Khafc6a0O4nCZGZKD62c-cQZOnLVdrVlFcwnqKXdkHxU9RSm8",
        "https://play-lh.googleusercontent.com/7y5FXM2k4oI0XekYoitspWsYL3A2nb7ZEiJyH7LoL5iXtLus1ygPvrxMRaQL8r5tNePa",
        "https://play-lh.googleusercontent.com/y0bBYFgcHcULCUro7oP8Kt0fyuJUw9Qz1M46nRfE4PlNmM8qjFbsGDRdvVmnY-EQ_3Ve",
        "https://play-lh.googleusercontent.com/JZZFlixyz2thb561YV9Qzc7PwBxy7yQdOqp1v8UMB7xknWiXW4ggFAqF_mMHtzMannk"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": false,
    "containsAds": false,
    "released": "Oct 13, 2022",
    "lastUpdatedOn": "Oct 2, 2024",
    "updated": 1727889612,
    "version": "1.0.40",
    "comments": [],
    "appId": "com.motherocity",
    "url": "https://play.google.com/store/apps/details?id=com.motherocity&hl=en&gl=us"
}