{
    "title": "Fit Body Nutrition",
    "description": "Fit Body Boot Camp is America’s Favorite 30-Minute Fat Loss Boot Camp and pairs with the Fit Body Nutrition App to utilize cutting-edge nutrition science to help you get the body you want - all accomplished through the simple process of tracking macros and attending boot camp!\r\n\r\n- PERSONALIZE YOUR EXPERIENCE -\r\nWe know that the only diet that’s ever going to work is the one you can stick to. That’s why we provide a variety of tools and features that allow you to customize your diet to fit your individual preferences, needs, and lifestyle. Prefer more fat over carbs? No problem. Want higher calories on days you work out? You can do that. Need to take a week off from tracking while you travel? Just use our vacation mode. We provide a diet solution that fits your lifestyle, rather than asking you to change your lifestyle to fit a diet.\r\n\r\n- TRACK YOUR FOOD -\r\nThe Fit Body Nutrition App makes tracking macros easy. Our unique macro tracking features allow you to make progress even if you aren’t perfect. If you mess up one day and over or undereat, the app will help you correct course by changing your macros to get you back on track the following days. This truly is a flexible approach to dieting, and it’s all backed by our scientific algorithm proven to give members optimal results.\r\n\r\n- CHECK IN WEEKLY -\r\nCheck-ins are quick and convenient. Just hop on your scale, log your weight, and use any of our simple methods for measuring or estimating body fat. The Fit Body Nutrition system determines whether you were able to reach your macro goals for the week based on the food you logged in your tracker. Check-ins usually take less than a minute and adjustments to your macros are made instantly!\r\n\r\n- GET NEW MACROS -\r\nAs your body and metabolism change, so should your nutrition. This is why one-time macro calculations and static meal plans don’t work—they give you a single set of macros and a plan that doesn’t evolve with you. But through our weekly check-ins, the Fit Body Nutrition system learns your body’s needs better over time and adjusts your macros to help you break through plateaus and make steady progress. You’ll even get coaching messages after each check-in, explaining in detail why your macros did or didn’t change!\r\n\r\n- GET STARTED - \r\nSee your assigned coach or visit a Fit Body Boot Camp today to get started today!",
    "descriptionHTML": "Fit Body Boot Camp is America’s Favorite 30-Minute Fat Loss Boot Camp and pairs with the Fit Body Nutrition App to utilize cutting-edge nutrition science to help you get the body you want - all accomplished through the simple process of tracking macros and attending boot camp!<br><br>- PERSONALIZE YOUR EXPERIENCE -<br>We know that the only diet that’s ever going to work is the one you can stick to. That’s why we provide a variety of tools and features that allow you to customize your diet to fit your individual preferences, needs, and lifestyle. Prefer more fat over carbs? No problem. Want higher calories on days you work out? You can do that. Need to take a week off from tracking while you travel? Just use our vacation mode. We provide a diet solution that fits your lifestyle, rather than asking you to change your lifestyle to fit a diet.<br><br>- TRACK YOUR FOOD -<br>The Fit Body Nutrition App makes tracking macros easy. Our unique macro tracking features allow you to make progress even if you aren’t perfect. If you mess up one day and over or undereat, the app will help you correct course by changing your macros to get you back on track the following days. This truly is a flexible approach to dieting, and it’s all backed by our scientific algorithm proven to give members optimal results.<br><br>- CHECK IN WEEKLY -<br>Check-ins are quick and convenient. Just hop on your scale, log your weight, and use any of our simple methods for measuring or estimating body fat. The Fit Body Nutrition system determines whether you were able to reach your macro goals for the week based on the food you logged in your tracker. Check-ins usually take less than a minute and adjustments to your macros are made instantly!<br><br>- GET NEW MACROS -<br>As your body and metabolism change, so should your nutrition. This is why one-time macro calculations and static meal plans don’t work—they give you a single set of macros and a plan that doesn’t evolve with you. But through our weekly check-ins, the Fit Body Nutrition system learns your body’s needs better over time and adjusts your macros to help you break through plateaus and make steady progress. You’ll even get coaching messages after each check-in, explaining in detail why your macros did or didn’t change!<br><br>- GET STARTED - <br>See your assigned coach or visit a Fit Body Boot Camp today to get started today!",
    "summary": "Food Tracker & Nutrition Coach",
    "installs": "1,000+",
    "minInstalls": 1000,
    "realInstalls": 4790,
    "score": 3.625,
    "ratings": 11,
    "reviews": 4,
    "histogram": [
        2,
        1,
        0,
        0,
        6
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": true,
    "inAppProductPrice": "$84.99 per item",
    "developer": "Fit Body Boot Camp HQ",
    "developerId": "9034110763025290988",
    "developerEmail": "support@fitbodybootcamp.com",
    "developerWebsite": null,
    "developerAddress": null,
    "privacyPolicy": "https://fitbodybootcamp.com/privacy-policy/",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "categories": [
        {
            "name": "Health & Fitness",
            "id": "HEALTH_AND_FITNESS"
        }
    ],
    "icon": "https://play-lh.googleusercontent.com/frnkdwIMOa5fwrwIVShj3_PO_oRbca9FLZtPJLLpNvMzRPCVsWwo6--RXQipQ88Qyg",
    "headerImage": "https://play-lh.googleusercontent.com/CEbrYv1txFzOyOKOZ-KL7WvJJaD3aLdyXnKvaEZt1YT6SoEu2P2a6M6pz3hBY26sH40",
    "screenshots": [
        "https://play-lh.googleusercontent.com/HIjfMt2nCZ4lDu5ryrudQCtrfrt9sJA_K0bnJIbdUGlryLjOCHzRW7NP9lHN4DgXKA",
        "https://play-lh.googleusercontent.com/_u9iXf8JM5MSdGNGfp-CfCF6lCyvQAa4inZEEOyFJ_3U2OIi3Gm64qOg2I4FI3VeULI",
        "https://play-lh.googleusercontent.com/dVUhMtCL_-rp_46HHOqBHcXQOIavY9Y3ELMq5c-ByrLqXjJOJ6rftP68aIoEK6S5HiA",
        "https://play-lh.googleusercontent.com/POuwZMlFg7kGM0g7pkTXvjJ_aps4tCsW0K0orIMEDyCh7Lk84y51c_gyEagSSQGxHUd_",
        "https://play-lh.googleusercontent.com/RjDa3OD9gYlrsc4KC2Csaod-TeoOa5B7xgRo6987JgpEqegK4_Oy6jyo1HdtPLDCQq4",
        "https://play-lh.googleusercontent.com/i79D4fbIGmMlMbv8Obc97XimbTDzDJeU8v8mMso4G2ehTCiKT7e3FlxStV2qIy9ROw",
        "https://play-lh.googleusercontent.com/r1pTaV792SkiZ9SRJg2tBtlKMCLMeu6YNkojf0bWk3LG96kD5ESDRfO9vDMHGDhuow"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": false,
    "containsAds": false,
    "released": "Jul 30, 2022",
    "lastUpdatedOn": "Oct 31, 2024",
    "updated": 1730380333,
    "version": "2.20.11",
    "comments": [],
    "appId": "com.fbbc.avn",
    "url": "https://play.google.com/store/apps/details?id=com.fbbc.avn&hl=en&gl=us"
}