{
    "title": "CenterWell Pharmacy",
    "description": "The new CenterWell Pharmacy™ mobile app makes it easier to keep track of your prescriptions. The new app has the same easy-to-use features, plus upcoming features focused on you.\r\n1. Simplified refill ordering\r\n2. Easy prescription transfers\r\n3. Check your order's status at a glance\r\n \r\n✔ COMPLETE MEDICATION LIST\r\nStay organized with a full list of all your prescriptions filled at CenterWell Pharmacy, including those you no longer need and medication for your dependents.\r\n✔ QUICK REFILLS\r\nEasily refill your prescriptions as soon as you sign in, straight from your home screen.\r\n \r\n✔ PRESCRIPTION DETAILS\r\nView important details about your prescriptions, such as available refill dates, doctor information, images of your meds, and related educational videos.\r\n \r\n✔ ORDER STATUS\r\nKnow where your order is once it’s processed with color-coded order status messages.\r\n \r\n✔ SHIPMENT TRACKING\r\nTrack shipments once they’re shipped to estimate when your medication will arrive.\r\n \r\n✔ SNAP-TO-FILL\r\nSubmit a photo of your current prescription label to easily fill your prescription at CenterWell Pharmacy.\r\n \r\n✔ TRANSFERS\r\nQuickly transfer your current prescriptions to CenterWell Pharmacy by viewing your prescription drug claims information from Humana.\r\n \r\n✔ SPECIALTY MEDICATIONS\r\nRequest a refill of an existing CenterWell Specialty Pharmacy™ prescription and order it at the same time as all your other medication.\r\n \r\n✔ AUTO-REFILLS\r\nAutomatically receive your next set of refills so you’re sure to have your medication on time. NOTE: auto-refills are not available for Medicare customers.\r\n \r\n✔ PAYMENT OPTIONS\r\nChange or update your credit card information and make payments securely from the app.\r\n \r\n✔ PREFERENCES\r\nSet or update your preferences, such as how you want to be communicated (by phone, email or text) or if you’d like to receive an alert when your total charge is over your price limit.\r\n \r\n✔ SHOP PRODUCTS\r\nShop over-the-counter (OTC) products with the Health and Wellness credit that may be part of your Humana member benefit. NOTE: available to Medicare customers only.\r\n \r\nDownload the CenterWell Pharmacy mobile app now to manage all your mail-delivery medications with ease!\r\n \r\nNote: The CenterWell Pharmacy mobile app is available only to Humana members.\r\nFor issues with this app, please email cwpmobilefeedback@humana.com.",
    "descriptionHTML": "The new CenterWell Pharmacy™ mobile app makes it easier to keep track of your prescriptions. The new app has the same easy-to-use features, plus upcoming features focused on you.<br>1. Simplified refill ordering<br>2. Easy prescription transfers<br>3. Check your order&#39;s status at a glance<br> <br>✔ COMPLETE MEDICATION LIST<br>Stay organized with a full list of all your prescriptions filled at CenterWell Pharmacy, including those you no longer need and medication for your dependents.<br>✔ QUICK REFILLS<br>Easily refill your prescriptions as soon as you sign in, straight from your home screen.<br> <br>✔ PRESCRIPTION DETAILS<br>View important details about your prescriptions, such as available refill dates, doctor information, images of your meds, and related educational videos.<br> <br>✔ ORDER STATUS<br>Know where your order is once it’s processed with color-coded order status messages.<br> <br>✔ SHIPMENT TRACKING<br>Track shipments once they’re shipped to estimate when your medication will arrive.<br> <br>✔ SNAP-TO-FILL<br>Submit a photo of your current prescription label to easily fill your prescription at CenterWell Pharmacy.<br> <br>✔ TRANSFERS<br>Quickly transfer your current prescriptions to CenterWell Pharmacy by viewing your prescription drug claims information from Humana.<br> <br>✔ SPECIALTY MEDICATIONS<br>Request a refill of an existing CenterWell Specialty Pharmacy™ prescription and order it at the same time as all your other medication.<br> <br>✔ AUTO-REFILLS<br>Automatically receive your next set of refills so you’re sure to have your medication on time. NOTE: auto-refills are not available for Medicare customers.<br> <br>✔ PAYMENT OPTIONS<br>Change or update your credit card information and make payments securely from the app.<br> <br>✔ PREFERENCES<br>Set or update your preferences, such as how you want to be communicated (by phone, email or text) or if you’d like to receive an alert when your total charge is over your price limit.<br> <br>✔ SHOP PRODUCTS<br>Shop over-the-counter (OTC) products with the Health and Wellness credit that may be part of your Humana member benefit. NOTE: available to Medicare customers only.<br> <br>Download the CenterWell Pharmacy mobile app now to manage all your mail-delivery medications with ease!<br> <br>Note: The CenterWell Pharmacy mobile app is available only to Humana members.<br>For issues with this app, please email cwpmobilefeedback@humana.com.",
    "summary": "This app helps you ✔ refill prescriptions ✔ view order status ✔ track shipments",
    "installs": "500,000+",
    "minInstalls": 500000,
    "realInstalls": 808483,
    "score": 4.093965,
    "ratings": 50461,
    "reviews": 27446,
    "histogram": [
        7290,
        1933,
        2588,
        5574,
        33071
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "developer": "Humana Inc.",
    "developerId": "8169543994509222984",
    "developerEmail": "MobileDevelopers@centerwell.com",
    "developerWebsite": "http://www.centerwellpharmacy.com",
    "developerAddress": null,
    "privacyPolicy": "https://www.humana.com/about/legal/privacy/",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "categories": [
        {
            "name": "Health & Fitness",
            "id": "HEALTH_AND_FITNESS"
        }
    ],
    "icon": "https://play-lh.googleusercontent.com/Si1AAR3GOmvRZ-0RfCEanEvGi8rj0Iee3uBJ2k63C2RWTgkUdG5E-g4TcLhGlU1JYgk",
    "headerImage": "https://play-lh.googleusercontent.com/mSCPTGOmsZu_DwDY5MQP9b8mxQH7d9UttsL-gJoH4eREhZF9NSZAc2qgSxkhi_EdfGQ",
    "screenshots": [
        "https://play-lh.googleusercontent.com/m7oZMLaQxpSpfLMgXxtHTMluyfoYB6kb_C5SEViybsq9mifX-2392EFGfjKYaO6Sku4",
        "https://play-lh.googleusercontent.com/KsZYNphi0JxUQRLhB2cvVx9hgE4X1Kmx9V2m4lEpzUCpquFu8tlGS_T7IrCdW2Wy7Q",
        "https://play-lh.googleusercontent.com/bbcsRAv4nrGS7A35gGoRN0fsV2VbyXwoBJKTT-WzUfSFeTdEOE8I-o-KA8vIIAlZs3A",
        "https://play-lh.googleusercontent.com/1IO_N9DmhMnDppRdjYaordoawATH1MJdGe4ocD88ujNMSys-yKKj8R6TWBibM3klPg",
        "https://play-lh.googleusercontent.com/topgCsMk_WzkZjm97fUOkNRvVLr0rKtDvgXUr9HQ6swwKDOCHumwv9IxHnNWMhWitw"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": false,
    "containsAds": false,
    "released": "Apr 28, 2016",
    "lastUpdatedOn": "Jul 11, 2024",
    "updated": 1720727438,
    "version": "8.1.5",
    "comments": [],
    "appId": "com.humana.pharmacy",
    "url": "https://play.google.com/store/apps/details?id=com.humana.pharmacy&hl=en&gl=us"
}