{
    "title": "iPrescribe",
    "description": "Prescribe Any Drug from Your Phone\r\niPrescribe ushers in a new era of e-prescribing focused on improving patient medication adherence through a seamless prescribing experience for both legend and controlled drugs right from the palm of your hand. A must-have app for any prescriber, including doctors, nurse practitioners, physician assistants, and dentists, iPrescribe gives you the freedom to write and renew prescriptions whenever and wherever you need to, eliminating time spent on the phone with the pharmacy. Prescribe your way, on your schedule, from your phone, because you are not always in front of a computer.\r\n\r\niPrescribe improves patient medication adherence through:\r\n- category defining patient engagement that drives higher fill rates\r\n- price transparency at the point of prescribing\r\n- shortening the time to prescribe by streamlining the process for you and your staff\r\n\r\niPrescribe is brought to you by DrFirst\r\nAs the pioneer of EPCS and creator of e-Rx solutions Rcopia® and iPrescribe®, DrFirst serves more than 348,000 healthcare professionals and delivers nearly 1 billion medication transactions annually.\r\n\r\niPrescribe continually exceeds the highest compliance standards mandated by the DEA, NIST, and HIPAA requirements, and is cloud based, keeping your patient data safe and secure.. iPrescribe is free for providers in the DrFirst prescribing network. \r\n\r\n\r\niPrescribe Benefits\r\nPrescribe Any Drug - Prescribe controlled substances (even schedule II's) and non-controlled drugs.\r\nState PDMP Connection - connect to and check your state's PDMP with a single tap. \r\nFind Your Patients – iPrescribe's PatientFinder will auto-create the patients for whom you have you recently prescribed.\r\nComplement Your EHR - Electronic prescribing does not have to be bound to your EHR. Whether using Allscripts, athenahealth, eClinicalWorks, CareCloud, Dentrix, PracticeFusion, or any other electronic health record system, iPrescribe is the perfect prescribing companion for your EHR.\r\nConnect With Pharmacies - Receive real-time messages from the pharmacy, like renewal or change requests, and respond in seconds.\r\nPrescribe Faster - SmartSigs AI and prescription favorites offer one-tap prescription writing.\r\nPrescribe Safer – tap into the DrFIrst MedHx network to get the clearest picture of your patients’ active medication list.\r\n\r\n\r\nIdentity Verification with IDme\r\niPrescribe partners with IDme for best in class identity proofing and verification. For those with an existing IDme account, registration takes less than five minutes. No IDme account, no problem. Identity proofing and registration takes 15min on average.\r\n\r\nGet Started Today\r\niPrescribe meets federal and state EPCS mandate requirements and is available for prescribers in the United States, US Virgin Islands, and Puerto Rico.\r\n\r\n\r\nDownload iPrescribe and get started now!",
    "descriptionHTML": "Prescribe Any Drug from Your Phone<br>iPrescribe ushers in a new era of e-prescribing focused on improving patient medication adherence through a seamless prescribing experience for both legend and controlled drugs right from the palm of your hand. A must-have app for any prescriber, including doctors, nurse practitioners, physician assistants, and dentists, iPrescribe gives you the freedom to write and renew prescriptions whenever and wherever you need to, eliminating time spent on the phone with the pharmacy. Prescribe your way, on your schedule, from your phone, because you are not always in front of a computer.<br><br>iPrescribe improves patient medication adherence through:<br>- category defining patient engagement that drives higher fill rates<br>- price transparency at the point of prescribing<br>- shortening the time to prescribe by streamlining the process for you and your staff<br><br>iPrescribe is brought to you by DrFirst<br>As the pioneer of EPCS and creator of e-Rx solutions Rcopia® and iPrescribe®, DrFirst serves more than 348,000 healthcare professionals and delivers nearly 1 billion medication transactions annually.<br><br>iPrescribe continually exceeds the highest compliance standards mandated by the DEA, NIST, and HIPAA requirements, and is cloud based, keeping your patient data safe and secure.. iPrescribe is free for providers in the DrFirst prescribing network. <br><br><br>iPrescribe Benefits<br>Prescribe Any Drug - Prescribe controlled substances (even schedule II&#39;s) and non-controlled drugs.<br>State PDMP Connection - connect to and check your state&#39;s PDMP with a single tap. <br>Find Your Patients – iPrescribe&#39;s PatientFinder will auto-create the patients for whom you have you recently prescribed.<br>Complement Your EHR - Electronic prescribing does not have to be bound to your EHR. Whether using Allscripts, athenahealth, eClinicalWorks, CareCloud, Dentrix, PracticeFusion, or any other electronic health record system, iPrescribe is the perfect prescribing companion for your EHR.<br>Connect With Pharmacies - Receive real-time messages from the pharmacy, like renewal or change requests, and respond in seconds.<br>Prescribe Faster - SmartSigs AI and prescription favorites offer one-tap prescription writing.<br>Prescribe Safer – tap into the DrFIrst MedHx network to get the clearest picture of your patients’ active medication list.<br><br><br>Identity Verification with IDme<br>iPrescribe partners with IDme for best in class identity proofing and verification. For those with an existing IDme account, registration takes less than five minutes. No IDme account, no problem. Identity proofing and registration takes 15min on average.<br><br>Get Started Today<br>iPrescribe meets federal and state EPCS mandate requirements and is available for prescribers in the United States, US Virgin Islands, and Puerto Rico.<br><br><br>Download iPrescribe and get started now!",
    "summary": "E-Prescribing App with EPCS",
    "installs": "10,000+",
    "minInstalls": 10000,
    "realInstalls": 43700,
    "score": 4.61,
    "ratings": 703,
    "reviews": 326,
    "histogram": [
        34,
        13,
        13,
        62,
        575
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "developer": "DrFirst",
    "developerId": "DrFirst",
    "developerEmail": "iprescribe@drfirst.com",
    "developerWebsite": "http://www.iprescribe.com",
    "developerAddress": "9420 Key West Avenue, Suite 101 Rockville, MD 20850",
    "privacyPolicy": "http://www.drfirst.com/privacy-policy",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "categories": [
        {
            "name": "Medical",
            "id": "MEDICAL"
        }
    ],
    "icon": "https://play-lh.googleusercontent.com/dFo5XUGYuqwq0-4AWmTaps6z28gs_vSXDVRVTZJIQo1vlKXwK2QE7QITFpeu89u3R18",
    "headerImage": "https://play-lh.googleusercontent.com/KsQkPYqWwi0AsRJAbc3J9cxz7mj-TvJteyI8Y4VmZIYfN6WVvDGCvwBZS029_MPaWm-J",
    "screenshots": [
        "https://play-lh.googleusercontent.com/a7wXjaMI3igGz-OA8ZquBq3Wm_A3Zz-YnQl0AEJfFtQdxUFXjZap-Pof8xWvX1Knf2M",
        "https://play-lh.googleusercontent.com/i3K6NP6Car1GMTDdKCTVkDNmpItOkEzIHS6MBCzouyVL0LUEk1qzTOwIh1oqakTq6Yo",
        "https://play-lh.googleusercontent.com/OH8oCK4kOZMkIzae4VljwPq_sBbN38ZiX_2OA1T0jw2oXZVBfMdo95Im5NSszlfHmks",
        "https://play-lh.googleusercontent.com/btwTR3kwsM0YpdvGYdCEmVg_rudJAiUqUpJxofJ1d9A-ueqpILQpeJRZapE-pl-3OQ",
        "https://play-lh.googleusercontent.com/odpyPYap2djMyE9_jrDBp3llnrhgc4hTkOGPtRaAhKuD_jHjSG79KJ4yWvGlJVSkQ-g",
        "https://play-lh.googleusercontent.com/e2VjWpzdY66IqA3LBttIoOhakP_lKprf-euPQQBFK85k94t77czpahi8Lkj-EedYkeJ9",
        "https://play-lh.googleusercontent.com/JAapDqSzuveOT7gkLv1PBHOF2XjFgJiP36BqJpVn8v6HhTYC44E1A9R0Edy8ZZ30INg",
        "https://play-lh.googleusercontent.com/p5HZijstlrEeGWW-uBMpnFulwy5PgJfunWYLU6bYzIh1BRMuFmQBM_2MvSCGWGzxqQ"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": false,
    "containsAds": false,
    "released": "Dec 16, 2016",
    "lastUpdatedOn": "Oct 2, 2024",
    "updated": 1727884317,
    "version": "6.28.0",
    "comments": [],
    "appId": "com.drfirst.iprescribepro",
    "url": "https://play.google.com/store/apps/details?id=com.drfirst.iprescribepro&hl=en&gl=us"
}