{
    "title": "PetVitality Pet Health Tracker",
    "description": "In today's busy world, keeping track of your pet's health can be a daunting task. PetVitality - Cat & Dog Care Tracker simplifies this process, offering a comprehensive pet management solution to ensure your furry friend stays healthy and happy. This pet health care app provides a centralized platform to manage your pet's health records, schedule care routines, and monitor their well-being with ease.\r\n\r\nPet Health Tracker\r\nWith this Pet organizer, you can keep a detailed pet medical record of your dog or cat's health. The pet health care application allows you to log vital information such as weight, diseases, and medication schedules. By maintaining these records, you can easily identify any changes in your pet's health and take proactive measures to address potential issues. \r\n\r\nVeterinary Journals\r\nThis pet journal app takes pet care to the next level by allowing you to store and organize veterinary journals. Having all this information in one place makes it easy to track your pet's medical history and share it with new veterinarians if needed. This feature of per care tracker app ensures that your pet receives consistent and informed care throughout their life.\r\n\r\nCare Routines and Reminders\r\nNever miss an important care routine again with this dog health app's scheduling and reminder features. Whether it's dog training, toothbrushing, grooming, or administering medications, the pet organizer app lets you set up schedules and receive timely reminders. \r\n\r\nDisease Pattern Detection\r\nOne of the standout features of this pet management app is its ability to detect hidden disease patterns. By analyzing the data you input, the pet organizer app can identify trends and potential health risks. This early detection capability can be crucial in addressing issues before they become serious, potentially saving your pet's life. The pet journal also provides season-specific symptom guidance for pets with allergies, helping you manage their symptoms more effectively.\r\n\r\nDog Epilepsy Management\r\nFor pets with epilepsy, consistent monitoring is essential. The dog epilepsy management app allows you to measure the regularity of seizures and includes a next-seizure prediction feature. This predictive dog health tool helps you prepare and manage epilepsy more effectively, providing peace of mind and better care for your pet.\r\n\r\nFeatures of Pet Vitality – Dog Care Tracker:\r\n- Weight: Keep your Dog or Cat fit and happy, evaluate weight with PetVitality's AI tool.\r\n- Allergies: Season-specific symptom guidance for allergic pets.\r\n- Epilepsy: Regularity measurements and Next-seizure Prediction for dogs or cats with epilepsy.\r\n- Feces: Visual poop tracker score.\r\n- Heat: Regularity and next-heat prediction for dog reproductions.\r\n- Heart: Innovative manual heart- and respiratory rate counter for heart disease.\r\n\r\nPet Organizer Additional Features:\r\n- Artificial intelligence content tailored to your dog- or cat's breed and age.\r\n- Calendar, scheduler and reminder.\r\n- Medicine and health Tracker for dogs and cats.\r\n- AI medicine information provider for pets.\r\n- Mobile document scanner, Scan your cat and dog documents into PDF from image.\r\n- AI Ingredient-scanner for pet food and pet treats.\r\n- Export your Data to your veterinarian or yourself.\r\n- Emergency miniguides and toxicity calculator.\r\n- Designated document- and photo gallery cloud storage\r\n\r\nPersonal Gallery\r\nCapture and cherish every moment with your pet using Pet Vitality's personal photo and document gallery. Create a visual diary of your pet's growth, milestones, and precious memories. \r\n\r\nPet Vitality - Cat & Dog Symptom Tracker is more than just a pet health tracker app; it's a comprehensive pet management tool for responsible pet owners. By providing a centralized platform to track health, store vital records, detect disease patterns, and access emergency information, the pet health care app ensures that your pet receives the best possible care.",
    "descriptionHTML": "In today&#39;s busy world, keeping track of your pet&#39;s health can be a daunting task. PetVitality - Cat &amp; Dog Care Tracker simplifies this process, offering a comprehensive pet management solution to ensure your furry friend stays healthy and happy. This pet health care app provides a centralized platform to manage your pet&#39;s health records, schedule care routines, and monitor their well-being with ease.<br><br>Pet Health Tracker<br>With this Pet organizer, you can keep a detailed pet medical record of your dog or cat&#39;s health. The pet health care application allows you to log vital information such as weight, diseases, and medication schedules. By maintaining these records, you can easily identify any changes in your pet&#39;s health and take proactive measures to address potential issues. <br><br>Veterinary Journals<br>This pet journal app takes pet care to the next level by allowing you to store and organize veterinary journals. Having all this information in one place makes it easy to track your pet&#39;s medical history and share it with new veterinarians if needed. This feature of per care tracker app ensures that your pet receives consistent and informed care throughout their life.<br><br>Care Routines and Reminders<br>Never miss an important care routine again with this dog health app&#39;s scheduling and reminder features. Whether it&#39;s dog training, toothbrushing, grooming, or administering medications, the pet organizer app lets you set up schedules and receive timely reminders. <br><br>Disease Pattern Detection<br>One of the standout features of this pet management app is its ability to detect hidden disease patterns. By analyzing the data you input, the pet organizer app can identify trends and potential health risks. This early detection capability can be crucial in addressing issues before they become serious, potentially saving your pet&#39;s life. The pet journal also provides season-specific symptom guidance for pets with allergies, helping you manage their symptoms more effectively.<br><br>Dog Epilepsy Management<br>For pets with epilepsy, consistent monitoring is essential. The dog epilepsy management app allows you to measure the regularity of seizures and includes a next-seizure prediction feature. This predictive dog health tool helps you prepare and manage epilepsy more effectively, providing peace of mind and better care for your pet.<br><br>Features of Pet Vitality – Dog Care Tracker:<br>- Weight: Keep your Dog or Cat fit and happy, evaluate weight with PetVitality&#39;s AI tool.<br>- Allergies: Season-specific symptom guidance for allergic pets.<br>- Epilepsy: Regularity measurements and Next-seizure Prediction for dogs or cats with epilepsy.<br>- Feces: Visual poop tracker score.<br>- Heat: Regularity and next-heat prediction for dog reproductions.<br>- Heart: Innovative manual heart- and respiratory rate counter for heart disease.<br><br>Pet Organizer Additional Features:<br>- Artificial intelligence content tailored to your dog- or cat&#39;s breed and age.<br>- Calendar, scheduler and reminder.<br>- Medicine and health Tracker for dogs and cats.<br>- AI medicine information provider for pets.<br>- Mobile document scanner, Scan your cat and dog documents into PDF from image.<br>- AI Ingredient-scanner for pet food and pet treats.<br>- Export your Data to your veterinarian or yourself.<br>- Emergency miniguides and toxicity calculator.<br>- Designated document- and photo gallery cloud storage<br><br>Personal Gallery<br>Capture and cherish every moment with your pet using Pet Vitality&#39;s personal photo and document gallery. Create a visual diary of your pet&#39;s growth, milestones, and precious memories. <br><br>Pet Vitality - Cat &amp; Dog Symptom Tracker is more than just a pet health tracker app; it&#39;s a comprehensive pet management tool for responsible pet owners. By providing a centralized platform to track health, store vital records, detect disease patterns, and access emergency information, the pet health care app ensures that your pet receives the best possible care.",
    "summary": "Dog and Cat All-in-one Health Tracker. Pet Symptoms & Health record Manager.",
    "installs": "1,000+",
    "minInstalls": 1000,
    "realInstalls": 3452,
    "score": 0,
    "ratings": 0,
    "reviews": 0,
    "histogram": [
        0,
        0,
        0,
        0,
        0
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": true,
    "inAppProductPrice": "$3.99 - $7.99 per item",
    "developer": "Lyssa AS",
    "developerId": "5602958118947478957",
    "developerEmail": "dyrebokaservice@gmail.com",
    "developerWebsite": null,
    "developerAddress": "Øvre Årdal, 6884, Flåten 26",
    "privacyPolicy": "https://github.com/Fredjoha01/PrivacyPetVitality/blob/main/PrivacyPolicy.md",
    "genre": "Tools",
    "genreId": "TOOLS",
    "categories": [
        {
            "name": "Tools",
            "id": "TOOLS"
        }
    ],
    "icon": "https://play-lh.googleusercontent.com/4Bxsxpq7ab1_5atPk8l1KWZLicTMcanDyVUtGxaFhYjTrzitXWdu8uFAiu-FTcTTlhw",
    "headerImage": "https://play-lh.googleusercontent.com/RAVHzFnwMhMth47EqivZe-2UGkBSJl2tpuXR9A0uqzSNJwBMNLL9Wva-CoNXR8b8Alk",
    "screenshots": [
        "https://play-lh.googleusercontent.com/HqjZ_EwBNFCoDTN_6j5HCPQ61VISbbhllkVPDW-Ng1sPUbw9K7EkseKqRYFDlzv0wvQ",
        "https://play-lh.googleusercontent.com/FcbaRr4Z_em9Ij3pxBHgjt8IJ7t1uL2VsK1HXescYVGI2HlpfuWooj5FiLD90713kVE",
        "https://play-lh.googleusercontent.com/nkSjA6q7o5L8ChJP5LZAbOwP0isIOyNB1oU212w0HFx9QlwosKWCDTJ0DaluwHydN3s",
        "https://play-lh.googleusercontent.com/gtZ8Olu_Avaebv_F5-wMaCC0ChgdSo-b6A8F8pkddsxh92Jn4jRpy3XZABO8Gmg6eUw",
        "https://play-lh.googleusercontent.com/p8sGgwNM6mn5mKDjgFM9zN2aaIPwG-z95FYlDOK-1WWFSVvLBzwI8uyQwx8hAYMrb38Q",
        "https://play-lh.googleusercontent.com/I9oqBqICxwMX271AEokCHa-ookVFvYhoHs2dZeNqEJe4ItP9ZB6agIHNe-JwZpj_hG8",
        "https://play-lh.googleusercontent.com/-leluXJhzh68IX_6e2XyVDMh5Ej_knAQ3EFbgDDmDtO4jhZh-IUw4r7_Q8oh9MvImms",
        "https://play-lh.googleusercontent.com/1qcd5Bf1PTeH7t7vFbERS--3mhD6e5Xyyq6aWUHZNrDJoFIhn270TfMhbVbtzGTjv9I"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": false,
    "containsAds": false,
    "released": "Mar 17, 2024",
    "lastUpdatedOn": "Oct 15, 2024",
    "updated": 1729015666,
    "version": "1.1.0",
    "comments": [],
    "appId": "com.lyssa.petvitality",
    "url": "https://play.google.com/store/apps/details?id=com.lyssa.petvitality&hl=en&gl=us"
}