{
    "title": "Safe Delivery",
    "description": "The Safe Delivery App – App Store Description Adaptation\r\nHere is the award-winning and research based Safe Delivery App, made to support the provision of high-quality and life-saving obstetric and neonatal care to women and babies everywhere.\r\n\r\nLet us help you to help others!\r\nThis is for all midwives, healthcare professionals and birth attendants that have been longing for a convenient and accessible tool to help them to grow and maintain their maternal and neonatal clinical knowledge, competencies, and skills. This app can help you to develop confidence and the resilience needed to give life-saving care. \r\n\r\nWhy you should download The Safe Delivery App \r\n\r\nFulfil your commitment to lifelong learning!\r\nThe Safe Delivery App enables flexible, self-directed learning in basic midwifery emergency care and essential clinical skills. The clinical content is evidence-based to help keep you up to date with guideline changes, encouraging the provision of high-quality, woman-centred care. You can take ownership for your learning as it helps you to track your own progress, highlighting areas that need revision. \r\n\r\nUser-friendly Design \r\nThis app is easy-to-use and contains concise clinical guidance to support quick responses to time-pressed emergency situations. The app is free and can be downloaded for use offline. This means that it can be used at any time - whether on the job, in your spare time or as part of your training. \r\n\r\nNational and Language versions available\r\nThe Safe Delivery App offers a choice of different national and language settings to make it more appropriate to the different contexts of the users. So far, the app is available in Global English, French and Arabic, as well as being adapted to 18 country versions to align with national guidelines. Our animated videos are also made to be culturally appropriate to help users to relate to the content.\r\n\r\nUseful App Content:\r\n-\tCulturally adapted animated videos of clinical procedures \r\n-\tWritten clinical procedure descriptions related to maternal and newborn health\r\n-\tDrugs lists with protocols for medicine preparation and administration.\r\n-\tA variety of clinical guidance modules, including infection prevention, hypertension, normal labour and birth, postpartum haemorrhage, sepsis and much more. \r\n-\tSearch function for efficient navigation \r\n-\tQuizzes \r\n-\tMyLearning platform for continued education\r\n\r\nAbout the App Creators \r\nThe Safe Delivery App has been developed in a collaboration between the Maternity Foundation, the University of Copenhagen, and the University of Southern Denmark. All procedure guidance has been based on international guidelines of the World Health Organization (WHO) and the International Advanced Life Support in Obstetrics (ALSO). \r\n\r\nLearn More\r\nVisit our webpage at www.safedelivery.org to find all video content and exercises for each module online.",
    "descriptionHTML": "The Safe Delivery App – App Store Description Adaptation<br>Here is the award-winning and research based Safe Delivery App, made to support the provision of high-quality and life-saving obstetric and neonatal care to women and babies everywhere.<br><br>Let us help you to help others!<br>This is for all midwives, healthcare professionals and birth attendants that have been longing for a convenient and accessible tool to help them to grow and maintain their maternal and neonatal clinical knowledge, competencies, and skills. This app can help you to develop confidence and the resilience needed to give life-saving care. <br><br>Why you should download The Safe Delivery App <br><br>Fulfil your commitment to lifelong learning!<br>The Safe Delivery App enables flexible, self-directed learning in basic midwifery emergency care and essential clinical skills. The clinical content is evidence-based to help keep you up to date with guideline changes, encouraging the provision of high-quality, woman-centred care. You can take ownership for your learning as it helps you to track your own progress, highlighting areas that need revision. <br><br>User-friendly Design <br>This app is easy-to-use and contains concise clinical guidance to support quick responses to time-pressed emergency situations. The app is free and can be downloaded for use offline. This means that it can be used at any time - whether on the job, in your spare time or as part of your training. <br><br>National and Language versions available<br>The Safe Delivery App offers a choice of different national and language settings to make it more appropriate to the different contexts of the users. So far, the app is available in Global English, French and Arabic, as well as being adapted to 18 country versions to align with national guidelines. Our animated videos are also made to be culturally appropriate to help users to relate to the content.<br><br>Useful App Content:<br>-\tCulturally adapted animated videos of clinical procedures <br>-\tWritten clinical procedure descriptions related to maternal and newborn health<br>-\tDrugs lists with protocols for medicine preparation and administration.<br>-\tA variety of clinical guidance modules, including infection prevention, hypertension, normal labour and birth, postpartum haemorrhage, sepsis and much more. <br>-\tSearch function for efficient navigation <br>-\tQuizzes <br>-\tMyLearning platform for continued education<br><br>About the App Creators <br>The Safe Delivery App has been developed in a collaboration between the Maternity Foundation, the University of Copenhagen, and the University of Southern Denmark. All procedure guidance has been based on international guidelines of the World Health Organization (WHO) and the International Advanced Life Support in Obstetrics (ALSO). <br><br>Learn More<br>Visit our webpage at www.safedelivery.org to find all video content and exercises for each module online.",
    "summary": "A life-saving mHealth tool for midwives and other skilled birth attendants.",
    "installs": "100,000+",
    "minInstalls": 100000,
    "realInstalls": 296370,
    "score": 4,
    "ratings": 962,
    "reviews": 8,
    "histogram": [
        192,
        0,
        64,
        64,
        641
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "developer": "Maternity Foundation (MF)",
    "developerId": "Maternity+Foundation+(MF)",
    "developerEmail": "mail@maternity.dk",
    "developerWebsite": "http://www.maternity.dk/en",
    "developerAddress": "Forbindelsesvej 3\n2100 Copenhagen\nDenmark",
    "privacyPolicy": "https://www.maternity.dk/privacy-policy/",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "categories": [
        {
            "name": "Medical",
            "id": "MEDICAL"
        }
    ],
    "icon": "https://play-lh.googleusercontent.com/t1BmHggZREkPupTpozADrnyDdl3_pISkQwaY5Rj9bg-VaWwxwMJ7f9iQszW9RNf0-Q",
    "headerImage": "https://play-lh.googleusercontent.com/LKRpmKzbhl8BzzmDKlORqDby6dtueSLrNK013pTiepT1bINwYHotmYw986VluFf6E4Q",
    "screenshots": [
        "https://play-lh.googleusercontent.com/QLuQpUb5KEh9MeDzAtwMue6B3g_wy8oCC3Pkft39XwNtzyn2h9s1dhH2l-Ifupj6qw",
        "https://play-lh.googleusercontent.com/uS1UXjDGJ2NNYysORnk2Z1FijKfpEYjM0esCty_QCNHVaO4FDnIieZQRtq6d6zp54vOF",
        "https://play-lh.googleusercontent.com/XsDLjwyWmEp7iOe2lq25G4ljQ9Kf8HC0K7FR0ozzmhwfn6tMPryFLLB9Fi55c1LEWc4",
        "https://play-lh.googleusercontent.com/hvqAskpzr7d0utAjYTy5vKJZbs3I7e0Ge4uQg8ZVN9Tf2vw8qttsLETmwBsmEE5CDms",
        "https://play-lh.googleusercontent.com/kAIS-pgYAhHtHi-AeCUawK-CtyxHsBqYX5lIPFJUuDySR2QQNvTum4-UO6s-6JZ33DI"
    ],
    "video": "https://www.youtube.com/embed/W7Cfujv0xQU?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://play-lh.googleusercontent.com/LKRpmKzbhl8BzzmDKlORqDby6dtueSLrNK013pTiepT1bINwYHotmYw986VluFf6E4Q",
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": false,
    "containsAds": false,
    "released": "Sep 25, 2015",
    "lastUpdatedOn": "Feb 13, 2024",
    "updated": 1707894224,
    "version": "3.5.7",
    "comments": [],
    "appId": "dk.maternity.safedelivery",
    "url": "https://play.google.com/store/apps/details?id=dk.maternity.safedelivery&hl=en&gl=us"
}