{
    "title": "Medic Scanner - skin analyze",
    "description": "Is the skin lesion normal or cancerous? Download Medic Scanner and conduct an analysis of your moles.\r\n\r\nMedic Scanner is a new clinically tested tool by dermatologists that helps monitor skin condition. The app helps analyze moles on the skin for the most common types of skin cancer, including melanoma. With clinically proven technology, simply take a picture of a mole or spot with your smartphone, and within 20 seconds you will receive an indication of risk level.\r\n\r\nSkin cancer is a growing problem. It is estimated that one in five people will develop skin cancer. That's why regular monitoring of skin conditions and documenting skin changes is so important. Medic Scanner allows you to do this in a simple and convenient way. Using the latest artificial intelligence technology and a wealth of knowledge in dermatology, Medic Scanner helps you assess the risk of skin changes - from spots and nevi to acne to moles and warts. With the image history feature, you can monitor changes in your skin over time, allowing you to manage your skin condition even more effectively. Medic Scanner is a fast, inexpensive and non-invasive solution that can help detect skin cancer at an early stage, when the chances of a cure are greatest. \r\nWith our app, monitoring your skin condition becomes possible anytime, anywhere.\r\n\r\nMore of Medic Scanner\r\nhttps://medicscanner.com/en/\r\n\r\nSTATEMENT\r\nThe Medic Scanner service is not a substitute for a medical examination, and any suspicious nevus should be should be consulted with a medical specialist. The Medic Scanner service is not intended to replace traditional methods of assessing the level of skin cancer risk, is not a diagnosis, and is not a substitute for visiting a doctor. The Medic Scanner service is not intended for use with children.",
    "descriptionHTML": "Is the skin lesion normal or cancerous? Download Medic Scanner and conduct an analysis of your moles.<br><br>Medic Scanner is a new clinically tested tool by dermatologists that helps monitor skin condition. The app helps analyze moles on the skin for the most common types of skin cancer, including melanoma. With clinically proven technology, simply take a picture of a mole or spot with your smartphone, and within 20 seconds you will receive an indication of risk level.<br><br>Skin cancer is a growing problem. It is estimated that one in five people will develop skin cancer. That&#39;s why regular monitoring of skin conditions and documenting skin changes is so important. Medic Scanner allows you to do this in a simple and convenient way. Using the latest artificial intelligence technology and a wealth of knowledge in dermatology, Medic Scanner helps you assess the risk of skin changes - from spots and nevi to acne to moles and warts. With the image history feature, you can monitor changes in your skin over time, allowing you to manage your skin condition even more effectively. Medic Scanner is a fast, inexpensive and non-invasive solution that can help detect skin cancer at an early stage, when the chances of a cure are greatest. <br>With our app, monitoring your skin condition becomes possible anytime, anywhere.<br><br>More of Medic Scanner<br>https://medicscanner.com/en/<br><br>STATEMENT<br>The Medic Scanner service is not a substitute for a medical examination, and any suspicious nevus should be should be consulted with a medical specialist. The Medic Scanner service is not intended to replace traditional methods of assessing the level of skin cancer risk, is not a diagnosis, and is not a substitute for visiting a doctor. The Medic Scanner service is not intended for use with children.",
    "summary": "Download Medic Scanner and conduct an analysis of your moles.",
    "installs": "50,000+",
    "minInstalls": 50000,
    "realInstalls": 72240,
    "score": 3.5652175,
    "ratings": 286,
    "reviews": 19,
    "histogram": [
        68,
        24,
        12,
        37,
        143
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": true,
    "inAppProductPrice": "$1.99 - $37.99 per item",
    "developer": "Investment Analytics",
    "developerId": "Investment+Analytics",
    "developerEmail": "help@enzomind.com",
    "developerWebsite": "https://www.medicscanner.com",
    "developerAddress": "Poland\nul. Chrobrego 4/28\n12-100 Szczytno",
    "privacyPolicy": "https://medicscanner.com/en/polityka-prywatnosci",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "categories": [
        {
            "name": "Medical",
            "id": "MEDICAL"
        }
    ],
    "icon": "https://play-lh.googleusercontent.com/KT4MDjEgCyoO-TTmvso_ZfroeUH7HiqrcaHubbvuIypXqDaeLRUMPXJIT_lCzSKycg",
    "headerImage": "https://play-lh.googleusercontent.com/VrNlFjnGDd3BswKoLyqLeBHXtRNNSqOYKyx_werS7QpS_M_MXeyGRHkQdCL8kfcuyOOj",
    "screenshots": [
        "https://play-lh.googleusercontent.com/gNEX2HubTk6nwv8eXI4gfaODJYDC94tIQBkgZInDYagY5jOao-Pl2otRGuqQyatEi0g",
        "https://play-lh.googleusercontent.com/vAvrn_6n3QOnN4pVZRS8QoTln8AoKYv3sUaadID__5gwSxudFGy2GxAz1YDQOFB0nY0",
        "https://play-lh.googleusercontent.com/29tXuCk9py7BbxuL3l16gE025g9VcC0Pe0rCv43FBT_ASWX_ER4fFrjP8i_o0pmJ9Q",
        "https://play-lh.googleusercontent.com/LyEMLhiy1J3Ow3vJXO_8UeE-7Zh2fNhlNYNmNBTHefyGo-Th0_lxQNoinLGmEY3D9eqc",
        "https://play-lh.googleusercontent.com/rn7boQtgqHWu9ruJJmo48Mpb7VbCZEAoPhUdCyDKaHfIqOsreGSbHxE7WWlvuyayMiM",
        "https://play-lh.googleusercontent.com/OGU_QchUH72vfQ55HiWixodk0Biq_UtkYsQrPIsD-IKe4DqewHh008J0MfjucuETxGfu"
    ],
    "video": "https://www.youtube.com/embed/dDKpPAj2dxU?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://play-lh.googleusercontent.com/VrNlFjnGDd3BswKoLyqLeBHXtRNNSqOYKyx_werS7QpS_M_MXeyGRHkQdCL8kfcuyOOj",
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": false,
    "containsAds": false,
    "released": "Sep 11, 2023",
    "lastUpdatedOn": "Oct 10, 2024",
    "updated": 1728580533,
    "version": "1.6.5",
    "comments": [],
    "appId": "health.medicalscanner.app",
    "url": "https://play.google.com/store/apps/details?id=health.medicalscanner.app&hl=en&gl=us"
}